{
  "tense": "Future Continuous",
  "description": "Used for actions that will be in progress at a specific time in the future",
  "examples": [
    {
      "sentence": "Later, emma will be leaving to school.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time in two days, she will be reviewing the textbook.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will be studying English in two days.",
      "verb": "studying"
    },
    {
      "sentence": "The company will be flying to the airport tomorrow.",
      "verb": "flying"
    },
    {
      "sentence": "They will be painting the furniture soon.",
      "verb": "painting"
    },
    {
      "sentence": "At this time in two days, she will be sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "My parents will be reading mathematics tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "Tonight, the dog will be leaving to the beach.",
      "verb": "leaving"
    },
    {
      "sentence": "The bird will be remembering the trip in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom will be preparing tea later.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, the team will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time later, john will be repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "They will be enjoying the news next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, sarah will be receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the cat will be listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will be reading the lesson later.",
      "verb": "reading"
    },
    {
      "sentence": "The teacher will be playing tennis soon.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, they will be planning the birthday.",
      "verb": "planning"
    },
    {
      "sentence": "Tomorrow, sarah will be visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "The company will be making coffee in two days.",
      "verb": "making"
    },
    {
      "sentence": "At this time this evening, sarah will be choosing a book.",
      "verb": "choosing"
    },
    {
      "sentence": "Soon, you will be finishing the email.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time soon, emma will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "At this time next week, tom will be reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next week, her sister will be completing the presentation.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors will be painting a picture tomorrow.",
      "verb": "painting"
    },
    {
      "sentence": "Tonight, the dog will be getting groceries.",
      "verb": "getting"
    },
    {
      "sentence": "Later, my friend will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "At this time soon, the cat will be playing TV.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, she will be listening to the game.",
      "verb": "listening"
    },
    {
      "sentence": "The bird will be returning to the library soon.",
      "verb": "returning"
    },
    {
      "sentence": "This evening, the bird will be selling a new car.",
      "verb": "selling"
    },
    {
      "sentence": "Tomorrow, the cat will be building a picture.",
      "verb": "building"
    },
    {
      "sentence": "My parents will be listening to a song in two days.",
      "verb": "listening"
    },
    {
      "sentence": "We will be ordering coffee later.",
      "verb": "ordering"
    },
    {
      "sentence": "Her sister will be getting a book soon.",
      "verb": "getting"
    },
    {
      "sentence": "This evening, you will be leaving to the park.",
      "verb": "leaving"
    },
    {
      "sentence": "The teacher will be talking the client tomorrow.",
      "verb": "talking"
    },
    {
      "sentence": "Tom will be talking my family next month.",
      "verb": "talking"
    },
    {
      "sentence": "Later, tom will be remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, emma will be calling the doctor.",
      "verb": "calling"
    },
    {
      "sentence": "Next week, the children will be running to the library.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the cat will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "The company will be drawing the house in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next year, the students will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "The company will be considering the meeting later.",
      "verb": "considering"
    },
    {
      "sentence": "The dog will be planning the birthday this weekend.",
      "verb": "planning"
    },
    {
      "sentence": "My friend will be starting the assignment tonight.",
      "verb": "starting"
    },
    {
      "sentence": "We will be finding flowers this weekend.",
      "verb": "finding"
    },
    {
      "sentence": "I will be enjoying TV tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next week, the manager will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher will be reading Spanish next year.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tonight, my parents will be designing the computer.",
      "verb": "designing"
    },
    {
      "sentence": "Soon, the children will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next week, the teacher will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, john will be completing the proposal.",
      "verb": "completing"
    },
    {
      "sentence": "In two days, our neighbors will be choosing a gift.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time next year, we will be listening to a video.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tomorrow, he will be forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next week, the cat will be preparing dinner.",
      "verb": "preparing"
    },
    {
      "sentence": "She will be drawing a website next week.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time this weekend, the cat will be writing the document.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, the team will be fixing the kitchen.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time next week, her sister will be studying the chapter.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, she will be speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, the bird will be forgetting the situation.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students will be teaching history this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "The team will be fixing the kitchen this evening.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher will be listening to a song next week.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will be cooking a snack next year.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time this weekend, my friend will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "The students will be driving to work tomorrow.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, tom will be leaving to work.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time next year, the dog will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "At this time this weekend, my parents will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "At this time next year, tom will be building the furniture.",
      "verb": "building"
    },
    {
      "sentence": "He will be submitting the contract in two days.",
      "verb": "submitting"
    },
    {
      "sentence": "Next week, sarah will be ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "Next week, the cat will be sending the email.",
      "verb": "sending"
    },
    {
      "sentence": "The bird will be meeting my friend next year.",
      "verb": "meeting"
    },
    {
      "sentence": "John will be enjoying football soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "This evening, our neighbors will be starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, she will be receiving the task.",
      "verb": "receiving"
    },
    {
      "sentence": "She will be driving to the market next week.",
      "verb": "driving"
    },
    {
      "sentence": "In two days, he will be returning to the market.",
      "verb": "returning"
    },
    {
      "sentence": "I will be choosing a new car this weekend.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time tomorrow, you will be finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "Soon, you will be reviewing English.",
      "verb": "reviewing"
    },
    {
      "sentence": "This evening, tom will be considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "He will be considering the decision tonight.",
      "verb": "considering"
    },
    {
      "sentence": "Later, he will be starting the application.",
      "verb": "starting"
    },
    {
      "sentence": "This evening, we will be sending the email.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next month, she will be contacting the neighbors.",
      "verb": "contacting"
    },
    {
      "sentence": "In two days, tom will be repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tonight, my friend will be walking to the library.",
      "verb": "walking"
    },
    {
      "sentence": "In two days, the children will be repairing the bathroom.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tonight, tom will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, our neighbors will be selling a book.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next month, the cat will be speaking the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "Tomorrow, we will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time in two days, emma will be finding the ticket.",
      "verb": "finding"
    },
    {
      "sentence": "Later, the cat will be contacting my parents.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time tomorrow, her sister will be planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, the company will be listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, her sister will be planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, sarah will be choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time later, tom will be listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the bird will be buying flowers.",
      "verb": "buying"
    },
    {
      "sentence": "Sarah will be finishing the report soon.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the dog will be forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next week, the teacher will be drawing the room.",
      "verb": "drawing"
    },
    {
      "sentence": "Tomorrow, her sister will be repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, the team will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this evening, the manager will be running to the library.",
      "verb": "running"
    },
    {
      "sentence": "The company will be understanding mathematics soon.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time tonight, the children will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "Next year, my parents will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "Emma will be choosing the phone this weekend.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents will be learning grammar later.",
      "verb": "learning"
    },
    {
      "sentence": "At this time later, tom will be returning to the market.",
      "verb": "returning"
    },
    {
      "sentence": "Next year, the cat will be completing the document.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next month, our neighbors will be forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "Soon, they will be understanding the chapter.",
      "verb": "understanding"
    },
    {
      "sentence": "In two days, the team will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird will be playing a movie later.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, they will be walking to the library.",
      "verb": "walking"
    },
    {
      "sentence": "I will be listening to tennis this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "The company will be running to the library in two days.",
      "verb": "running"
    },
    {
      "sentence": "At this time tomorrow, our neighbors will be visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "Soon, tom will be sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "Emma will be enjoying TV next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Her sister will be flying to the library this evening.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next month, our neighbors will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Later, john will be building the car.",
      "verb": "building"
    },
    {
      "sentence": "Next month, he will be coming to school.",
      "verb": "coming"
    },
    {
      "sentence": "My parents will be playing a documentary next year.",
      "verb": "playing"
    },
    {
      "sentence": "She will be listening to a song tonight.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, they will be teaching the chapter.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time next month, he will be speaking the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "In two days, she will be cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "Next year, the students will be designing the furniture.",
      "verb": "designing"
    },
    {
      "sentence": "At this time later, she will be arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "Our neighbors will be practicing mathematics later.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time soon, my parents will be going home.",
      "verb": "going"
    },
    {
      "sentence": "The cat will be teaching the textbook this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time later, you will be going to the park.",
      "verb": "going"
    },
    {
      "sentence": "My friend will be speaking my parents tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors will be repairing the house tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this evening, the dog will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, my brother will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "Her sister will be leaving to school this weekend.",
      "verb": "leaving"
    },
    {
      "sentence": "In two days, he will be forgetting the situation.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors will be enjoying the news next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, my brother will be ordering tea.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, emma will be speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher will be writing the project next year.",
      "verb": "writing"
    },
    {
      "sentence": "The company will be thinking about the options this evening.",
      "verb": "thinking"
    },
    {
      "sentence": "He will be choosing a laptop next week.",
      "verb": "choosing"
    },
    {
      "sentence": "The company will be visiting my parents later.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors will be watching football this evening.",
      "verb": "watching"
    },
    {
      "sentence": "Next week, sarah will be drawing the computer.",
      "verb": "drawing"
    },
    {
      "sentence": "This evening, the teacher will be choosing a book.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this weekend, he will be thinking about the birthday.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next month, the cat will be cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will be speaking the team this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next week, the bird will be reviewing the chapter.",
      "verb": "reviewing"
    },
    {
      "sentence": "This weekend, the manager will be playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister will be visiting the client later.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time this evening, the students will be thinking about the birthday.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma will be running to the library next week.",
      "verb": "running"
    },
    {
      "sentence": "They will be watching music tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next month, the teacher will be driving home.",
      "verb": "driving"
    },
    {
      "sentence": "Tom will be understanding history tomorrow.",
      "verb": "understanding"
    },
    {
      "sentence": "The students will be speaking the boss tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time soon, the team will be submitting the proposal.",
      "verb": "submitting"
    },
    {
      "sentence": "They will be reading French later.",
      "verb": "reading"
    },
    {
      "sentence": "The team will be eating a salad later.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be remembering the situation soon.",
      "verb": "remembering"
    },
    {
      "sentence": "Tomorrow, john will be making pasta.",
      "verb": "making"
    },
    {
      "sentence": "You will be reading the chapter tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "My parents will be watching football this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, sarah will be designing the furniture.",
      "verb": "designing"
    },
    {
      "sentence": "My brother will be giving a laptop next week.",
      "verb": "giving"
    },
    {
      "sentence": "My friend will be teaching French in two days.",
      "verb": "teaching"
    },
    {
      "sentence": "This weekend, sarah will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "Later, she will be finding the keys.",
      "verb": "finding"
    },
    {
      "sentence": "Tomorrow, the manager will be calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "They will be speaking the team in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will be choosing groceries soon.",
      "verb": "choosing"
    },
    {
      "sentence": "This evening, my friend will be designing the computer.",
      "verb": "designing"
    },
    {
      "sentence": "The students will be watching music tonight.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be meeting the neighbors tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time later, the dog will be going to school.",
      "verb": "going"
    },
    {
      "sentence": "At this time soon, the teacher will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time tomorrow, i will be going to work.",
      "verb": "going"
    },
    {
      "sentence": "Emma will be teaching the chapter tonight.",
      "verb": "teaching"
    },
    {
      "sentence": "Tom will be forgetting the situation next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah will be selling the keys next week.",
      "verb": "selling"
    },
    {
      "sentence": "Later, the teacher will be building a picture.",
      "verb": "building"
    },
    {
      "sentence": "My friend will be giving clothes this evening.",
      "verb": "giving"
    },
    {
      "sentence": "At this time this weekend, the bird will be starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this weekend, the students will be enjoying a song.",
      "verb": "enjoying"
    },
    {
      "sentence": "Later, the cat will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "Tonight, she will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog will be forgetting the situation tonight.",
      "verb": "forgetting"
    },
    {
      "sentence": "My brother will be reviewing for the exam next year.",
      "verb": "reviewing"
    },
    {
      "sentence": "The company will be driving to the park tomorrow.",
      "verb": "driving"
    },
    {
      "sentence": "At this time in two days, the company will be speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "My friend will be talking the neighbors this weekend.",
      "verb": "talking"
    },
    {
      "sentence": "Tomorrow, emma will be drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, he will be finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "He will be calling the doctor this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "This weekend, the cat will be forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "Emma will be learning the textbook soon.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, the team will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "At this time next year, the cat will be driving home.",
      "verb": "driving"
    },
    {
      "sentence": "At this time next week, the manager will be driving to the library.",
      "verb": "driving"
    },
    {
      "sentence": "Tomorrow, my parents will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "My brother will be starting the email next month.",
      "verb": "starting"
    },
    {
      "sentence": "Next week, you will be receiving the presentation.",
      "verb": "receiving"
    },
    {
      "sentence": "My parents will be driving to the store this weekend.",
      "verb": "driving"
    },
    {
      "sentence": "Our neighbors will be learning grammar next year.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, the children will be giving a book.",
      "verb": "giving"
    },
    {
      "sentence": "Soon, the team will be arriving to the store.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time tonight, he will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "The team will be finishing the email later.",
      "verb": "finishing"
    },
    {
      "sentence": "Our neighbors will be enjoying basketball next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, our neighbors will be ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "We will be forgetting the vacation next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "This weekend, emma will be reading grammar.",
      "verb": "reading"
    },
    {
      "sentence": "Tonight, tom will be finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "My friend will be cleaning the furniture later.",
      "verb": "cleaning"
    },
    {
      "sentence": "The team will be forgetting the trip tonight.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the teacher will be arriving to school.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time next year, the children will be enjoying the news.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, they will be reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, you will be making pizza.",
      "verb": "making"
    },
    {
      "sentence": "My parents will be remembering the future later.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time this evening, sarah will be walking to the library.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, you will be repairing the garden.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next month, they will be reading English.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, my brother will be running to the park.",
      "verb": "running"
    },
    {
      "sentence": "The bird will be enjoying basketball next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time in two days, her sister will be walking to school.",
      "verb": "walking"
    },
    {
      "sentence": "The bird will be making coffee next year.",
      "verb": "making"
    },
    {
      "sentence": "Soon, my parents will be choosing the ticket.",
      "verb": "choosing"
    },
    {
      "sentence": "We will be drawing a picture tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister will be calling the team this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "In two days, my parents will be learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "The children will be playing a podcast next month.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will be remembering the trip next week.",
      "verb": "remembering"
    },
    {
      "sentence": "The company will be going to work this evening.",
      "verb": "going"
    },
    {
      "sentence": "The teacher will be practicing the chapter tomorrow.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next month, our neighbors will be preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "Soon, the cat will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next month, the bird will be playing music.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, the company will be drinking a sandwich.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the team will be enjoying tennis.",
      "verb": "enjoying"
    },
    {
      "sentence": "The dog will be studying science this weekend.",
      "verb": "studying"
    },
    {
      "sentence": "At this time tomorrow, the dog will be thinking about the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat will be designing the furniture next year.",
      "verb": "designing"
    },
    {
      "sentence": "At this time soon, i will be enjoying tea.",
      "verb": "enjoying"
    },
    {
      "sentence": "Later, he will be writing the report.",
      "verb": "writing"
    },
    {
      "sentence": "In two days, sarah will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, emma will be building the car.",
      "verb": "building"
    },
    {
      "sentence": "At this time next month, the children will be driving to the park.",
      "verb": "driving"
    },
    {
      "sentence": "The team will be contacting the doctor tonight.",
      "verb": "contacting"
    },
    {
      "sentence": "She will be making tea later.",
      "verb": "making"
    },
    {
      "sentence": "At this time soon, sarah will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird will be watching a documentary next week.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, the cat will be returning to work.",
      "verb": "returning"
    },
    {
      "sentence": "They will be practicing Spanish this weekend.",
      "verb": "practicing"
    },
    {
      "sentence": "Tonight, she will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "Next week, emma will be cleaning the garden.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next week, my friend will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "This evening, emma will be sending the letter.",
      "verb": "sending"
    },
    {
      "sentence": "I will be completing the task tomorrow.",
      "verb": "completing"
    },
    {
      "sentence": "At this time tonight, the company will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time soon, we will be practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat will be repairing the bathroom in two days.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time in two days, she will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "Later, the team will be giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next week, they will be enjoying pasta.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, we will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "I will be playing a video tonight.",
      "verb": "playing"
    },
    {
      "sentence": "We will be eating dinner tonight.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, the teacher will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "John will be cooking lunch later.",
      "verb": "cooking"
    },
    {
      "sentence": "The company will be giving a book later.",
      "verb": "giving"
    },
    {
      "sentence": "At this time later, the dog will be playing music.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, her sister will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "Emma will be listening to a song next week.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will be repairing the bathroom next year.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tomorrow, you will be planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "You will be finding a present later.",
      "verb": "finding"
    },
    {
      "sentence": "Next week, tom will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "The students will be submitting the project soon.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time tonight, the teacher will be practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "John will be considering the birthday tonight.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, our neighbors will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "Emma will be leaving to school next year.",
      "verb": "leaving"
    },
    {
      "sentence": "I will be planning the event this weekend.",
      "verb": "planning"
    },
    {
      "sentence": "At this time this evening, john will be arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "You will be eating a sandwich this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, our neighbors will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "Emma will be listening to a movie soon.",
      "verb": "listening"
    },
    {
      "sentence": "I will be repairing the room later.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tonight, the teacher will be understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time soon, john will be coming to the office.",
      "verb": "coming"
    },
    {
      "sentence": "Our neighbors will be making lunch later.",
      "verb": "making"
    },
    {
      "sentence": "Her sister will be making a sandwich tonight.",
      "verb": "making"
    },
    {
      "sentence": "Later, we will be enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time soon, the dog will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this weekend, he will be contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, sarah will be talking my friend.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, she will be drawing the kitchen.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tonight, the team will be reading vocabulary.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah will be sending the task next week.",
      "verb": "sending"
    },
    {
      "sentence": "This weekend, the teacher will be arriving to work.",
      "verb": "arriving"
    },
    {
      "sentence": "The team will be ordering tea this weekend.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time soon, my friend will be giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, my brother will be fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time in two days, john will be preparing dinner.",
      "verb": "preparing"
    },
    {
      "sentence": "In two days, sarah will be cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "In two days, tom will be reviewing the textbook.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, the team will be submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "The dog will be contacting my friend this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors will be buying a laptop next year.",
      "verb": "buying"
    },
    {
      "sentence": "Later, you will be practicing the chapter.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this weekend, the teacher will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Tom will be studying grammar this weekend.",
      "verb": "studying"
    },
    {
      "sentence": "Tomorrow, tom will be returning to the gym.",
      "verb": "returning"
    },
    {
      "sentence": "At this time this evening, they will be visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tomorrow, my brother will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "The team will be cleaning the furniture next week.",
      "verb": "cleaning"
    },
    {
      "sentence": "Soon, john will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "John will be submitting the application tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "I will be considering the trip tonight.",
      "verb": "considering"
    },
    {
      "sentence": "The students will be forgetting the decision this weekend.",
      "verb": "forgetting"
    },
    {
      "sentence": "The children will be buying the keys this evening.",
      "verb": "buying"
    },
    {
      "sentence": "Tomorrow, you will be choosing the ticket.",
      "verb": "choosing"
    },
    {
      "sentence": "The cat will be building a website next month.",
      "verb": "building"
    },
    {
      "sentence": "In two days, the children will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "You will be eating coffee soon.",
      "verb": "eating"
    },
    {
      "sentence": "Tonight, the children will be practicing for the exam.",
      "verb": "practicing"
    },
    {
      "sentence": "The team will be eating a salad soon.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will be contacting the team tonight.",
      "verb": "contacting"
    },
    {
      "sentence": "The company will be watching tennis next week.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, the teacher will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "Tomorrow, my parents will be reviewing French.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will be talking the boss next week.",
      "verb": "talking"
    },
    {
      "sentence": "Tonight, you will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "At this time in two days, the team will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "This weekend, they will be thinking about the situation.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tonight, emma will be practicing the lesson.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tomorrow, sarah will be planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, my brother will be returning to the gym.",
      "verb": "returning"
    },
    {
      "sentence": "Soon, the dog will be speaking the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, the bird will be submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time later, she will be enjoying a movie.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, the children will be going downtown.",
      "verb": "going"
    },
    {
      "sentence": "At this time next week, the teacher will be submitting the report.",
      "verb": "submitting"
    },
    {
      "sentence": "The team will be studying the textbook soon.",
      "verb": "studying"
    },
    {
      "sentence": "I will be drawing the room later.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the cat will be playing a documentary.",
      "verb": "playing"
    },
    {
      "sentence": "You will be coming downtown this evening.",
      "verb": "coming"
    },
    {
      "sentence": "I will be walking downtown tonight.",
      "verb": "walking"
    },
    {
      "sentence": "At this time soon, my brother will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "You will be making pasta soon.",
      "verb": "making"
    },
    {
      "sentence": "In two days, the cat will be contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "This weekend, her sister will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, the children will be meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat will be enjoying a documentary this weekend.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next week, the bird will be fixing the garden.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time this evening, the team will be building the kitchen.",
      "verb": "building"
    },
    {
      "sentence": "Later, tom will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "Soon, the children will be coming to the gym.",
      "verb": "coming"
    },
    {
      "sentence": "Later, john will be designing the house.",
      "verb": "designing"
    },
    {
      "sentence": "Our neighbors will be drawing the computer next week.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, emma will be visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time later, he will be getting a gift.",
      "verb": "getting"
    },
    {
      "sentence": "The dog will be making tea tomorrow.",
      "verb": "making"
    },
    {
      "sentence": "Soon, the students will be enjoying a salad.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next week, the company will be visiting my friend.",
      "verb": "visiting"
    },
    {
      "sentence": "Tonight, the cat will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tonight, the company will be cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "The children will be drinking a snack this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, i will be enjoying a song.",
      "verb": "enjoying"
    },
    {
      "sentence": "Her sister will be listening to tennis this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "In two days, my brother will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "At this time tomorrow, i will be forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next month, tom will be watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will be returning downtown in two days.",
      "verb": "returning"
    },
    {
      "sentence": "Emma will be selling flowers next month.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next week, sarah will be cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time later, we will be enjoying juice.",
      "verb": "enjoying"
    },
    {
      "sentence": "This evening, the bird will be listening to a movie.",
      "verb": "listening"
    },
    {
      "sentence": "Tom will be calling the manager soon.",
      "verb": "calling"
    },
    {
      "sentence": "Next year, we will be forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "We will be remembering the problem this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time soon, the children will be choosing a laptop.",
      "verb": "choosing"
    },
    {
      "sentence": "This evening, our neighbors will be getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, i will be calling the client.",
      "verb": "calling"
    },
    {
      "sentence": "This weekend, the manager will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "She will be forgetting the meeting soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "Soon, the children will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "He will be driving to the airport soon.",
      "verb": "driving"
    },
    {
      "sentence": "The children will be watching a song next week.",
      "verb": "watching"
    },
    {
      "sentence": "Next year, the cat will be painting the room.",
      "verb": "painting"
    },
    {
      "sentence": "Next week, the teacher will be designing the house.",
      "verb": "designing"
    },
    {
      "sentence": "The company will be calling the boss this evening.",
      "verb": "calling"
    },
    {
      "sentence": "At this time this weekend, tom will be eating juice.",
      "verb": "eating"
    },
    {
      "sentence": "Tom will be enjoying the news in two days.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, the company will be cleaning a website.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time soon, the team will be giving a laptop.",
      "verb": "giving"
    },
    {
      "sentence": "At this time in two days, my brother will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, he will be preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "This weekend, they will be finding the ticket.",
      "verb": "finding"
    },
    {
      "sentence": "The team will be calling the client next week.",
      "verb": "calling"
    },
    {
      "sentence": "I will be considering the meeting tonight.",
      "verb": "considering"
    },
    {
      "sentence": "Tomorrow, you will be drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, my parents will be reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next year, my friend will be contacting my parents.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time tonight, the children will be studying history.",
      "verb": "studying"
    },
    {
      "sentence": "The teacher will be going to school in two days.",
      "verb": "going"
    },
    {
      "sentence": "Next week, the cat will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister will be selling the keys in two days.",
      "verb": "selling"
    },
    {
      "sentence": "I will be finishing the proposal tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "Next week, you will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "They will be completing the application next week.",
      "verb": "completing"
    },
    {
      "sentence": "Soon, we will be remembering the event.",
      "verb": "remembering"
    },
    {
      "sentence": "My brother will be flying to the park tonight.",
      "verb": "flying"
    },
    {
      "sentence": "This evening, we will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "The manager will be painting a website later.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next year, my brother will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "My parents will be making tea soon.",
      "verb": "making"
    },
    {
      "sentence": "In two days, he will be forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents will be contacting the teacher this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time soon, they will be going to the airport.",
      "verb": "going"
    },
    {
      "sentence": "At this time next month, the dog will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "Our neighbors will be choosing a gift tonight.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this weekend, the students will be getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "The students will be going to the beach tomorrow.",
      "verb": "going"
    },
    {
      "sentence": "They will be fixing a picture next month.",
      "verb": "fixing"
    },
    {
      "sentence": "Soon, my friend will be reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time next year, they will be reading the textbook.",
      "verb": "reading"
    },
    {
      "sentence": "This weekend, the students will be finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "The cat will be writing the proposal next month.",
      "verb": "writing"
    },
    {
      "sentence": "This evening, i will be giving the keys.",
      "verb": "giving"
    },
    {
      "sentence": "Next week, emma will be planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "The bird will be enjoying lunch in two days.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time soon, we will be coming to the airport.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next month, the manager will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next year, he will be reading for the exam.",
      "verb": "reading"
    },
    {
      "sentence": "At this time later, tom will be calling the client.",
      "verb": "calling"
    },
    {
      "sentence": "Our neighbors will be reviewing grammar next month.",
      "verb": "reviewing"
    },
    {
      "sentence": "The students will be considering the meeting soon.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this weekend, the students will be returning downtown.",
      "verb": "returning"
    },
    {
      "sentence": "The team will be remembering the birthday tonight.",
      "verb": "remembering"
    },
    {
      "sentence": "Tonight, my brother will be studying the textbook.",
      "verb": "studying"
    },
    {
      "sentence": "At this time tomorrow, emma will be reviewing science.",
      "verb": "reviewing"
    },
    {
      "sentence": "He will be talking the neighbors soon.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tomorrow, the team will be drawing the garden.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will be giving a laptop this evening.",
      "verb": "giving"
    },
    {
      "sentence": "In two days, sarah will be repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "Tomorrow, the bird will be reviewing for the exam.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, i will be writing the letter.",
      "verb": "writing"
    },
    {
      "sentence": "At this time tomorrow, we will be choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this evening, our neighbors will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time soon, the company will be drawing the furniture.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will be buying a present next year.",
      "verb": "buying"
    },
    {
      "sentence": "At this time tonight, she will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this evening, the bird will be watching a podcast.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, you will be speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tomorrow, they will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, our neighbors will be writing the presentation.",
      "verb": "writing"
    },
    {
      "sentence": "At this time this weekend, the dog will be calling the doctor.",
      "verb": "calling"
    },
    {
      "sentence": "Next year, you will be selling flowers.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next year, my friend will be watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, they will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, my friend will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "Tonight, tom will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "In two days, my brother will be talking the doctor.",
      "verb": "talking"
    },
    {
      "sentence": "This evening, the teacher will be understanding vocabulary.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time tomorrow, the cat will be completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "Emma will be choosing the ticket next month.",
      "verb": "choosing"
    },
    {
      "sentence": "John will be painting the car this evening.",
      "verb": "painting"
    },
    {
      "sentence": "Next week, they will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "This evening, you will be enjoying a snack.",
      "verb": "enjoying"
    },
    {
      "sentence": "We will be planning the options next month.",
      "verb": "planning"
    },
    {
      "sentence": "My parents will be reading vocabulary next week.",
      "verb": "reading"
    },
    {
      "sentence": "The cat will be listening to a movie this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, he will be speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "She will be flying to the market soon.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher will be listening to a song in two days.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next year, the team will be leaving downtown.",
      "verb": "leaving"
    },
    {
      "sentence": "Tomorrow, i will be walking to the gym.",
      "verb": "walking"
    },
    {
      "sentence": "In two days, the company will be building the car.",
      "verb": "building"
    },
    {
      "sentence": "At this time next week, our neighbors will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next week, she will be remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "The teacher will be enjoying a documentary tonight.",
      "verb": "enjoying"
    },
    {
      "sentence": "In two days, our neighbors will be studying the textbook.",
      "verb": "studying"
    },
    {
      "sentence": "Next week, tom will be ordering pasta.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time tonight, my brother will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the company will be speaking the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this weekend, her sister will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "This evening, emma will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "In two days, the bird will be thinking about the vacation.",
      "verb": "thinking"
    },
    {
      "sentence": "Tomorrow, i will be visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be writing the document.",
      "verb": "writing"
    },
    {
      "sentence": "Next week, our neighbors will be finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "At this time soon, they will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "Next year, the company will be going to the airport.",
      "verb": "going"
    },
    {
      "sentence": "Soon, they will be finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "We will be writing the proposal this evening.",
      "verb": "writing"
    },
    {
      "sentence": "At this time tomorrow, we will be fixing the house.",
      "verb": "fixing"
    },
    {
      "sentence": "The team will be getting a new car next year.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next week, the company will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, my friend will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time tomorrow, i will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "At this time tomorrow, my parents will be talking my friend.",
      "verb": "talking"
    },
    {
      "sentence": "The company will be eating pasta in two days.",
      "verb": "eating"
    },
    {
      "sentence": "You will be reviewing history tonight.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next week, tom will be watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, the team will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "They will be receiving the email next month.",
      "verb": "receiving"
    },
    {
      "sentence": "Next week, my parents will be flying to the store.",
      "verb": "flying"
    },
    {
      "sentence": "The manager will be selling a gift next year.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tomorrow, the students will be studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "The cat will be selling the keys next week.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tomorrow, the manager will be drawing the room.",
      "verb": "drawing"
    },
    {
      "sentence": "John will be coming to the library next month.",
      "verb": "coming"
    },
    {
      "sentence": "Later, the cat will be calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "He will be cleaning the car tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher will be going home tomorrow.",
      "verb": "going"
    },
    {
      "sentence": "At this time next year, you will be selling the phone.",
      "verb": "selling"
    },
    {
      "sentence": "The bird will be listening to a podcast this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "You will be completing the task in two days.",
      "verb": "completing"
    },
    {
      "sentence": "They will be thinking about the options in two days.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time later, emma will be reviewing the textbook.",
      "verb": "reviewing"
    },
    {
      "sentence": "The manager will be ordering breakfast this weekend.",
      "verb": "ordering"
    },
    {
      "sentence": "Soon, the teacher will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "You will be playing tennis next week.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, you will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, we will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time this evening, tom will be forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time this weekend, they will be getting a present.",
      "verb": "getting"
    },
    {
      "sentence": "The dog will be getting groceries later.",
      "verb": "getting"
    },
    {
      "sentence": "At this time this weekend, john will be giving a present.",
      "verb": "giving"
    },
    {
      "sentence": "Tomorrow, the teacher will be teaching for the exam.",
      "verb": "teaching"
    },
    {
      "sentence": "The teacher will be choosing clothes in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "Tonight, the teacher will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, my friend will be considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "At this time later, i will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "The students will be giving flowers this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "This evening, john will be remembering the options.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time later, my parents will be selling the ticket.",
      "verb": "selling"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the dog will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "The teacher will be listening to the game later.",
      "verb": "listening"
    },
    {
      "sentence": "Later, the manager will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tonight, the manager will be writing the letter.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, the students will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "This evening, the bird will be thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "Later, he will be completing the application.",
      "verb": "completing"
    },
    {
      "sentence": "My parents will be listening to football next week.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will be planning the birthday in two days.",
      "verb": "planning"
    },
    {
      "sentence": "Later, the company will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma will be flying to the airport tomorrow.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next year, the dog will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company will be playing a podcast next month.",
      "verb": "playing"
    },
    {
      "sentence": "He will be visiting my parents later.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time in two days, the children will be thinking about the options.",
      "verb": "thinking"
    },
    {
      "sentence": "Next week, my parents will be reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time tomorrow, they will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "This evening, the dog will be making a sandwich.",
      "verb": "making"
    },
    {
      "sentence": "At this time next month, the children will be reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "We will be remembering the trip next month.",
      "verb": "remembering"
    },
    {
      "sentence": "Tonight, we will be forgetting the trip.",
      "verb": "forgetting"
    },
    {
      "sentence": "I will be drawing the bathroom soon.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah will be preparing pasta later.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time tonight, my brother will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, emma will be going to work.",
      "verb": "going"
    },
    {
      "sentence": "Next year, i will be building the garden.",
      "verb": "building"
    },
    {
      "sentence": "Next month, he will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "At this time tonight, the children will be going downtown.",
      "verb": "going"
    },
    {
      "sentence": "Next year, her sister will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "This weekend, the teacher will be submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, we will be drinking a sandwich.",
      "verb": "drinking"
    },
    {
      "sentence": "Tomorrow, the dog will be writing the report.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors will be receiving the email this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "Tomorrow, the children will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, emma will be drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, the cat will be speaking the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "Next week, my brother will be giving a book.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next year, she will be enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, you will be planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, her sister will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time in two days, sarah will be understanding the textbook.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this evening, the teacher will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat will be calling the manager soon.",
      "verb": "calling"
    },
    {
      "sentence": "Tonight, i will be returning to the beach.",
      "verb": "returning"
    },
    {
      "sentence": "At this time next year, my friend will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "The students will be contacting the team next week.",
      "verb": "contacting"
    },
    {
      "sentence": "This weekend, the company will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will be watching a documentary later.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, the students will be forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be repairing a website.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this weekend, my parents will be making pizza.",
      "verb": "making"
    },
    {
      "sentence": "At this time tomorrow, tom will be repairing the garden.",
      "verb": "repairing"
    },
    {
      "sentence": "Soon, the company will be repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "Next year, the manager will be drinking a sandwich.",
      "verb": "drinking"
    },
    {
      "sentence": "He will be getting groceries later.",
      "verb": "getting"
    },
    {
      "sentence": "Soon, they will be walking to the market.",
      "verb": "walking"
    },
    {
      "sentence": "The teacher will be drawing the bathroom next week.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next month, her sister will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next year, my brother will be understanding the textbook.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this evening, my brother will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time later, my parents will be receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "Tonight, the children will be starting the task.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this evening, my parents will be playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, my friend will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "The cat will be starting the document soon.",
      "verb": "starting"
    },
    {
      "sentence": "They will be making pizza soon.",
      "verb": "making"
    },
    {
      "sentence": "Soon, the cat will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "My friend will be planning the meeting next week.",
      "verb": "planning"
    },
    {
      "sentence": "Sarah will be thinking about the trip next week.",
      "verb": "thinking"
    },
    {
      "sentence": "This weekend, you will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, he will be writing the email.",
      "verb": "writing"
    },
    {
      "sentence": "At this time in two days, she will be walking to the park.",
      "verb": "walking"
    },
    {
      "sentence": "I will be selling a book tonight.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, our neighbors will be flying to the market.",
      "verb": "flying"
    },
    {
      "sentence": "Next year, the dog will be repairing the bathroom.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next year, john will be forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents will be drinking pizza next week.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom will be returning to the market this evening.",
      "verb": "returning"
    },
    {
      "sentence": "At this time this evening, my brother will be enjoying a movie.",
      "verb": "enjoying"
    },
    {
      "sentence": "You will be watching a movie in two days.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be practicing grammar next year.",
      "verb": "practicing"
    },
    {
      "sentence": "Later, our neighbors will be starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "Later, our neighbors will be reviewing history.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time later, the dog will be fixing the bathroom.",
      "verb": "fixing"
    },
    {
      "sentence": "John will be meeting my parents tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "They will be watching music next month.",
      "verb": "watching"
    },
    {
      "sentence": "The team will be meeting my parents next week.",
      "verb": "meeting"
    },
    {
      "sentence": "The company will be thinking about the future soon.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time soon, he will be driving to school.",
      "verb": "driving"
    },
    {
      "sentence": "My brother will be playing football next month.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, you will be considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this weekend, he will be listening to a movie.",
      "verb": "listening"
    },
    {
      "sentence": "This evening, tom will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next year, our neighbors will be building the garden.",
      "verb": "building"
    },
    {
      "sentence": "John will be making lunch soon.",
      "verb": "making"
    },
    {
      "sentence": "I will be understanding grammar this evening.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time next month, her sister will be receiving the contract.",
      "verb": "receiving"
    },
    {
      "sentence": "I will be drinking dinner soon.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, the company will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "She will be thinking about the vacation tonight.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next month, the bird will be reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "This evening, my brother will be considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "She will be teaching Spanish next year.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, my friend will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "This weekend, the students will be painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "The teacher will be leaving to the beach in two days.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time next week, sarah will be finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time tonight, i will be learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "The dog will be painting the house this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "She will be choosing the keys next year.",
      "verb": "choosing"
    },
    {
      "sentence": "The students will be playing a song this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will be enjoying the game this evening.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next week, the students will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next year, emma will be writing the task.",
      "verb": "writing"
    },
    {
      "sentence": "This evening, the team will be painting the garden.",
      "verb": "painting"
    },
    {
      "sentence": "The children will be forgetting the situation next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time later, the team will be choosing the phone.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time soon, the team will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, the bird will be teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "This weekend, her sister will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next week, the cat will be writing the proposal.",
      "verb": "writing"
    },
    {
      "sentence": "In two days, my brother will be eating juice.",
      "verb": "eating"
    },
    {
      "sentence": "This evening, the bird will be walking home.",
      "verb": "walking"
    },
    {
      "sentence": "The cat will be choosing flowers this weekend.",
      "verb": "choosing"
    },
    {
      "sentence": "Later, he will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "Later, emma will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "My parents will be finishing the assignment next week.",
      "verb": "finishing"
    },
    {
      "sentence": "The company will be finding a laptop soon.",
      "verb": "finding"
    },
    {
      "sentence": "At this time next month, our neighbors will be starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "I will be cooking a snack next month.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah will be watching football soon.",
      "verb": "watching"
    },
    {
      "sentence": "The children will be meeting my friend next week.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time tonight, the students will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "Next year, my parents will be calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next month, they will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tonight, we will be enjoying pizza.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, her sister will be practicing French.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat will be building the furniture soon.",
      "verb": "building"
    },
    {
      "sentence": "This evening, the company will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next year, the company will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, our neighbors will be preparing breakfast.",
      "verb": "preparing"
    },
    {
      "sentence": "This evening, she will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, they will be reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time in two days, you will be cooking coffee.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next month, we will be leaving to the gym.",
      "verb": "leaving"
    },
    {
      "sentence": "Tomorrow, emma will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah will be meeting my friend next month.",
      "verb": "meeting"
    },
    {
      "sentence": "My parents will be enjoying tea in two days.",
      "verb": "enjoying"
    },
    {
      "sentence": "Her sister will be meeting the manager soon.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird will be learning the textbook tomorrow.",
      "verb": "learning"
    },
    {
      "sentence": "Later, he will be designing the bathroom.",
      "verb": "designing"
    },
    {
      "sentence": "This weekend, the children will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "At this time later, the cat will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, the team will be getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, emma will be practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next week, you will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "Next week, we will be practicing vocabulary.",
      "verb": "practicing"
    },
    {
      "sentence": "This evening, my brother will be arriving to the airport.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time next month, tom will be reading science.",
      "verb": "reading"
    },
    {
      "sentence": "My brother will be teaching grammar next month.",
      "verb": "teaching"
    },
    {
      "sentence": "Emma will be giving the keys this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "Soon, the cat will be coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "At this time later, sarah will be teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time in two days, the manager will be ordering a salad.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, the teacher will be getting the phone.",
      "verb": "getting"
    },
    {
      "sentence": "The team will be leaving to the gym this evening.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time next year, her sister will be repairing a picture.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will be thinking about the birthday this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time this weekend, tom will be receiving the letter.",
      "verb": "receiving"
    },
    {
      "sentence": "Tomorrow, my friend will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "The company will be cooking pasta this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "The team will be getting clothes this weekend.",
      "verb": "getting"
    },
    {
      "sentence": "He will be meeting the doctor next year.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah will be enjoying basketball next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next year, john will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "At this time tonight, the teacher will be flying downtown.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher will be flying to the office this weekend.",
      "verb": "flying"
    },
    {
      "sentence": "We will be visiting the manager next month.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tomorrow, the company will be submitting the email.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, i will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "Next year, john will be practicing English.",
      "verb": "practicing"
    },
    {
      "sentence": "Next year, she will be returning downtown.",
      "verb": "returning"
    },
    {
      "sentence": "Soon, the bird will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "John will be drawing the kitchen in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister will be calling the neighbors next week.",
      "verb": "calling"
    },
    {
      "sentence": "My brother will be planning the situation soon.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors will be contacting my friend this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this weekend, my friend will be calling the neighbors.",
      "verb": "calling"
    },
    {
      "sentence": "At this time tomorrow, the company will be walking to the market.",
      "verb": "walking"
    },
    {
      "sentence": "You will be going to the airport in two days.",
      "verb": "going"
    },
    {
      "sentence": "Tonight, her sister will be eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, the manager will be reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "They will be calling the manager this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "This evening, we will be enjoying soup.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team will be planning the decision soon.",
      "verb": "planning"
    },
    {
      "sentence": "At this time soon, her sister will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Later, the students will be starting the assignment.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this evening, her sister will be meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "This weekend, my brother will be drinking pizza.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, they will be starting the presentation.",
      "verb": "starting"
    },
    {
      "sentence": "Next year, my brother will be finding the phone.",
      "verb": "finding"
    },
    {
      "sentence": "Emma will be enjoying coffee next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, sarah will be playing a podcast.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, we will be painting the computer.",
      "verb": "painting"
    },
    {
      "sentence": "The bird will be calling the manager this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "The company will be practicing English next week.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this weekend, john will be reading the lesson.",
      "verb": "reading"
    },
    {
      "sentence": "At this time later, john will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister will be drawing the room in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "They will be contacting my parents in two days.",
      "verb": "contacting"
    },
    {
      "sentence": "Next week, the team will be starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "This evening, the bird will be cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "He will be running to the store later.",
      "verb": "running"
    },
    {
      "sentence": "The children will be arriving to the store in two days.",
      "verb": "arriving"
    },
    {
      "sentence": "The teacher will be buying flowers later.",
      "verb": "buying"
    },
    {
      "sentence": "Next year, my friend will be preparing a sandwich.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors will be practicing English soon.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tomorrow, sarah will be thinking about the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "Next week, emma will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, sarah will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "She will be building the kitchen next year.",
      "verb": "building"
    },
    {
      "sentence": "Next year, we will be choosing the phone.",
      "verb": "choosing"
    },
    {
      "sentence": "This weekend, the manager will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "Later, he will be talking the client.",
      "verb": "talking"
    },
    {
      "sentence": "Later, my parents will be reading French.",
      "verb": "reading"
    },
    {
      "sentence": "Soon, the students will be speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors will be reading history next month.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tomorrow, tom will be building the kitchen.",
      "verb": "building"
    },
    {
      "sentence": "At this time tonight, the teacher will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "Emma will be painting the room tomorrow.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tonight, the teacher will be driving to the office.",
      "verb": "driving"
    },
    {
      "sentence": "Tonight, her sister will be speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "In two days, my parents will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time later, the company will be painting the furniture.",
      "verb": "painting"
    },
    {
      "sentence": "Tomorrow, they will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "Her sister will be thinking about the meeting this evening.",
      "verb": "thinking"
    },
    {
      "sentence": "I will be calling the manager later.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next month, the teacher will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "Soon, you will be planning the options.",
      "verb": "planning"
    },
    {
      "sentence": "John will be repairing the bathroom tonight.",
      "verb": "repairing"
    },
    {
      "sentence": "Tomorrow, the manager will be studying mathematics.",
      "verb": "studying"
    },
    {
      "sentence": "In two days, they will be designing a picture.",
      "verb": "designing"
    },
    {
      "sentence": "At this time later, she will be choosing the ticket.",
      "verb": "choosing"
    },
    {
      "sentence": "The children will be teaching for the exam tomorrow.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time later, the cat will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "In two days, the children will be remembering the options.",
      "verb": "remembering"
    },
    {
      "sentence": "This weekend, our neighbors will be thinking about the options.",
      "verb": "thinking"
    },
    {
      "sentence": "This weekend, he will be walking to the library.",
      "verb": "walking"
    },
    {
      "sentence": "My brother will be talking my family this evening.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tonight, we will be starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "The cat will be contacting the team this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "This evening, we will be understanding grammar.",
      "verb": "understanding"
    },
    {
      "sentence": "He will be getting a new car later.",
      "verb": "getting"
    },
    {
      "sentence": "At this time in two days, the manager will be reading science.",
      "verb": "reading"
    },
    {
      "sentence": "Tom will be forgetting the decision this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "This evening, the students will be talking the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "The cat will be coming to the beach later.",
      "verb": "coming"
    },
    {
      "sentence": "The students will be getting the keys later.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, my parents will be designing the room.",
      "verb": "designing"
    },
    {
      "sentence": "At this time this weekend, the dog will be understanding science.",
      "verb": "understanding"
    },
    {
      "sentence": "Our neighbors will be thinking about the problem next month.",
      "verb": "thinking"
    },
    {
      "sentence": "This weekend, he will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, our neighbors will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "The company will be completing the letter next month.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next week, tom will be building the computer.",
      "verb": "building"
    },
    {
      "sentence": "Emma will be eating dinner this evening.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, she will be building the computer.",
      "verb": "building"
    },
    {
      "sentence": "At this time next year, my brother will be running to the office.",
      "verb": "running"
    },
    {
      "sentence": "The children will be fixing the house later.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom will be arriving to the gym next month.",
      "verb": "arriving"
    },
    {
      "sentence": "The children will be completing the document soon.",
      "verb": "completing"
    },
    {
      "sentence": "In two days, the dog will be considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Tomorrow, tom will be receiving the contract.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time tomorrow, my parents will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the team will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, i will be finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time later, emma will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next month, i will be receiving the presentation.",
      "verb": "receiving"
    },
    {
      "sentence": "My parents will be listening to a documentary this evening.",
      "verb": "listening"
    },
    {
      "sentence": "They will be contacting the manager this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "We will be building the garden next month.",
      "verb": "building"
    },
    {
      "sentence": "At this time tomorrow, emma will be buying a present.",
      "verb": "buying"
    },
    {
      "sentence": "At this time next week, our neighbors will be considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this evening, sarah will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "Tomorrow, sarah will be calling the neighbors.",
      "verb": "calling"
    },
    {
      "sentence": "At this time later, we will be coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "Next year, she will be giving a laptop.",
      "verb": "giving"
    },
    {
      "sentence": "Tonight, our neighbors will be finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "At this time tonight, we will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "In two days, tom will be remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "Later, we will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next month, the team will be painting the furniture.",
      "verb": "painting"
    },
    {
      "sentence": "The cat will be going to the airport next month.",
      "verb": "going"
    },
    {
      "sentence": "At this time next week, the students will be ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "Tonight, our neighbors will be preparing a salad.",
      "verb": "preparing"
    },
    {
      "sentence": "The manager will be giving the phone this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "At this time soon, we will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Later, my friend will be fixing the bathroom.",
      "verb": "fixing"
    },
    {
      "sentence": "They will be making dinner next week.",
      "verb": "making"
    },
    {
      "sentence": "At this time next week, the team will be making soup.",
      "verb": "making"
    },
    {
      "sentence": "At this time next week, her sister will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "My brother will be walking to school tonight.",
      "verb": "walking"
    },
    {
      "sentence": "Tonight, my parents will be building the house.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, we will be playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, the children will be building a website.",
      "verb": "building"
    },
    {
      "sentence": "At this time next month, the company will be completing the letter.",
      "verb": "completing"
    },
    {
      "sentence": "At this time tomorrow, he will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "Tomorrow, the students will be eating pasta.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, the teacher will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, she will be planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "In two days, the manager will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager will be calling my parents tonight.",
      "verb": "calling"
    },
    {
      "sentence": "The cat will be preparing pasta next week.",
      "verb": "preparing"
    },
    {
      "sentence": "Later, we will be listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, i will be preparing coffee.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, our neighbors will be building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "Her sister will be playing the news tonight.",
      "verb": "playing"
    },
    {
      "sentence": "Tonight, sarah will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, the bird will be thinking about the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next month, sarah will be driving downtown.",
      "verb": "driving"
    },
    {
      "sentence": "Tonight, we will be selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "Tomorrow, the bird will be starting the letter.",
      "verb": "starting"
    },
    {
      "sentence": "This evening, my parents will be enjoying music.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this evening, the team will be eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, we will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, the cat will be talking the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "We will be studying French tonight.",
      "verb": "studying"
    },
    {
      "sentence": "I will be forgetting the decision next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "Later, the manager will be repairing the room.",
      "verb": "repairing"
    },
    {
      "sentence": "The company will be remembering the event soon.",
      "verb": "remembering"
    },
    {
      "sentence": "Next year, my parents will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "Tomorrow, sarah will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, my friend will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tonight, tom will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time soon, our neighbors will be running to the gym.",
      "verb": "running"
    },
    {
      "sentence": "My brother will be selling clothes next month.",
      "verb": "selling"
    },
    {
      "sentence": "At this time this weekend, she will be remembering the event.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time later, my brother will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, the manager will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird will be forgetting the future later.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time this evening, her sister will be calling my family.",
      "verb": "calling"
    },
    {
      "sentence": "At this time in two days, the dog will be preparing juice.",
      "verb": "preparing"
    },
    {
      "sentence": "I will be painting the furniture tomorrow.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, her sister will be reviewing the chapter.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, the students will be speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "This evening, the company will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the team will be submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "Tomorrow, my parents will be painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, you will be preparing pasta.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, we will be visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, our neighbors will be selling a new car.",
      "verb": "selling"
    },
    {
      "sentence": "This weekend, we will be buying the phone.",
      "verb": "buying"
    },
    {
      "sentence": "They will be watching tennis next month.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher will be reviewing Spanish this weekend.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tom will be sending the report soon.",
      "verb": "sending"
    },
    {
      "sentence": "At this time this weekend, the team will be teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time in two days, the cat will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, we will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next month, sarah will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, she will be meeting the team.",
      "verb": "meeting"
    },
    {
      "sentence": "Tomorrow, tom will be finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "You will be calling my parents this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "He will be listening to basketball this evening.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will be remembering the meeting in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time soon, my brother will be sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "At this time this evening, they will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "They will be visiting my friend soon.",
      "verb": "visiting"
    },
    {
      "sentence": "I will be preparing lunch tonight.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, the teacher will be visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "He will be considering the problem tonight.",
      "verb": "considering"
    },
    {
      "sentence": "At this time tonight, the company will be teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time later, the cat will be studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "At this time in two days, emma will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this evening, john will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tomorrow, the manager will be writing the proposal.",
      "verb": "writing"
    },
    {
      "sentence": "Later, emma will be designing the bathroom.",
      "verb": "designing"
    },
    {
      "sentence": "At this time in two days, emma will be coming to work.",
      "verb": "coming"
    },
    {
      "sentence": "This weekend, john will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "Tonight, emma will be arriving to the park.",
      "verb": "arriving"
    },
    {
      "sentence": "We will be preparing pizza soon.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time tomorrow, the cat will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, john will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "At this time later, the dog will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "The children will be completing the contract next year.",
      "verb": "completing"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be practicing the chapter.",
      "verb": "practicing"
    },
    {
      "sentence": "We will be driving to the gym next week.",
      "verb": "driving"
    },
    {
      "sentence": "At this time in two days, the children will be making pizza.",
      "verb": "making"
    },
    {
      "sentence": "They will be returning home in two days.",
      "verb": "returning"
    },
    {
      "sentence": "At this time later, john will be running to work.",
      "verb": "running"
    },
    {
      "sentence": "Tomorrow, my brother will be sending the project.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next week, her sister will be visiting the team.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the bird will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time in two days, i will be receiving the assignment.",
      "verb": "receiving"
    },
    {
      "sentence": "Next year, the children will be driving to the airport.",
      "verb": "driving"
    },
    {
      "sentence": "Her sister will be studying for the exam tonight.",
      "verb": "studying"
    },
    {
      "sentence": "At this time this weekend, tom will be driving home.",
      "verb": "driving"
    },
    {
      "sentence": "Her sister will be selling the ticket next year.",
      "verb": "selling"
    },
    {
      "sentence": "The manager will be teaching science next week.",
      "verb": "teaching"
    },
    {
      "sentence": "In two days, the students will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next year, i will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "Next year, he will be giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "This evening, the team will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents will be cleaning a picture this weekend.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time soon, my friend will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "At this time tonight, my brother will be remembering the problem.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time tonight, sarah will be visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom will be returning to the park in two days.",
      "verb": "returning"
    },
    {
      "sentence": "This evening, the cat will be arriving to the park.",
      "verb": "arriving"
    },
    {
      "sentence": "She will be thinking about the situation next month.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next year, he will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "The company will be listening to a song later.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, you will be meeting the client.",
      "verb": "meeting"
    },
    {
      "sentence": "Tomorrow, the bird will be playing football.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the cat will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "She will be receiving the email next year.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next year, my friend will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, my friend will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "At this time tomorrow, the children will be remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "This weekend, the cat will be running to the airport.",
      "verb": "running"
    },
    {
      "sentence": "The company will be selling the ticket soon.",
      "verb": "selling"
    },
    {
      "sentence": "At this time later, sarah will be watching basketball.",
      "verb": "watching"
    },
    {
      "sentence": "She will be finishing the project soon.",
      "verb": "finishing"
    },
    {
      "sentence": "Next year, the bird will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will be playing tennis later.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, the dog will be reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tonight, the students will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "The children will be eating soup next week.",
      "verb": "eating"
    },
    {
      "sentence": "They will be getting a new car next month.",
      "verb": "getting"
    },
    {
      "sentence": "My friend will be playing a podcast this evening.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, the children will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next month, john will be cleaning the garden.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next year, the bird will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "Next year, tom will be sending the report.",
      "verb": "sending"
    },
    {
      "sentence": "I will be enjoying a documentary next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next year, the children will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, you will be fixing the furniture.",
      "verb": "fixing"
    },
    {
      "sentence": "I will be watching a documentary tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, emma will be understanding the lesson.",
      "verb": "understanding"
    },
    {
      "sentence": "Our neighbors will be submitting the contract next month.",
      "verb": "submitting"
    },
    {
      "sentence": "Soon, he will be cooking a sandwich.",
      "verb": "cooking"
    },
    {
      "sentence": "The company will be thinking about the future tomorrow.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next month, the teacher will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, i will be arriving to the gym.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time tonight, the bird will be arriving home.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, you will be making a snack.",
      "verb": "making"
    },
    {
      "sentence": "Next year, her sister will be coming home.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next week, the manager will be learning vocabulary.",
      "verb": "learning"
    },
    {
      "sentence": "My friend will be writing the document tomorrow.",
      "verb": "writing"
    },
    {
      "sentence": "This weekend, the dog will be ordering juice.",
      "verb": "ordering"
    },
    {
      "sentence": "John will be giving the ticket in two days.",
      "verb": "giving"
    },
    {
      "sentence": "He will be drinking a sandwich next year.",
      "verb": "drinking"
    },
    {
      "sentence": "Later, tom will be getting the phone.",
      "verb": "getting"
    },
    {
      "sentence": "Next year, the teacher will be studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "In two days, our neighbors will be watching basketball.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, the team will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, my friend will be walking to the beach.",
      "verb": "walking"
    },
    {
      "sentence": "The bird will be considering the future next week.",
      "verb": "considering"
    },
    {
      "sentence": "My parents will be arriving to the beach next month.",
      "verb": "arriving"
    },
    {
      "sentence": "Next week, john will be teaching vocabulary.",
      "verb": "teaching"
    },
    {
      "sentence": "This evening, emma will be finishing the letter.",
      "verb": "finishing"
    },
    {
      "sentence": "John will be sending the document this evening.",
      "verb": "sending"
    },
    {
      "sentence": "At this time soon, our neighbors will be finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "The children will be planning the situation in two days.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next week, sarah will be flying to the park.",
      "verb": "flying"
    },
    {
      "sentence": "Next week, the manager will be giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "At this time this weekend, tom will be sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "My brother will be going to the store tonight.",
      "verb": "going"
    },
    {
      "sentence": "This evening, my brother will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next year, john will be studying for the exam.",
      "verb": "studying"
    },
    {
      "sentence": "At this time this evening, her sister will be practicing the chapter.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat will be considering the future tonight.",
      "verb": "considering"
    },
    {
      "sentence": "At this time in two days, our neighbors will be giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher will be finishing the document tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "This weekend, he will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, our neighbors will be teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "Emma will be repairing the furniture tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "He will be meeting the manager next year.",
      "verb": "meeting"
    },
    {
      "sentence": "This weekend, the company will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time this weekend, the students will be calling the teacher.",
      "verb": "calling"
    },
    {
      "sentence": "At this time tomorrow, the manager will be walking to the airport.",
      "verb": "walking"
    },
    {
      "sentence": "At this time tonight, tom will be cooking a sandwich.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will be playing basketball in two days.",
      "verb": "playing"
    },
    {
      "sentence": "The team will be drinking a snack next week.",
      "verb": "drinking"
    },
    {
      "sentence": "This evening, the teacher will be sending the project.",
      "verb": "sending"
    },
    {
      "sentence": "At this time this evening, her sister will be visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "Later, john will be painting the computer.",
      "verb": "painting"
    },
    {
      "sentence": "Next week, tom will be starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "Tonight, the dog will be painting the car.",
      "verb": "painting"
    },
    {
      "sentence": "At this time soon, the children will be enjoying pizza.",
      "verb": "enjoying"
    },
    {
      "sentence": "My brother will be thinking about the vacation next month.",
      "verb": "thinking"
    },
    {
      "sentence": "The teacher will be returning to the airport next month.",
      "verb": "returning"
    },
    {
      "sentence": "At this time in two days, emma will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "This evening, the manager will be watching music.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be playing the game next year.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will be returning to the gym tonight.",
      "verb": "returning"
    },
    {
      "sentence": "At this time later, the bird will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "Tom will be drinking breakfast next week.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tomorrow, i will be preparing pizza.",
      "verb": "preparing"
    },
    {
      "sentence": "This weekend, i will be understanding science.",
      "verb": "understanding"
    },
    {
      "sentence": "Sarah will be talking the team in two days.",
      "verb": "talking"
    },
    {
      "sentence": "The teacher will be enjoying pasta next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "The children will be leaving to the market this weekend.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time in two days, sarah will be cooking tea.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah will be drawing the furniture in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time later, her sister will be eating juice.",
      "verb": "eating"
    },
    {
      "sentence": "The manager will be listening to the news this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next month, the students will be ordering tea.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, you will be cooking a sandwich.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will be considering the event tonight.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, the bird will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "You will be flying to the park this evening.",
      "verb": "flying"
    },
    {
      "sentence": "At this time tonight, you will be receiving the email.",
      "verb": "receiving"
    },
    {
      "sentence": "They will be selling the ticket tomorrow.",
      "verb": "selling"
    },
    {
      "sentence": "We will be getting the phone next week.",
      "verb": "getting"
    },
    {
      "sentence": "The company will be running to the market tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "The company will be giving a gift next year.",
      "verb": "giving"
    },
    {
      "sentence": "The manager will be building the room in two days.",
      "verb": "building"
    },
    {
      "sentence": "Next month, my friend will be receiving the task.",
      "verb": "receiving"
    },
    {
      "sentence": "This weekend, the students will be making a sandwich.",
      "verb": "making"
    },
    {
      "sentence": "Soon, the teacher will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "Tonight, he will be forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "The bird will be starting the task next year.",
      "verb": "starting"
    },
    {
      "sentence": "The children will be understanding Spanish next month.",
      "verb": "understanding"
    },
    {
      "sentence": "Next week, the dog will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "You will be fixing the furniture soon.",
      "verb": "fixing"
    },
    {
      "sentence": "Later, my parents will be getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "She will be speaking the doctor this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat will be receiving the application this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "Tom will be thinking about the event next month.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next year, emma will be calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "At this time in two days, they will be finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "This evening, you will be calling my family.",
      "verb": "calling"
    },
    {
      "sentence": "At this time later, sarah will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "Next year, you will be calling the client.",
      "verb": "calling"
    },
    {
      "sentence": "At this time this evening, my parents will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "Later, she will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "Tomorrow, you will be meeting the teacher.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors will be buying a laptop this evening.",
      "verb": "buying"
    },
    {
      "sentence": "The children will be leaving to work next week.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be arriving to the market.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time tonight, the team will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next year, they will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "The company will be studying vocabulary next week.",
      "verb": "studying"
    },
    {
      "sentence": "Tomorrow, john will be going to the library.",
      "verb": "going"
    },
    {
      "sentence": "At this time next year, the team will be cooking tea.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will be meeting my family next year.",
      "verb": "meeting"
    },
    {
      "sentence": "This evening, john will be preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time next week, my brother will be finishing the letter.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, her sister will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students will be studying grammar next year.",
      "verb": "studying"
    },
    {
      "sentence": "My parents will be preparing lunch next week.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time this weekend, the bird will be completing the report.",
      "verb": "completing"
    },
    {
      "sentence": "The company will be ordering a snack in two days.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, we will be forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next year, her sister will be learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "Later, i will be giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "The manager will be considering the situation later.",
      "verb": "considering"
    },
    {
      "sentence": "My friend will be leaving to the office this evening.",
      "verb": "leaving"
    },
    {
      "sentence": "The students will be cleaning the kitchen next month.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, i will be finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "The dog will be fixing a picture soon.",
      "verb": "fixing"
    },
    {
      "sentence": "Soon, my friend will be contacting my parents.",
      "verb": "contacting"
    },
    {
      "sentence": "My friend will be talking the manager in two days.",
      "verb": "talking"
    },
    {
      "sentence": "At this time this weekend, he will be calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "Next week, sarah will be teaching French.",
      "verb": "teaching"
    },
    {
      "sentence": "In two days, the bird will be enjoying the game.",
      "verb": "enjoying"
    },
    {
      "sentence": "Sarah will be giving a present tonight.",
      "verb": "giving"
    },
    {
      "sentence": "The bird will be ordering tea this weekend.",
      "verb": "ordering"
    },
    {
      "sentence": "The manager will be drawing the computer next month.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next week, the manager will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be contacting the teacher soon.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the dog will be reviewing Spanish.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will be preparing a salad soon.",
      "verb": "preparing"
    },
    {
      "sentence": "Tom will be selling a new car next week.",
      "verb": "selling"
    },
    {
      "sentence": "At this time soon, john will be considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next year, i will be giving a book.",
      "verb": "giving"
    },
    {
      "sentence": "Next year, john will be receiving the contract.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the teacher will be eating tea.",
      "verb": "eating"
    },
    {
      "sentence": "They will be finding groceries tonight.",
      "verb": "finding"
    },
    {
      "sentence": "The dog will be getting the ticket tonight.",
      "verb": "getting"
    },
    {
      "sentence": "The company will be receiving the report next week.",
      "verb": "receiving"
    },
    {
      "sentence": "The cat will be cooking pizza tonight.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next week, my parents will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "The teacher will be listening to a documentary soon.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be reading grammar tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "This evening, the teacher will be submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "We will be getting flowers later.",
      "verb": "getting"
    },
    {
      "sentence": "At this time later, the team will be studying for the exam.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, she will be drinking lunch.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma will be reading the chapter next month.",
      "verb": "reading"
    },
    {
      "sentence": "The children will be giving a present in two days.",
      "verb": "giving"
    },
    {
      "sentence": "The team will be understanding the lesson next month.",
      "verb": "understanding"
    },
    {
      "sentence": "Next year, my parents will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "Next week, the manager will be reading the lesson.",
      "verb": "reading"
    },
    {
      "sentence": "My parents will be remembering the decision this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "You will be reading history next week.",
      "verb": "reading"
    },
    {
      "sentence": "At this time next year, her sister will be driving to work.",
      "verb": "driving"
    },
    {
      "sentence": "At this time soon, the teacher will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "Tom will be studying for the exam in two days.",
      "verb": "studying"
    },
    {
      "sentence": "In two days, the cat will be making juice.",
      "verb": "making"
    },
    {
      "sentence": "At this time next year, emma will be painting the kitchen.",
      "verb": "painting"
    },
    {
      "sentence": "I will be submitting the presentation later.",
      "verb": "submitting"
    },
    {
      "sentence": "In two days, the team will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "The manager will be selling a book tonight.",
      "verb": "selling"
    },
    {
      "sentence": "The team will be reviewing vocabulary in two days.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time in two days, the children will be selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "The dog will be running home soon.",
      "verb": "running"
    },
    {
      "sentence": "Soon, her sister will be giving the ticket.",
      "verb": "giving"
    },
    {
      "sentence": "The bird will be making a salad next year.",
      "verb": "making"
    },
    {
      "sentence": "The bird will be remembering the birthday this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "Tomorrow, the company will be making breakfast.",
      "verb": "making"
    },
    {
      "sentence": "Her sister will be coming to work tomorrow.",
      "verb": "coming"
    },
    {
      "sentence": "Tonight, we will be giving a gift.",
      "verb": "giving"
    },
    {
      "sentence": "They will be studying science in two days.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next year, my parents will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "The cat will be listening to TV later.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next year, he will be practicing the lesson.",
      "verb": "practicing"
    },
    {
      "sentence": "Next year, she will be drinking a snack.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, john will be driving to the store.",
      "verb": "driving"
    },
    {
      "sentence": "At this time soon, the students will be listening to a movie.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, the children will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time soon, i will be walking home.",
      "verb": "walking"
    },
    {
      "sentence": "The team will be considering the situation in two days.",
      "verb": "considering"
    },
    {
      "sentence": "Next year, our neighbors will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager will be finding the phone next month.",
      "verb": "finding"
    },
    {
      "sentence": "The cat will be watching a video this evening.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, emma will be reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "Emma will be teaching science soon.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, john will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "At this time this weekend, he will be calling my family.",
      "verb": "calling"
    },
    {
      "sentence": "Later, you will be visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "Tomorrow, my brother will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, he will be practicing for the exam.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next year, you will be going downtown.",
      "verb": "going"
    },
    {
      "sentence": "The children will be going to the office next year.",
      "verb": "going"
    },
    {
      "sentence": "She will be considering the event later.",
      "verb": "considering"
    },
    {
      "sentence": "Later, the bird will be playing a documentary.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, my parents will be sending the letter.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister will be getting a gift next year.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next week, tom will be writing the document.",
      "verb": "writing"
    },
    {
      "sentence": "The cat will be coming home next month.",
      "verb": "coming"
    },
    {
      "sentence": "You will be watching a song next month.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be flying downtown.",
      "verb": "flying"
    },
    {
      "sentence": "At this time this evening, she will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "You will be finding groceries next week.",
      "verb": "finding"
    },
    {
      "sentence": "Soon, she will be speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, my friend will be building a picture.",
      "verb": "building"
    },
    {
      "sentence": "The students will be drawing a website later.",
      "verb": "drawing"
    },
    {
      "sentence": "Tonight, the company will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tonight, my parents will be leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time tomorrow, they will be leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time in two days, john will be fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "You will be considering the problem tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "The children will be watching the news next year.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, the bird will be ordering a salad.",
      "verb": "ordering"
    },
    {
      "sentence": "In two days, he will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "Soon, they will be running to the store.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors will be selling the phone tonight.",
      "verb": "selling"
    },
    {
      "sentence": "The cat will be returning to the store later.",
      "verb": "returning"
    },
    {
      "sentence": "She will be planning the options this evening.",
      "verb": "planning"
    },
    {
      "sentence": "The bird will be considering the vacation soon.",
      "verb": "considering"
    },
    {
      "sentence": "The dog will be starting the letter tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "John will be speaking the teacher next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tomorrow, they will be walking downtown.",
      "verb": "walking"
    },
    {
      "sentence": "At this time soon, emma will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "They will be making pizza next week.",
      "verb": "making"
    },
    {
      "sentence": "At this time next year, the bird will be studying French.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, the company will be enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time later, emma will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "In two days, they will be understanding the chapter.",
      "verb": "understanding"
    },
    {
      "sentence": "John will be painting the kitchen later.",
      "verb": "painting"
    },
    {
      "sentence": "Next year, sarah will be arriving home.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time this weekend, he will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "Tom will be reviewing French next week.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time next week, our neighbors will be cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "In two days, the children will be eating breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be contacting the client next week.",
      "verb": "contacting"
    },
    {
      "sentence": "You will be thinking about the event this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tomorrow, emma will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "Soon, i will be speaking the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next week, the team will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "At this time this evening, tom will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "This weekend, the team will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, our neighbors will be writing the presentation.",
      "verb": "writing"
    },
    {
      "sentence": "At this time tomorrow, her sister will be preparing juice.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister will be writing the application this weekend.",
      "verb": "writing"
    },
    {
      "sentence": "This evening, emma will be arriving to the office.",
      "verb": "arriving"
    },
    {
      "sentence": "Tonight, the team will be giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "At this time tomorrow, sarah will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will be drinking soup tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tonight, the teacher will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "At this time later, the cat will be coming to the beach.",
      "verb": "coming"
    },
    {
      "sentence": "The cat will be preparing juice tomorrow.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma will be drinking coffee later.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next week, sarah will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time in two days, the children will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "My brother will be speaking the doctor tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next year, the dog will be making pasta.",
      "verb": "making"
    },
    {
      "sentence": "At this time tomorrow, the children will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "The students will be leaving to the beach later.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, they will be building the kitchen.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, my brother will be understanding the lesson.",
      "verb": "understanding"
    },
    {
      "sentence": "Soon, her sister will be fixing the garden.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time tomorrow, i will be calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "He will be studying science soon.",
      "verb": "studying"
    },
    {
      "sentence": "At this time later, tom will be reading English.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tonight, you will be visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "She will be receiving the assignment soon.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time tonight, the manager will be coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next week, the bird will be forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next week, my friend will be coming to the gym.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next year, emma will be getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "Next year, my parents will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "The cat will be buying a present this weekend.",
      "verb": "buying"
    },
    {
      "sentence": "At this time next year, the bird will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, the team will be finishing the document.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time soon, the dog will be remembering the trip.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next year, he will be returning downtown.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tomorrow, my friend will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, sarah will be reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "I will be reviewing Spanish this evening.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tomorrow, they will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next month, the manager will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "John will be repairing the bathroom tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "The company will be practicing Spanish next week.",
      "verb": "practicing"
    },
    {
      "sentence": "She will be contacting the manager later.",
      "verb": "contacting"
    },
    {
      "sentence": "Soon, sarah will be completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "The teacher will be making breakfast soon.",
      "verb": "making"
    },
    {
      "sentence": "At this time tonight, the team will be submitting the application.",
      "verb": "submitting"
    },
    {
      "sentence": "This evening, my brother will be driving downtown.",
      "verb": "driving"
    },
    {
      "sentence": "I will be calling the manager next month.",
      "verb": "calling"
    },
    {
      "sentence": "This evening, my friend will be flying to the beach.",
      "verb": "flying"
    },
    {
      "sentence": "At this time this evening, my brother will be starting the project.",
      "verb": "starting"
    },
    {
      "sentence": "This evening, tom will be drawing the computer.",
      "verb": "drawing"
    },
    {
      "sentence": "Tomorrow, tom will be cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time in two days, the cat will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "The manager will be visiting the teacher next month.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time next year, the students will be drawing the garden.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time later, the manager will be getting the ticket.",
      "verb": "getting"
    },
    {
      "sentence": "At this time tonight, my friend will be planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "Tom will be returning to the library tonight.",
      "verb": "returning"
    },
    {
      "sentence": "At this time this weekend, the students will be understanding mathematics.",
      "verb": "understanding"
    },
    {
      "sentence": "We will be preparing a sandwich next week.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time tonight, he will be selling a present.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, i will be planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "My friend will be painting the room tomorrow.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next week, the children will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, the manager will be drawing the room.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time this evening, our neighbors will be making a sandwich.",
      "verb": "making"
    },
    {
      "sentence": "Later, my brother will be coming to the gym.",
      "verb": "coming"
    },
    {
      "sentence": "At this time this weekend, my friend will be writing the report.",
      "verb": "writing"
    },
    {
      "sentence": "At this time soon, the children will be thinking about the vacation.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat will be cooking tea this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "Next week, the dog will be making a salad.",
      "verb": "making"
    },
    {
      "sentence": "At this time soon, sarah will be cooking lunch.",
      "verb": "cooking"
    },
    {
      "sentence": "Next year, our neighbors will be submitting the application.",
      "verb": "submitting"
    },
    {
      "sentence": "Next year, the bird will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time this weekend, my friend will be studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, the teacher will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "Later, the dog will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tonight, my parents will be submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, you will be selling the ticket.",
      "verb": "selling"
    },
    {
      "sentence": "At this time this weekend, the students will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "I will be listening to basketball tonight.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, the bird will be understanding French.",
      "verb": "understanding"
    },
    {
      "sentence": "Our neighbors will be forgetting the future later.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company will be painting a picture later.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next year, the dog will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next year, emma will be completing the letter.",
      "verb": "completing"
    },
    {
      "sentence": "Next week, john will be contacting the neighbors.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will be reading the chapter this evening.",
      "verb": "reading"
    },
    {
      "sentence": "In two days, her sister will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "At this time soon, the children will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, the bird will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "At this time tonight, she will be sending the report.",
      "verb": "sending"
    },
    {
      "sentence": "At this time tonight, the teacher will be enjoying juice.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this evening, my parents will be enjoying a snack.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, the manager will be forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend will be finding clothes next month.",
      "verb": "finding"
    },
    {
      "sentence": "They will be calling my family this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "At this time later, he will be returning to work.",
      "verb": "returning"
    },
    {
      "sentence": "At this time this evening, the company will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "Tomorrow, the teacher will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this evening, the bird will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Tonight, john will be selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "Tonight, my brother will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tomorrow, he will be watching basketball.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, sarah will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "Our neighbors will be understanding the lesson next month.",
      "verb": "understanding"
    },
    {
      "sentence": "Tomorrow, we will be studying history.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, her sister will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "He will be going to the library next week.",
      "verb": "going"
    },
    {
      "sentence": "At this time this evening, the teacher will be finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "My brother will be forgetting the future next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students will be watching the game next week.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next month, the manager will be completing the letter.",
      "verb": "completing"
    },
    {
      "sentence": "At this time in two days, my brother will be drawing the car.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will be walking to the library tomorrow.",
      "verb": "walking"
    },
    {
      "sentence": "At this time tomorrow, the team will be thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time soon, my brother will be painting the car.",
      "verb": "painting"
    },
    {
      "sentence": "I will be designing the furniture next week.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tonight, the bird will be planning the options.",
      "verb": "planning"
    },
    {
      "sentence": "At this time tonight, sarah will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "This weekend, the teacher will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "The children will be reading French soon.",
      "verb": "reading"
    },
    {
      "sentence": "This weekend, the team will be enjoying music.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents will be choosing a new car tonight.",
      "verb": "choosing"
    },
    {
      "sentence": "This weekend, the team will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time in two days, her sister will be practicing history.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this evening, the dog will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, the teacher will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "I will be reading the chapter this weekend.",
      "verb": "reading"
    },
    {
      "sentence": "At this time this evening, john will be talking my family.",
      "verb": "talking"
    },
    {
      "sentence": "This evening, the manager will be flying to the library.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next week, the teacher will be enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time soon, the cat will be giving a present.",
      "verb": "giving"
    },
    {
      "sentence": "You will be cooking juice this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "Later, tom will be playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "Tonight, my parents will be enjoying a movie.",
      "verb": "enjoying"
    },
    {
      "sentence": "She will be remembering the situation soon.",
      "verb": "remembering"
    },
    {
      "sentence": "The manager will be reading mathematics next month.",
      "verb": "reading"
    },
    {
      "sentence": "The team will be playing tennis tonight.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will be getting the ticket later.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next month, she will be coming to work.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next week, the dog will be building the garden.",
      "verb": "building"
    },
    {
      "sentence": "This weekend, the company will be talking my family.",
      "verb": "talking"
    },
    {
      "sentence": "Later, my friend will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time in two days, sarah will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be thinking about the situation soon.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time this evening, her sister will be listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "John will be thinking about the problem this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time later, she will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "She will be starting the report in two days.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, we will be thinking about the vacation.",
      "verb": "thinking"
    },
    {
      "sentence": "Later, the children will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah will be reading Spanish later.",
      "verb": "reading"
    },
    {
      "sentence": "At this time this weekend, my friend will be speaking the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "Soon, sarah will be selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next week, our neighbors will be considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "This evening, emma will be buying a present.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, sarah will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "The manager will be remembering the decision soon.",
      "verb": "remembering"
    },
    {
      "sentence": "Tonight, the teacher will be listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, my parents will be contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, we will be leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "The manager will be eating breakfast next week.",
      "verb": "eating"
    },
    {
      "sentence": "Tom will be thinking about the event tonight.",
      "verb": "thinking"
    },
    {
      "sentence": "In two days, sarah will be finishing the application.",
      "verb": "finishing"
    },
    {
      "sentence": "In two days, we will be eating coffee.",
      "verb": "eating"
    },
    {
      "sentence": "The students will be thinking about the decision soon.",
      "verb": "thinking"
    },
    {
      "sentence": "Next year, the dog will be getting a book.",
      "verb": "getting"
    },
    {
      "sentence": "At this time this evening, emma will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "Next week, the teacher will be leaving to the office.",
      "verb": "leaving"
    },
    {
      "sentence": "Tomorrow, our neighbors will be talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "The children will be drinking juice tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time in two days, my parents will be practicing the textbook.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher will be running downtown this evening.",
      "verb": "running"
    },
    {
      "sentence": "At this time soon, we will be finishing the proposal.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time this weekend, my brother will be eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, he will be fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time this evening, john will be designing the bathroom.",
      "verb": "designing"
    },
    {
      "sentence": "My friend will be starting the task next year.",
      "verb": "starting"
    },
    {
      "sentence": "Later, the team will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "We will be building a website next year.",
      "verb": "building"
    },
    {
      "sentence": "At this time tomorrow, the children will be talking the doctor.",
      "verb": "talking"
    },
    {
      "sentence": "At this time next year, the cat will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, tom will be understanding the lesson.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this evening, my friend will be fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "She will be drawing a picture next week.",
      "verb": "drawing"
    },
    {
      "sentence": "John will be starting the task tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "Later, her sister will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom will be repairing the house next year.",
      "verb": "repairing"
    },
    {
      "sentence": "The students will be watching football next month.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, my brother will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "This weekend, john will be reading the chapter.",
      "verb": "reading"
    },
    {
      "sentence": "In two days, they will be receiving the letter.",
      "verb": "receiving"
    },
    {
      "sentence": "The manager will be driving to work in two days.",
      "verb": "driving"
    },
    {
      "sentence": "In two days, the company will be studying for the exam.",
      "verb": "studying"
    },
    {
      "sentence": "My friend will be listening to a movie next week.",
      "verb": "listening"
    },
    {
      "sentence": "At this time soon, the team will be watching a podcast.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, you will be getting a present.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next month, we will be understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "My brother will be playing a video soon.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, the team will be walking home.",
      "verb": "walking"
    },
    {
      "sentence": "Soon, sarah will be eating juice.",
      "verb": "eating"
    },
    {
      "sentence": "My friend will be speaking my friend tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother will be cooking lunch next month.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time later, the students will be ordering pizza.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, the company will be receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next year, the team will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "Later, my parents will be playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, the manager will be running downtown.",
      "verb": "running"
    },
    {
      "sentence": "Later, emma will be making juice.",
      "verb": "making"
    },
    {
      "sentence": "In two days, the teacher will be going to school.",
      "verb": "going"
    },
    {
      "sentence": "At this time in two days, john will be submitting the application.",
      "verb": "submitting"
    },
    {
      "sentence": "This evening, the students will be reviewing Spanish.",
      "verb": "reviewing"
    },
    {
      "sentence": "Her sister will be running to the gym next year.",
      "verb": "running"
    },
    {
      "sentence": "At this time tomorrow, the cat will be eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "The students will be studying vocabulary in two days.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, my parents will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom will be running to the store this evening.",
      "verb": "running"
    },
    {
      "sentence": "Later, the children will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time later, emma will be drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "She will be designing the computer this evening.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah will be remembering the future in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "The company will be ordering breakfast this evening.",
      "verb": "ordering"
    },
    {
      "sentence": "In two days, i will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, the students will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time tomorrow, the team will be receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next year, the company will be practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "John will be eating dinner soon.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, our neighbors will be reading the textbook.",
      "verb": "reading"
    },
    {
      "sentence": "Later, the children will be considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "Later, the company will be getting groceries.",
      "verb": "getting"
    },
    {
      "sentence": "Tom will be flying to the office soon.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next year, the students will be walking to the store.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, my brother will be going to the market.",
      "verb": "going"
    },
    {
      "sentence": "At this time next month, my friend will be thinking about the event.",
      "verb": "thinking"
    },
    {
      "sentence": "The teacher will be submitting the report next month.",
      "verb": "submitting"
    },
    {
      "sentence": "Tom will be studying Spanish this evening.",
      "verb": "studying"
    },
    {
      "sentence": "The cat will be understanding grammar next month.",
      "verb": "understanding"
    },
    {
      "sentence": "Tom will be studying science next month.",
      "verb": "studying"
    },
    {
      "sentence": "The team will be arriving to work next year.",
      "verb": "arriving"
    },
    {
      "sentence": "Tomorrow, her sister will be practicing vocabulary.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time in two days, our neighbors will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, i will be selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "Later, my brother will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "My parents will be driving to the airport next week.",
      "verb": "driving"
    },
    {
      "sentence": "At this time tonight, the company will be submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "This evening, the students will be selling flowers.",
      "verb": "selling"
    },
    {
      "sentence": "The team will be choosing flowers this weekend.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time in two days, the teacher will be ordering pasta.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time this weekend, the team will be coming to the library.",
      "verb": "coming"
    },
    {
      "sentence": "Emma will be submitting the application this weekend.",
      "verb": "submitting"
    },
    {
      "sentence": "In two days, the company will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "Next year, he will be playing football.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will be selling clothes soon.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, her sister will be forgetting the trip.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents will be cleaning a website tomorrow.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, our neighbors will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "In two days, emma will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will be enjoying lunch later.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, i will be enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, sarah will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will be contacting the doctor next month.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this evening, she will be driving to work.",
      "verb": "driving"
    },
    {
      "sentence": "Sarah will be building the room this evening.",
      "verb": "building"
    },
    {
      "sentence": "The children will be drawing a picture later.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will be painting a picture soon.",
      "verb": "painting"
    },
    {
      "sentence": "The children will be preparing tea this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "I will be studying the lesson soon.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, her sister will be sending the contract.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, our neighbors will be studying the chapter.",
      "verb": "studying"
    },
    {
      "sentence": "The children will be playing the news next week.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, our neighbors will be planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "They will be choosing the ticket in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time next month, john will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "Tomorrow, he will be meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "Next year, my friend will be receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "He will be completing the proposal this evening.",
      "verb": "completing"
    },
    {
      "sentence": "At this time soon, the manager will be watching tennis.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will be reviewing the textbook this weekend.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time tomorrow, the students will be understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "Next year, she will be cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "This weekend, my friend will be finding the ticket.",
      "verb": "finding"
    },
    {
      "sentence": "Soon, the manager will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "Our neighbors will be finding the ticket tonight.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, her sister will be drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "Tomorrow, the manager will be calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "Her sister will be considering the meeting soon.",
      "verb": "considering"
    },
    {
      "sentence": "At this time tomorrow, they will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "In two days, our neighbors will be starting the proposal.",
      "verb": "starting"
    },
    {
      "sentence": "The teacher will be visiting the doctor tomorrow.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, we will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "Later, the dog will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tonight, tom will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next week, you will be eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be learning the chapter next week.",
      "verb": "learning"
    },
    {
      "sentence": "At this time later, the students will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, tom will be drawing the room.",
      "verb": "drawing"
    },
    {
      "sentence": "Next week, the teacher will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "Sarah will be contacting my parents later.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this evening, sarah will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Tomorrow, the team will be drawing the furniture.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, she will be reading the textbook.",
      "verb": "reading"
    },
    {
      "sentence": "Soon, the dog will be repairing the room.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time in two days, she will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, the children will be arriving to the gym.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time next week, we will be starting the presentation.",
      "verb": "starting"
    },
    {
      "sentence": "At this time next week, the team will be painting the furniture.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, sarah will be making breakfast.",
      "verb": "making"
    },
    {
      "sentence": "At this time next month, my brother will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "In two days, you will be enjoying a sandwich.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, our neighbors will be speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister will be playing the news soon.",
      "verb": "playing"
    },
    {
      "sentence": "John will be meeting the neighbors next year.",
      "verb": "meeting"
    },
    {
      "sentence": "John will be starting the presentation next week.",
      "verb": "starting"
    },
    {
      "sentence": "Her sister will be returning to work this evening.",
      "verb": "returning"
    },
    {
      "sentence": "This evening, sarah will be thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tonight, emma will be cleaning a website.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister will be receiving the document next week.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time in two days, john will be ordering dinner.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, they will be leaving to the park.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, my parents will be understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "The teacher will be submitting the project later.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time tomorrow, emma will be repairing the room.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next week, i will be flying to the office.",
      "verb": "flying"
    },
    {
      "sentence": "Soon, i will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "Soon, john will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "Next week, they will be writing the application.",
      "verb": "writing"
    },
    {
      "sentence": "At this time next week, my friend will be cleaning the car.",
      "verb": "cleaning"
    },
    {
      "sentence": "This weekend, the bird will be practicing English.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this evening, my parents will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom will be listening to tennis next month.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, my brother will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time soon, the children will be selling a laptop.",
      "verb": "selling"
    },
    {
      "sentence": "At this time later, the teacher will be reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next year, emma will be preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time next week, her sister will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will be enjoying TV next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "The company will be designing the house later.",
      "verb": "designing"
    },
    {
      "sentence": "In two days, the manager will be practicing mathematics.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this evening, the children will be preparing a sandwich.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, i will be considering the problem.",
      "verb": "considering"
    },
    {
      "sentence": "My brother will be building the furniture next year.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors will be cooking tea tonight.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time in two days, her sister will be enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, you will be cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "The students will be remembering the decision next month.",
      "verb": "remembering"
    },
    {
      "sentence": "Tonight, i will be listening to the game.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the manager will be meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time in two days, the company will be reading the textbook.",
      "verb": "reading"
    },
    {
      "sentence": "At this time next month, our neighbors will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, the cat will be meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, sarah will be reviewing Spanish.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next year, the team will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "At this time tomorrow, the team will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time tomorrow, the team will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "Soon, sarah will be cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next week, emma will be reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "Soon, she will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, john will be talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "He will be considering the problem next week.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next month, the teacher will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "This weekend, her sister will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tonight, sarah will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time tomorrow, emma will be repairing the garden.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this weekend, my friend will be walking to school.",
      "verb": "walking"
    },
    {
      "sentence": "Tonight, my brother will be playing football.",
      "verb": "playing"
    },
    {
      "sentence": "Later, my brother will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "John will be listening to a podcast in two days.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be listening to a movie next month.",
      "verb": "listening"
    },
    {
      "sentence": "The company will be going to the office soon.",
      "verb": "going"
    },
    {
      "sentence": "At this time tomorrow, my friend will be cleaning the furniture.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next week, we will be talking the client.",
      "verb": "talking"
    },
    {
      "sentence": "The bird will be cooking juice this weekend.",
      "verb": "cooking"
    },
    {
      "sentence": "Tonight, my parents will be selling the ticket.",
      "verb": "selling"
    },
    {
      "sentence": "John will be meeting the manager this evening.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother will be enjoying a podcast in two days.",
      "verb": "enjoying"
    },
    {
      "sentence": "This evening, the children will be enjoying a song.",
      "verb": "enjoying"
    },
    {
      "sentence": "In two days, they will be talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "Next week, our neighbors will be coming to the airport.",
      "verb": "coming"
    },
    {
      "sentence": "At this time later, the team will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors will be running to the library this weekend.",
      "verb": "running"
    },
    {
      "sentence": "At this time next week, i will be forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next year, her sister will be enjoying pizza.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, the students will be building the kitchen.",
      "verb": "building"
    },
    {
      "sentence": "Tonight, the team will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "At this time in two days, tom will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "Tonight, her sister will be writing the report.",
      "verb": "writing"
    },
    {
      "sentence": "At this time in two days, john will be watching tennis.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, he will be finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "At this time soon, her sister will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "Tonight, we will be ordering lunch.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next month, sarah will be making a salad.",
      "verb": "making"
    },
    {
      "sentence": "My parents will be cleaning the garden later.",
      "verb": "cleaning"
    },
    {
      "sentence": "They will be driving to the store next week.",
      "verb": "driving"
    },
    {
      "sentence": "At this time next month, the children will be practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next week, the dog will be returning to the airport.",
      "verb": "returning"
    },
    {
      "sentence": "The manager will be completing the task later.",
      "verb": "completing"
    },
    {
      "sentence": "At this time soon, the students will be receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time tomorrow, john will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "Next week, the children will be selling flowers.",
      "verb": "selling"
    },
    {
      "sentence": "At this time next week, sarah will be flying to the market.",
      "verb": "flying"
    },
    {
      "sentence": "The children will be completing the letter next year.",
      "verb": "completing"
    },
    {
      "sentence": "Next year, you will be receiving the letter.",
      "verb": "receiving"
    },
    {
      "sentence": "Tom will be watching tennis this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "They will be finding groceries tomorrow.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, my brother will be talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "At this time this weekend, emma will be buying a present.",
      "verb": "buying"
    },
    {
      "sentence": "My friend will be arriving to school in two days.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time tonight, the team will be preparing coffee.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, my parents will be talking the neighbors.",
      "verb": "talking"
    },
    {
      "sentence": "The bird will be fixing the garden next week.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother will be planning the future in two days.",
      "verb": "planning"
    },
    {
      "sentence": "Tonight, my friend will be reading English.",
      "verb": "reading"
    },
    {
      "sentence": "Tomorrow, emma will be calling the client.",
      "verb": "calling"
    },
    {
      "sentence": "The manager will be enjoying TV tonight.",
      "verb": "enjoying"
    },
    {
      "sentence": "Emma will be cooking pasta next year.",
      "verb": "cooking"
    },
    {
      "sentence": "Tonight, the students will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "They will be finding a present next week.",
      "verb": "finding"
    },
    {
      "sentence": "In two days, her sister will be submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time this evening, emma will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "At this time next week, emma will be reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, i will be listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "The bird will be playing basketball next year.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will be eating juice next month.",
      "verb": "eating"
    },
    {
      "sentence": "At this time later, the company will be practicing the textbook.",
      "verb": "practicing"
    },
    {
      "sentence": "She will be leaving home tonight.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time this evening, the company will be practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, i will be eating juice.",
      "verb": "eating"
    },
    {
      "sentence": "You will be walking to the office later.",
      "verb": "walking"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be understanding vocabulary.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time tonight, the manager will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "At this time later, the bird will be choosing clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time later, you will be drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "Tonight, sarah will be repairing a website.",
      "verb": "repairing"
    },
    {
      "sentence": "This weekend, the children will be buying a present.",
      "verb": "buying"
    },
    {
      "sentence": "Our neighbors will be driving to school tonight.",
      "verb": "driving"
    },
    {
      "sentence": "You will be submitting the email this evening.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, he will be planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "John will be cooking breakfast tomorrow.",
      "verb": "cooking"
    },
    {
      "sentence": "This evening, she will be designing the room.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tonight, the teacher will be coming to the office.",
      "verb": "coming"
    },
    {
      "sentence": "Later, you will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "He will be running to work this weekend.",
      "verb": "running"
    },
    {
      "sentence": "At this time this weekend, the bird will be designing the furniture.",
      "verb": "designing"
    },
    {
      "sentence": "They will be getting a present this weekend.",
      "verb": "getting"
    },
    {
      "sentence": "At this time this evening, the manager will be arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "Soon, the company will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "Later, my friend will be getting the phone.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, my parents will be listening to a movie.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will be planning the meeting tonight.",
      "verb": "planning"
    },
    {
      "sentence": "The children will be leaving to the store in two days.",
      "verb": "leaving"
    },
    {
      "sentence": "Later, she will be painting the garden.",
      "verb": "painting"
    },
    {
      "sentence": "This evening, they will be enjoying juice.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, the company will be sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "At this time in two days, emma will be buying the phone.",
      "verb": "buying"
    },
    {
      "sentence": "At this time in two days, the dog will be giving a gift.",
      "verb": "giving"
    },
    {
      "sentence": "In two days, the company will be drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, the dog will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "John will be starting the assignment tonight.",
      "verb": "starting"
    },
    {
      "sentence": "The children will be preparing a salad later.",
      "verb": "preparing"
    },
    {
      "sentence": "Next year, my parents will be watching tennis.",
      "verb": "watching"
    },
    {
      "sentence": "He will be watching a song next month.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, my parents will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "She will be cooking a sandwich this weekend.",
      "verb": "cooking"
    },
    {
      "sentence": "In two days, the students will be repairing the furniture.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time in two days, the company will be fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "Next year, our neighbors will be reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "At this time next month, you will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "They will be talking the team this evening.",
      "verb": "talking"
    },
    {
      "sentence": "You will be playing a documentary later.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, my brother will be writing the application.",
      "verb": "writing"
    },
    {
      "sentence": "At this time next year, my friend will be drawing a website.",
      "verb": "drawing"
    },
    {
      "sentence": "In two days, she will be speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "They will be drawing the car next week.",
      "verb": "drawing"
    },
    {
      "sentence": "She will be reading history later.",
      "verb": "reading"
    },
    {
      "sentence": "The company will be playing football tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "The company will be watching football next week.",
      "verb": "watching"
    },
    {
      "sentence": "My brother will be listening to the game in two days.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, she will be finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time in two days, we will be arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, the students will be reading history.",
      "verb": "reading"
    },
    {
      "sentence": "Later, the dog will be enjoying a movie.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, my parents will be ordering a sandwich.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time tonight, the manager will be speaking the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, john will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "At this time this weekend, he will be reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "My friend will be drawing the kitchen this evening.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tomorrow, you will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "She will be understanding grammar later.",
      "verb": "understanding"
    },
    {
      "sentence": "Tonight, they will be getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next year, the cat will be ordering lunch.",
      "verb": "ordering"
    },
    {
      "sentence": "Next week, the teacher will be completing the report.",
      "verb": "completing"
    },
    {
      "sentence": "At this time in two days, we will be contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time next year, the teacher will be reviewing science.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird will be teaching French next month.",
      "verb": "teaching"
    },
    {
      "sentence": "Later, my brother will be giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "At this time later, the company will be understanding grammar.",
      "verb": "understanding"
    },
    {
      "sentence": "In two days, the bird will be visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "I will be starting the assignment tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "Later, my brother will be leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "Soon, my friend will be driving to the market.",
      "verb": "driving"
    },
    {
      "sentence": "At this time soon, the company will be cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next year, our neighbors will be learning the chapter.",
      "verb": "learning"
    },
    {
      "sentence": "In two days, i will be submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "In two days, the teacher will be finishing the document.",
      "verb": "finishing"
    },
    {
      "sentence": "Tomorrow, emma will be repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time soon, the children will be building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "At this time tonight, emma will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "He will be drawing the car tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister will be speaking the manager tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this weekend, john will be driving home.",
      "verb": "driving"
    },
    {
      "sentence": "The manager will be driving to school this weekend.",
      "verb": "driving"
    },
    {
      "sentence": "This weekend, emma will be contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "Later, emma will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will be meeting the client soon.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next year, my parents will be reading science.",
      "verb": "reading"
    },
    {
      "sentence": "Tonight, the students will be planning the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, the teacher will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "At this time soon, sarah will be choosing clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time next year, they will be getting a present.",
      "verb": "getting"
    },
    {
      "sentence": "At this time this weekend, the manager will be finishing the proposal.",
      "verb": "finishing"
    },
    {
      "sentence": "Our neighbors will be eating dinner this evening.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, we will be returning to the gym.",
      "verb": "returning"
    },
    {
      "sentence": "At this time later, they will be sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "Next week, we will be watching music.",
      "verb": "watching"
    },
    {
      "sentence": "At this time in two days, my friend will be ordering lunch.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next month, you will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "John will be choosing the phone in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "Next year, the bird will be making pizza.",
      "verb": "making"
    },
    {
      "sentence": "At this time in two days, my parents will be getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "At this time later, we will be calling the teacher.",
      "verb": "calling"
    },
    {
      "sentence": "At this time later, emma will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the bird will be planning the options.",
      "verb": "planning"
    },
    {
      "sentence": "At this time this weekend, tom will be calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "Next week, she will be repairing the garden.",
      "verb": "repairing"
    },
    {
      "sentence": "This weekend, we will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the children will be drawing the kitchen.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tomorrow, he will be forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "The children will be painting a picture this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this weekend, i will be talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will be considering the future next year.",
      "verb": "considering"
    },
    {
      "sentence": "This weekend, my brother will be forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "He will be cleaning a picture tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "Sarah will be enjoying TV next month.",
      "verb": "enjoying"
    },
    {
      "sentence": "Later, sarah will be cleaning the kitchen.",
      "verb": "cleaning"
    },
    {
      "sentence": "Soon, you will be running to school.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the dog will be returning home.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tomorrow, he will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, we will be reading grammar.",
      "verb": "reading"
    },
    {
      "sentence": "Our neighbors will be playing a podcast next year.",
      "verb": "playing"
    },
    {
      "sentence": "Soon, we will be eating pasta.",
      "verb": "eating"
    },
    {
      "sentence": "At this time later, the team will be planning the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Later, we will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "Tomorrow, they will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "The cat will be drawing the bathroom soon.",
      "verb": "drawing"
    },
    {
      "sentence": "In two days, the teacher will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "This weekend, the dog will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "The students will be enjoying lunch later.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time in two days, the teacher will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "Tomorrow, the team will be writing the letter.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will be receiving the email in two days.",
      "verb": "receiving"
    },
    {
      "sentence": "This evening, her sister will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tomorrow, you will be buying groceries.",
      "verb": "buying"
    },
    {
      "sentence": "Tom will be playing the game later.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, the bird will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "Next week, we will be building the garden.",
      "verb": "building"
    },
    {
      "sentence": "At this time tonight, emma will be considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "The team will be practicing vocabulary later.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher will be practicing English later.",
      "verb": "practicing"
    },
    {
      "sentence": "They will be forgetting the event tomorrow.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next week, you will be planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "At this time in two days, the children will be buying groceries.",
      "verb": "buying"
    },
    {
      "sentence": "The company will be planning the meeting tomorrow.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next month, the teacher will be drinking pizza.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend will be returning to the store next year.",
      "verb": "returning"
    },
    {
      "sentence": "At this time next year, my brother will be arriving to work.",
      "verb": "arriving"
    },
    {
      "sentence": "Next year, emma will be preparing a sandwich.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time this evening, the bird will be getting a gift.",
      "verb": "getting"
    },
    {
      "sentence": "She will be selling groceries soon.",
      "verb": "selling"
    },
    {
      "sentence": "They will be considering the problem tonight.",
      "verb": "considering"
    },
    {
      "sentence": "My parents will be enjoying basketball next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this evening, she will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "The dog will be making pasta next week.",
      "verb": "making"
    },
    {
      "sentence": "John will be going home next year.",
      "verb": "going"
    },
    {
      "sentence": "This evening, he will be enjoying tennis.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tonight, you will be flying home.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next week, emma will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "Tomorrow, the dog will be learning science.",
      "verb": "learning"
    },
    {
      "sentence": "The bird will be practicing French soon.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tonight, my brother will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog will be practicing the lesson tomorrow.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tonight, her sister will be painting the furniture.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, they will be submitting the email.",
      "verb": "submitting"
    },
    {
      "sentence": "Soon, he will be writing the project.",
      "verb": "writing"
    },
    {
      "sentence": "Next year, i will be visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "Tomorrow, the cat will be walking to the market.",
      "verb": "walking"
    },
    {
      "sentence": "The team will be preparing juice next month.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors will be calling the team soon.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next year, we will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "The cat will be ordering a snack next week.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, emma will be buying the keys.",
      "verb": "buying"
    },
    {
      "sentence": "My parents will be fixing the furniture in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time next week, the manager will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this evening, the children will be fixing the bathroom.",
      "verb": "fixing"
    },
    {
      "sentence": "I will be running downtown tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the manager will be sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next week, emma will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "I will be building the car next week.",
      "verb": "building"
    },
    {
      "sentence": "Next year, i will be contacting the neighbors.",
      "verb": "contacting"
    },
    {
      "sentence": "Tomorrow, emma will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time in two days, the cat will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, i will be starting the assignment.",
      "verb": "starting"
    },
    {
      "sentence": "Soon, you will be building a website.",
      "verb": "building"
    },
    {
      "sentence": "The teacher will be getting clothes next month.",
      "verb": "getting"
    },
    {
      "sentence": "Next week, her sister will be ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "Tom will be receiving the report next month.",
      "verb": "receiving"
    },
    {
      "sentence": "My parents will be watching a documentary in two days.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, the students will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this evening, the team will be practicing English.",
      "verb": "practicing"
    },
    {
      "sentence": "Tomorrow, the manager will be reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "I will be starting the contract this weekend.",
      "verb": "starting"
    },
    {
      "sentence": "At this time tomorrow, sarah will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "In two days, the manager will be watching music.",
      "verb": "watching"
    },
    {
      "sentence": "She will be enjoying tennis tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, john will be finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time this evening, the students will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, john will be getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "We will be completing the email this evening.",
      "verb": "completing"
    },
    {
      "sentence": "The students will be understanding Spanish in two days.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time soon, i will be leaving to the beach.",
      "verb": "leaving"
    },
    {
      "sentence": "Next year, we will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "The children will be forgetting the future next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Soon, the bird will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be teaching French next week.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time next year, she will be getting flowers.",
      "verb": "getting"
    },
    {
      "sentence": "At this time tonight, you will be repairing a picture.",
      "verb": "repairing"
    },
    {
      "sentence": "I will be practicing the lesson later.",
      "verb": "practicing"
    },
    {
      "sentence": "My parents will be studying Spanish tomorrow.",
      "verb": "studying"
    },
    {
      "sentence": "At this time in two days, you will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time this evening, john will be painting the kitchen.",
      "verb": "painting"
    },
    {
      "sentence": "This evening, the company will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, her sister will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "Later, sarah will be forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "This evening, i will be watching tennis.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, emma will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "This weekend, john will be making soup.",
      "verb": "making"
    },
    {
      "sentence": "Tonight, the students will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "Tomorrow, the bird will be walking to the market.",
      "verb": "walking"
    },
    {
      "sentence": "At this time next week, the teacher will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next week, my brother will be giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next week, john will be watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, her sister will be studying history.",
      "verb": "studying"
    },
    {
      "sentence": "Next week, tom will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "The cat will be cooking breakfast next month.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time in two days, the teacher will be arriving to the office.",
      "verb": "arriving"
    },
    {
      "sentence": "Tonight, the teacher will be returning to the park.",
      "verb": "returning"
    },
    {
      "sentence": "At this time next year, we will be designing the computer.",
      "verb": "designing"
    },
    {
      "sentence": "At this time next week, we will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Next week, sarah will be playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, we will be contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this evening, sarah will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, you will be cleaning the car.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next month, john will be calling my family.",
      "verb": "calling"
    },
    {
      "sentence": "Tonight, my friend will be forgetting the situation.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah will be ordering soup next year.",
      "verb": "ordering"
    },
    {
      "sentence": "The team will be enjoying music later.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tonight, he will be finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "Tonight, the manager will be enjoying the news.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tonight, tom will be ordering pizza.",
      "verb": "ordering"
    },
    {
      "sentence": "My brother will be visiting my friend next year.",
      "verb": "visiting"
    },
    {
      "sentence": "The children will be remembering the meeting soon.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next year, john will be completing the presentation.",
      "verb": "completing"
    },
    {
      "sentence": "The team will be drawing the car in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, he will be going to work.",
      "verb": "going"
    },
    {
      "sentence": "At this time tonight, the team will be listening to basketball.",
      "verb": "listening"
    },
    {
      "sentence": "At this time soon, they will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next month, she will be thinking about the options.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time this weekend, her sister will be buying clothes.",
      "verb": "buying"
    },
    {
      "sentence": "You will be starting the report tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "At this time later, the manager will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "My parents will be remembering the decision tomorrow.",
      "verb": "remembering"
    },
    {
      "sentence": "Soon, the bird will be speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "My friend will be building the kitchen in two days.",
      "verb": "building"
    },
    {
      "sentence": "At this time soon, my brother will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "They will be giving flowers tonight.",
      "verb": "giving"
    },
    {
      "sentence": "She will be completing the email in two days.",
      "verb": "completing"
    },
    {
      "sentence": "The students will be cooking breakfast in two days.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next week, her sister will be playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will be walking to the beach in two days.",
      "verb": "walking"
    },
    {
      "sentence": "At this time later, i will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "The bird will be coming to the library in two days.",
      "verb": "coming"
    },
    {
      "sentence": "She will be listening to football next month.",
      "verb": "listening"
    },
    {
      "sentence": "They will be thinking about the situation in two days.",
      "verb": "thinking"
    },
    {
      "sentence": "You will be planning the trip in two days.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, my friend will be meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom will be planning the options this weekend.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, the students will be giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "Soon, we will be going to the park.",
      "verb": "going"
    },
    {
      "sentence": "Tomorrow, the cat will be listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "This evening, her sister will be cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next week, the dog will be writing the letter.",
      "verb": "writing"
    },
    {
      "sentence": "This weekend, the bird will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah will be meeting the neighbors in two days.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time soon, the dog will be speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, they will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "Tonight, emma will be submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "The dog will be drawing the furniture tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "He will be writing the task tonight.",
      "verb": "writing"
    },
    {
      "sentence": "The teacher will be giving a laptop next month.",
      "verb": "giving"
    },
    {
      "sentence": "Tonight, he will be teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, her sister will be talking the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "At this time this evening, the students will be drinking a snack.",
      "verb": "drinking"
    },
    {
      "sentence": "The children will be driving to work soon.",
      "verb": "driving"
    },
    {
      "sentence": "Soon, the bird will be starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "At this time next year, sarah will be watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, my friend will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "The cat will be finding a present next year.",
      "verb": "finding"
    },
    {
      "sentence": "At this time this weekend, tom will be enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tonight, emma will be planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "At this time in two days, the children will be speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "Tomorrow, tom will be designing the kitchen.",
      "verb": "designing"
    },
    {
      "sentence": "At this time next year, i will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, we will be reviewing history.",
      "verb": "reviewing"
    },
    {
      "sentence": "Later, the bird will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher will be preparing juice later.",
      "verb": "preparing"
    },
    {
      "sentence": "John will be flying home in two days.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next month, john will be remembering the options.",
      "verb": "remembering"
    },
    {
      "sentence": "My friend will be practicing mathematics tomorrow.",
      "verb": "practicing"
    },
    {
      "sentence": "Her sister will be teaching Spanish this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "Soon, the manager will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "In two days, my brother will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "We will be selling clothes this evening.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the bird will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be designing the computer tonight.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, i will be sending the presentation.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next month, the company will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "The dog will be getting a gift next week.",
      "verb": "getting"
    },
    {
      "sentence": "The cat will be cooking a sandwich later.",
      "verb": "cooking"
    },
    {
      "sentence": "Next year, we will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "Later, the bird will be getting flowers.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, my parents will be drawing the house.",
      "verb": "drawing"
    },
    {
      "sentence": "My brother will be playing football this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, our neighbors will be leaving home.",
      "verb": "leaving"
    },
    {
      "sentence": "At this time this evening, john will be reading for the exam.",
      "verb": "reading"
    },
    {
      "sentence": "At this time this weekend, her sister will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom will be practicing history next year.",
      "verb": "practicing"
    },
    {
      "sentence": "Our neighbors will be choosing the keys next week.",
      "verb": "choosing"
    },
    {
      "sentence": "The teacher will be learning vocabulary in two days.",
      "verb": "learning"
    },
    {
      "sentence": "At this time in two days, tom will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, emma will be returning to work.",
      "verb": "returning"
    },
    {
      "sentence": "At this time soon, sarah will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time in two days, sarah will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will be eating soup this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, my brother will be finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "You will be talking my family next week.",
      "verb": "talking"
    }
  ]
}