{
  "tense": "Future Perfect",
  "description": "Used for actions that will be completed before a specific future time",
  "examples": [
    {
      "sentence": "The team will have completed the project by next year.",
      "verb": "completed"
    },
    {
      "sentence": "The dog will have slept in the sun by then.",
      "verb": "slept"
    },
    {
      "sentence": "She will have played guitar by soon.",
      "verb": "played"
    },
    {
      "sentence": "The team will have launched the software by then.",
      "verb": "launched"
    },
    {
      "sentence": "I will have spoken with a colleague by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By later, they will have gotten a book.",
      "verb": "gotten"
    },
    {
      "sentence": "The dog will have eaten some food by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, the manager will have returned to the park.",
      "verb": "returned"
    },
    {
      "sentence": "By soon, emma will have tidied the garage.",
      "verb": "tidied"
    },
    {
      "sentence": "By this weekend, the children will have designed a prototype.",
      "verb": "designed"
    },
    {
      "sentence": "Her sister will have designed a house by next month.",
      "verb": "designed"
    },
    {
      "sentence": "The manager will have visited my friend by next year.",
      "verb": "visited"
    },
    {
      "sentence": "My friend will have played the piano by this evening.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have listened to the lecture by then.",
      "verb": "listened"
    },
    {
      "sentence": "We will have met my parents by then.",
      "verb": "met"
    },
    {
      "sentence": "By tonight, the company will have announced the contract.",
      "verb": "announced"
    },
    {
      "sentence": "Emma will have tidied the bathroom by then.",
      "verb": "tidied"
    },
    {
      "sentence": "My brother will have built a house by then.",
      "verb": "built"
    },
    {
      "sentence": "The dog will have played in the yard by this evening.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have created a model by then.",
      "verb": "created"
    },
    {
      "sentence": "Emma will have created a presentation by soon.",
      "verb": "created"
    },
    {
      "sentence": "By later, he will have had a sandwich.",
      "verb": "had"
    },
    {
      "sentence": "By tonight, emma will have decided on the problem.",
      "verb": "decided"
    },
    {
      "sentence": "He will have forgotten the situation by soon.",
      "verb": "forgotten"
    },
    {
      "sentence": "By in two days, my parents will have drunk coffee.",
      "verb": "drunk"
    },
    {
      "sentence": "The team will have won the deal by later.",
      "verb": "won"
    },
    {
      "sentence": "I will have called the team by then.",
      "verb": "called"
    },
    {
      "sentence": "The cat will have caught the toy by then.",
      "verb": "caught"
    },
    {
      "sentence": "By tonight, the students will have listened to the lecture.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have played with its owner by next month.",
      "verb": "played"
    },
    {
      "sentence": "The teacher will have seen the neighbors by then.",
      "verb": "seen"
    },
    {
      "sentence": "Our neighbors will have remembered the future by then.",
      "verb": "remembered"
    },
    {
      "sentence": "The cat will have chased the other pets by tonight.",
      "verb": "chased"
    },
    {
      "sentence": "My brother will have bought a new car by then.",
      "verb": "bought"
    },
    {
      "sentence": "The bird will have eaten a treat by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, the manager will have prepared the presentation.",
      "verb": "prepared"
    },
    {
      "sentence": "By later, the cat will have slept in the sun.",
      "verb": "slept"
    },
    {
      "sentence": "By next month, we will have started the application.",
      "verb": "started"
    },
    {
      "sentence": "By next year, the team will have developed the championship.",
      "verb": "developed"
    },
    {
      "sentence": "The cat will have slept in the corner by soon.",
      "verb": "slept"
    },
    {
      "sentence": "By soon, my parents will have fixed the computer.",
      "verb": "fixed"
    },
    {
      "sentence": "By next week, my brother will have run to the park.",
      "verb": "run"
    },
    {
      "sentence": "Sarah will have drawn a portrait by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By next month, you will have submitted the email.",
      "verb": "submitted"
    },
    {
      "sentence": "My friend will have painted a landscape by then.",
      "verb": "painted"
    },
    {
      "sentence": "By this weekend, her sister will have talked to my parents.",
      "verb": "talked"
    },
    {
      "sentence": "By tomorrow, my friend will have drunk water.",
      "verb": "drunk"
    },
    {
      "sentence": "By this evening, the cat will have slept all day.",
      "verb": "slept"
    },
    {
      "sentence": "By this evening, the students will have cooked rice.",
      "verb": "cooked"
    },
    {
      "sentence": "By next month, he will have drunk tea.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have designed an app by then.",
      "verb": "designed"
    },
    {
      "sentence": "By this evening, the bird will have chased the ball.",
      "verb": "chased"
    },
    {
      "sentence": "You will have watched football by this weekend.",
      "verb": "watched"
    },
    {
      "sentence": "My brother will have eaten a meal by this weekend.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have drunk water by this evening.",
      "verb": "drunk"
    },
    {
      "sentence": "By this weekend, the children will have cleaned the clothes.",
      "verb": "cleaned"
    },
    {
      "sentence": "By tomorrow, she will have drunk coffee.",
      "verb": "drunk"
    },
    {
      "sentence": "The manager will have fixed the computer by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By this weekend, they will have played golf.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have painted the wall by next week.",
      "verb": "painted"
    },
    {
      "sentence": "My friend will have repaired the roof by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, they will have planned the plan.",
      "verb": "planned"
    },
    {
      "sentence": "The manager will have designed a model by this evening.",
      "verb": "designed"
    },
    {
      "sentence": "By later, the teacher will have taught French.",
      "verb": "taught"
    },
    {
      "sentence": "By later, the dog will have eaten the leftover food.",
      "verb": "eaten"
    },
    {
      "sentence": "The manager will have painted a picture by then.",
      "verb": "painted"
    },
    {
      "sentence": "The cat will have eaten some food by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "The bird will have eaten its breakfast by tomorrow.",
      "verb": "eaten"
    },
    {
      "sentence": "Tom will have watched football by then.",
      "verb": "watched"
    },
    {
      "sentence": "I will have traveled to the hospital by next week.",
      "verb": "traveled"
    },
    {
      "sentence": "By tomorrow, our neighbors will have completed the proposal.",
      "verb": "completed"
    },
    {
      "sentence": "By in two days, the teacher will have listened to a song.",
      "verb": "listened"
    },
    {
      "sentence": "They will have completed the presentation by in two days.",
      "verb": "completed"
    },
    {
      "sentence": "The cat will have eaten a treat by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have walked to the bank by later.",
      "verb": "walked"
    },
    {
      "sentence": "By this weekend, the cat will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have eaten a treat by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, her sister will have washed the dishes.",
      "verb": "washed"
    },
    {
      "sentence": "By in two days, the cat will have slept under the table.",
      "verb": "slept"
    },
    {
      "sentence": "By next year, her sister will have come to work.",
      "verb": "come"
    },
    {
      "sentence": "By this weekend, you will have drunk a smoothie.",
      "verb": "drunk"
    },
    {
      "sentence": "Her sister will have repaired the machine by then.",
      "verb": "repaired"
    },
    {
      "sentence": "My parents will have flown to the beach by then.",
      "verb": "flown"
    },
    {
      "sentence": "The dog will have caught a bird by then.",
      "verb": "caught"
    },
    {
      "sentence": "My brother will have thought about the decision by then.",
      "verb": "thought"
    },
    {
      "sentence": "The bird will have eaten quickly by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "By next week, our neighbors will have tidied the car.",
      "verb": "tidied"
    },
    {
      "sentence": "You will have prepared rice by soon.",
      "verb": "prepared"
    },
    {
      "sentence": "She will have eaten pizza by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, she will have played video games.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, the teacher will have spoken with the professor.",
      "verb": "spoken"
    },
    {
      "sentence": "The team will have released the contract by next week.",
      "verb": "released"
    },
    {
      "sentence": "The bird will have eaten its breakfast by this evening.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, the children will have returned to the park.",
      "verb": "returned"
    },
    {
      "sentence": "By next week, the cat will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "The teacher will have cleaned the room by in two days.",
      "verb": "cleaned"
    },
    {
      "sentence": "They will have practiced English by in two days.",
      "verb": "practiced"
    },
    {
      "sentence": "The dog will have caught a treat by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "By tomorrow, he will have built a project.",
      "verb": "built"
    },
    {
      "sentence": "You will have designed a website by then.",
      "verb": "designed"
    },
    {
      "sentence": "By tomorrow, the cat will have eaten quickly.",
      "verb": "eaten"
    },
    {
      "sentence": "Tom will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "You will have played soccer by then.",
      "verb": "played"
    },
    {
      "sentence": "By next month, our neighbors will have played soccer.",
      "verb": "played"
    },
    {
      "sentence": "They will have repaired the bike by next week.",
      "verb": "repaired"
    },
    {
      "sentence": "Sarah will have played golf by soon.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have caught the ball by then.",
      "verb": "caught"
    },
    {
      "sentence": "I will have listened to the lecture by then.",
      "verb": "listened"
    },
    {
      "sentence": "The dog will have caught a butterfly by tonight.",
      "verb": "caught"
    },
    {
      "sentence": "By later, the bird will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "I will have watched football by next year.",
      "verb": "watched"
    },
    {
      "sentence": "The dog will have slept in the sun by tomorrow.",
      "verb": "slept"
    },
    {
      "sentence": "The students will have gone to the park by then.",
      "verb": "gone"
    },
    {
      "sentence": "The students will have sent the letter by tomorrow.",
      "verb": "sent"
    },
    {
      "sentence": "My parents will have written the presentation by then.",
      "verb": "written"
    },
    {
      "sentence": "By tonight, my friend will have reviewed the textbook.",
      "verb": "reviewed"
    },
    {
      "sentence": "The students will have designed a model by then.",
      "verb": "designed"
    },
    {
      "sentence": "By next year, our neighbors will have fixed the fence.",
      "verb": "fixed"
    },
    {
      "sentence": "By tonight, the cat will have caught the mouse.",
      "verb": "caught"
    },
    {
      "sentence": "By in two days, the dog will have caught a bird.",
      "verb": "caught"
    },
    {
      "sentence": "By next month, the students will have organized the room.",
      "verb": "organized"
    },
    {
      "sentence": "By this evening, he will have washed the office.",
      "verb": "washed"
    },
    {
      "sentence": "The bird will have slept by the window by next month.",
      "verb": "slept"
    },
    {
      "sentence": "Emma will have repaired the fence by later.",
      "verb": "repaired"
    },
    {
      "sentence": "By tonight, her sister will have reviewed grammar.",
      "verb": "reviewed"
    },
    {
      "sentence": "By this evening, my parents will have texted the client.",
      "verb": "texted"
    },
    {
      "sentence": "My parents will have sent the proposal by then.",
      "verb": "sent"
    },
    {
      "sentence": "Our neighbors will have met the manager by tonight.",
      "verb": "met"
    },
    {
      "sentence": "By in two days, my parents will have seen my parents.",
      "verb": "seen"
    },
    {
      "sentence": "By this weekend, our neighbors will have driven to school.",
      "verb": "driven"
    },
    {
      "sentence": "By later, we will have created a prototype.",
      "verb": "created"
    },
    {
      "sentence": "He will have organized the garage by soon.",
      "verb": "organized"
    },
    {
      "sentence": "Sarah will have cleaned the office by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "The cat will have run in the garden by next month.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have sent the application by later.",
      "verb": "sent"
    },
    {
      "sentence": "Her sister will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next month, the cat will have caught a bird.",
      "verb": "caught"
    },
    {
      "sentence": "By soon, you will have visited my grandmother.",
      "verb": "visited"
    },
    {
      "sentence": "John will have finished the presentation by soon.",
      "verb": "finished"
    },
    {
      "sentence": "Our neighbors will have met my friend by then.",
      "verb": "met"
    },
    {
      "sentence": "Sarah will have traveled home by then.",
      "verb": "traveled"
    },
    {
      "sentence": "They will have created a website by then.",
      "verb": "created"
    },
    {
      "sentence": "Tom will have arrived downtown by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The dog will have eaten some food by this weekend.",
      "verb": "eaten"
    },
    {
      "sentence": "The dog will have eaten quickly by then.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have met my family by then.",
      "verb": "met"
    },
    {
      "sentence": "By later, the cat will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "By soon, our neighbors will have cooked rice.",
      "verb": "cooked"
    },
    {
      "sentence": "By next month, the bird will have slept in the corner.",
      "verb": "slept"
    },
    {
      "sentence": "Sarah will have played chess by in two days.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, the cat will have chased the toy.",
      "verb": "chased"
    },
    {
      "sentence": "By in two days, tom will have sketched an illustration.",
      "verb": "sketched"
    },
    {
      "sentence": "She will have taught Spanish by then.",
      "verb": "taught"
    },
    {
      "sentence": "By this weekend, we will have seen the teacher.",
      "verb": "seen"
    },
    {
      "sentence": "We will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "By tonight, the bird will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "The students will have sold the phone by then.",
      "verb": "sold"
    },
    {
      "sentence": "The cat will have eaten quickly by this evening.",
      "verb": "eaten"
    },
    {
      "sentence": "The children will have cooked rice by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By soon, the bird will have chased the mouse.",
      "verb": "chased"
    },
    {
      "sentence": "My friend will have texted the manager by in two days.",
      "verb": "texted"
    },
    {
      "sentence": "By later, she will have understood the lesson.",
      "verb": "understood"
    },
    {
      "sentence": "You will have met the neighbors by this evening.",
      "verb": "met"
    },
    {
      "sentence": "He will have eaten pasta by next week.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, the bird will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "By tomorrow, he will have baked a salad.",
      "verb": "baked"
    },
    {
      "sentence": "The dog will have played with the toy by later.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have played with the other pets by this evening.",
      "verb": "played"
    },
    {
      "sentence": "The teacher will have learned Spanish by then.",
      "verb": "learned"
    },
    {
      "sentence": "By soon, john will have run to school.",
      "verb": "run"
    },
    {
      "sentence": "Emma will have built a website by then.",
      "verb": "built"
    },
    {
      "sentence": "John will have painted a diagram by then.",
      "verb": "painted"
    },
    {
      "sentence": "By in two days, the dog will have caught a treat.",
      "verb": "caught"
    },
    {
      "sentence": "By tomorrow, we will have arrived to the market.",
      "verb": "arrived"
    },
    {
      "sentence": "The bird will have played with the other pets by next year.",
      "verb": "played"
    },
    {
      "sentence": "They will have played basketball by tonight.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have planned the birthday party by then.",
      "verb": "planned"
    },
    {
      "sentence": "The dog will have eaten some food by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "By tomorrow, he will have returned to the office.",
      "verb": "returned"
    },
    {
      "sentence": "By next week, they will have designed a presentation.",
      "verb": "designed"
    },
    {
      "sentence": "You will have chosen a gift by this weekend.",
      "verb": "chosen"
    },
    {
      "sentence": "By next year, our neighbors will have spoken to the neighbors.",
      "verb": "spoken"
    },
    {
      "sentence": "The bird will have played with its owner by then.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have chased its tail by this evening.",
      "verb": "chased"
    },
    {
      "sentence": "By tomorrow, he will have repaired the car.",
      "verb": "repaired"
    },
    {
      "sentence": "I will have found some clothes by then.",
      "verb": "found"
    },
    {
      "sentence": "By soon, we will have built an app.",
      "verb": "built"
    },
    {
      "sentence": "I will have sketched a landscape by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By next month, sarah will have emailed the client.",
      "verb": "emailed"
    },
    {
      "sentence": "By next year, the teacher will have visited the doctor.",
      "verb": "visited"
    },
    {
      "sentence": "By next year, we will have visited an old friend.",
      "verb": "visited"
    },
    {
      "sentence": "My parents will have watched a show by next month.",
      "verb": "watched"
    },
    {
      "sentence": "He will have contacted my friend by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By this weekend, the dog will have eaten its dinner.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have eaten a salad by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, the cat will have played in the park.",
      "verb": "played"
    },
    {
      "sentence": "By next week, the students will have cleaned the room.",
      "verb": "cleaned"
    },
    {
      "sentence": "By next week, we will have repaired the bike.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, the bird will have eaten its dinner.",
      "verb": "eaten"
    },
    {
      "sentence": "Tom will have learned English by in two days.",
      "verb": "learned"
    },
    {
      "sentence": "My friend will have called the office by then.",
      "verb": "called"
    },
    {
      "sentence": "They will have watched football by tonight.",
      "verb": "watched"
    },
    {
      "sentence": "By in two days, the teacher will have given a present.",
      "verb": "given"
    },
    {
      "sentence": "By this weekend, john will have eaten breakfast.",
      "verb": "eaten"
    },
    {
      "sentence": "The manager will have arrived to the airport by this evening.",
      "verb": "arrived"
    },
    {
      "sentence": "By in two days, emma will have tidied the bathroom.",
      "verb": "tidied"
    },
    {
      "sentence": "The cat will have played with the toy by tonight.",
      "verb": "played"
    },
    {
      "sentence": "By next year, my friend will have made soup.",
      "verb": "made"
    },
    {
      "sentence": "My brother will have eaten dinner by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have played soccer by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have emailed the team by then.",
      "verb": "emailed"
    },
    {
      "sentence": "The teacher will have seen my parents by tonight.",
      "verb": "seen"
    },
    {
      "sentence": "The team will have won a new product by then.",
      "verb": "won"
    },
    {
      "sentence": "By soon, the dog will have slept all day.",
      "verb": "slept"
    },
    {
      "sentence": "By in two days, the teacher will have remembered the plan.",
      "verb": "remembered"
    },
    {
      "sentence": "Emma will have drawn an illustration by this weekend.",
      "verb": "drawn"
    },
    {
      "sentence": "By next month, tom will have emailed my parents.",
      "verb": "emailed"
    },
    {
      "sentence": "The manager will have drawn a picture by soon.",
      "verb": "drawn"
    },
    {
      "sentence": "By next year, sarah will have flown to work.",
      "verb": "flown"
    },
    {
      "sentence": "By next week, sarah will have spoken to the client.",
      "verb": "spoken"
    },
    {
      "sentence": "By this evening, the cat will have eaten its dinner.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have thought about the plan by soon.",
      "verb": "thought"
    },
    {
      "sentence": "The bird will have eaten some food by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, my friend will have given groceries.",
      "verb": "given"
    },
    {
      "sentence": "The manager will have played volleyball by then.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have drunk juice by then.",
      "verb": "drunk"
    },
    {
      "sentence": "We will have chosen the keys by then.",
      "verb": "chosen"
    },
    {
      "sentence": "The dog will have played with the ball by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "By later, my parents will have called my parents.",
      "verb": "called"
    },
    {
      "sentence": "They will have built a project by then.",
      "verb": "built"
    },
    {
      "sentence": "The cat will have slept all day by soon.",
      "verb": "slept"
    },
    {
      "sentence": "They will have met my friend by then.",
      "verb": "met"
    },
    {
      "sentence": "By later, the cat will have caught the mouse.",
      "verb": "caught"
    },
    {
      "sentence": "By later, the bird will have played with the other pets.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have slept under the table by soon.",
      "verb": "slept"
    },
    {
      "sentence": "The bird will have eaten its breakfast by later.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have contacted the teacher by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By this weekend, emma will have learned the lesson.",
      "verb": "learned"
    },
    {
      "sentence": "She will have chosen some clothes by then.",
      "verb": "chosen"
    },
    {
      "sentence": "You will have decided on the future by later.",
      "verb": "decided"
    },
    {
      "sentence": "By later, the manager will have talked to the teacher.",
      "verb": "talked"
    },
    {
      "sentence": "By next year, my brother will have watched the news.",
      "verb": "watched"
    },
    {
      "sentence": "Tom will have made a salad by then.",
      "verb": "made"
    },
    {
      "sentence": "By soon, she will have traveled downtown.",
      "verb": "traveled"
    },
    {
      "sentence": "She will have sent the task by in two days.",
      "verb": "sent"
    },
    {
      "sentence": "The dog will have caught the frisbee by then.",
      "verb": "caught"
    },
    {
      "sentence": "By later, i will have had some fruit.",
      "verb": "had"
    },
    {
      "sentence": "My parents will have gotten a book by then.",
      "verb": "gotten"
    },
    {
      "sentence": "John will have arrived home by next year.",
      "verb": "arrived"
    },
    {
      "sentence": "Tom will have created a project by then.",
      "verb": "created"
    },
    {
      "sentence": "My brother will have flown to school by soon.",
      "verb": "flown"
    },
    {
      "sentence": "The teacher will have played guitar by next week.",
      "verb": "played"
    },
    {
      "sentence": "The children will have read the lesson by soon.",
      "verb": "read"
    },
    {
      "sentence": "We will have watched a series by then.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, the cat will have played in the garden.",
      "verb": "played"
    },
    {
      "sentence": "By next year, emma will have visited my parents.",
      "verb": "visited"
    },
    {
      "sentence": "By next week, my friend will have visited the team.",
      "verb": "visited"
    },
    {
      "sentence": "By this evening, you will have traveled to school.",
      "verb": "traveled"
    },
    {
      "sentence": "My parents will have played video games by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have considered the meeting by this evening.",
      "verb": "considered"
    },
    {
      "sentence": "Sarah will have had pasta by then.",
      "verb": "had"
    },
    {
      "sentence": "Emma will have decided on the vacation by then.",
      "verb": "decided"
    },
    {
      "sentence": "Her sister will have read vocabulary by next week.",
      "verb": "read"
    },
    {
      "sentence": "By later, emma will have left to the bank.",
      "verb": "left"
    },
    {
      "sentence": "By next week, the teacher will have fixed the roof.",
      "verb": "fixed"
    },
    {
      "sentence": "By tomorrow, she will have cooked lunch.",
      "verb": "cooked"
    },
    {
      "sentence": "The children will have painted a landscape by then.",
      "verb": "painted"
    },
    {
      "sentence": "The manager will have bought the ticket by next week.",
      "verb": "bought"
    },
    {
      "sentence": "We will have cleaned the dishes by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "Our neighbors will have listened to classical music by later.",
      "verb": "listened"
    },
    {
      "sentence": "The bird will have slept under the table by tomorrow.",
      "verb": "slept"
    },
    {
      "sentence": "My brother will have drawn a landscape by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By next year, the team will have launched the results.",
      "verb": "launched"
    },
    {
      "sentence": "By soon, the dog will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "We will have gotten a laptop by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By next month, they will have visited the manager.",
      "verb": "visited"
    },
    {
      "sentence": "By later, we will have watched a movie.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, the children will have seen the teacher.",
      "verb": "seen"
    },
    {
      "sentence": "My brother will have reviewed the material by this evening.",
      "verb": "reviewed"
    },
    {
      "sentence": "Emma will have repaired the computer by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By tonight, my brother will have contacted the client.",
      "verb": "contacted"
    },
    {
      "sentence": "Emma will have drunk water by then.",
      "verb": "drunk"
    },
    {
      "sentence": "He will have contacted the client by soon.",
      "verb": "contacted"
    },
    {
      "sentence": "My friend will have drunk milk by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have caught a butterfly by then.",
      "verb": "caught"
    },
    {
      "sentence": "By next month, the dog will have caught the frisbee.",
      "verb": "caught"
    },
    {
      "sentence": "By next month, the students will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "You will have watched a series by then.",
      "verb": "watched"
    },
    {
      "sentence": "They will have planned the decision by later.",
      "verb": "planned"
    },
    {
      "sentence": "The children will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have flown to school by then.",
      "verb": "flown"
    },
    {
      "sentence": "Her sister will have repaired the car by soon.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, tom will have tidied the house.",
      "verb": "tidied"
    },
    {
      "sentence": "The students will have spoken to the manager by this evening.",
      "verb": "spoken"
    },
    {
      "sentence": "The dog will have run in the yard by then.",
      "verb": "run"
    },
    {
      "sentence": "By tonight, i will have listened to the news.",
      "verb": "listened"
    },
    {
      "sentence": "Tom will have created a project by tonight.",
      "verb": "created"
    },
    {
      "sentence": "The dog will have chased the other pets by this evening.",
      "verb": "chased"
    },
    {
      "sentence": "By this evening, the students will have fixed the machine.",
      "verb": "fixed"
    },
    {
      "sentence": "You will have fixed the bike by then.",
      "verb": "fixed"
    },
    {
      "sentence": "You will have painted a picture by then.",
      "verb": "painted"
    },
    {
      "sentence": "Her sister will have met my friend by then.",
      "verb": "met"
    },
    {
      "sentence": "By this weekend, the bird will have eaten a treat.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have fixed the car by next year.",
      "verb": "fixed"
    },
    {
      "sentence": "You will have drawn a design by soon.",
      "verb": "drawn"
    },
    {
      "sentence": "The children will have met the client by next year.",
      "verb": "met"
    },
    {
      "sentence": "By tomorrow, the teacher will have played chess.",
      "verb": "played"
    },
    {
      "sentence": "We will have studied the lesson by then.",
      "verb": "studied"
    },
    {
      "sentence": "He will have arrived to the gym by next year.",
      "verb": "arrived"
    },
    {
      "sentence": "By next week, the teacher will have fixed the machine.",
      "verb": "fixed"
    },
    {
      "sentence": "My parents will have washed the garage by then.",
      "verb": "washed"
    },
    {
      "sentence": "Her sister will have built a house by later.",
      "verb": "built"
    },
    {
      "sentence": "By tomorrow, the dog will have slept all day.",
      "verb": "slept"
    },
    {
      "sentence": "By next year, her sister will have come to the market.",
      "verb": "come"
    },
    {
      "sentence": "Emma will have watched a series by then.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have played in the garden by this weekend.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have called the team by next month.",
      "verb": "called"
    },
    {
      "sentence": "The cat will have run in the park by this evening.",
      "verb": "run"
    },
    {
      "sentence": "The company will have developed the championship by then.",
      "verb": "developed"
    },
    {
      "sentence": "The students will have painted a poster by then.",
      "verb": "painted"
    },
    {
      "sentence": "By in two days, the children will have contacted the office.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, we will have met an old friend.",
      "verb": "met"
    },
    {
      "sentence": "By this weekend, i will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "She will have listened to the radio by then.",
      "verb": "listened"
    },
    {
      "sentence": "The dog will have slept all day by next year.",
      "verb": "slept"
    },
    {
      "sentence": "By tonight, my brother will have listened to an audiobook.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have run in the park by then.",
      "verb": "run"
    },
    {
      "sentence": "The company will have announced the championship by in two days.",
      "verb": "announced"
    },
    {
      "sentence": "The teacher will have tidied the clothes by then.",
      "verb": "tidied"
    },
    {
      "sentence": "My friend will have played volleyball by next week.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have eaten the leftover food by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have spoken to the teacher by this weekend.",
      "verb": "spoken"
    },
    {
      "sentence": "The cat will have run in the park by tonight.",
      "verb": "run"
    },
    {
      "sentence": "John will have thought about the plan by then.",
      "verb": "thought"
    },
    {
      "sentence": "The cat will have slept on the couch by later.",
      "verb": "slept"
    },
    {
      "sentence": "You will have found a laptop by tomorrow.",
      "verb": "found"
    },
    {
      "sentence": "By next month, our neighbors will have created a plan.",
      "verb": "created"
    },
    {
      "sentence": "My brother will have watched a video by then.",
      "verb": "watched"
    },
    {
      "sentence": "The dog will have run around the house by soon.",
      "verb": "run"
    },
    {
      "sentence": "Sarah will have watched football by then.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have caught the toy by soon.",
      "verb": "caught"
    },
    {
      "sentence": "Emma will have drunk some water by tonight.",
      "verb": "drunk"
    },
    {
      "sentence": "The bird will have run through the grass by next month.",
      "verb": "run"
    },
    {
      "sentence": "She will have remembered the event by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By tonight, emma will have sent the email.",
      "verb": "sent"
    },
    {
      "sentence": "By soon, the bird will have eaten its dinner.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, emma will have decided on the situation.",
      "verb": "decided"
    },
    {
      "sentence": "We will have come downtown by then.",
      "verb": "come"
    },
    {
      "sentence": "The teacher will have visited my grandmother by then.",
      "verb": "visited"
    },
    {
      "sentence": "By next month, sarah will have baked a meal.",
      "verb": "baked"
    },
    {
      "sentence": "The teacher will have seen my family by in two days.",
      "verb": "seen"
    },
    {
      "sentence": "Our neighbors will have drunk milk by then.",
      "verb": "drunk"
    },
    {
      "sentence": "We will have bought a new car by then.",
      "verb": "bought"
    },
    {
      "sentence": "By this weekend, the cat will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "He will have practiced science by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The bird will have slept by the window by then.",
      "verb": "slept"
    },
    {
      "sentence": "My parents will have sold a laptop by next year.",
      "verb": "sold"
    },
    {
      "sentence": "The company will have launched the contract by then.",
      "verb": "launched"
    },
    {
      "sentence": "Emma will have contacted the teacher by this evening.",
      "verb": "contacted"
    },
    {
      "sentence": "The cat will have slept by the window by then.",
      "verb": "slept"
    },
    {
      "sentence": "By soon, the cat will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "By next year, the dog will have slept under the table.",
      "verb": "slept"
    },
    {
      "sentence": "By later, the manager will have gone to work.",
      "verb": "gone"
    },
    {
      "sentence": "The students will have watched a movie by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, they will have prepared the assignment.",
      "verb": "prepared"
    },
    {
      "sentence": "By this weekend, my parents will have come to school.",
      "verb": "come"
    },
    {
      "sentence": "By this weekend, emma will have seen my family.",
      "verb": "seen"
    },
    {
      "sentence": "I will have traveled to the library by then.",
      "verb": "traveled"
    },
    {
      "sentence": "You will have seen the team by then.",
      "verb": "seen"
    },
    {
      "sentence": "By next month, the bird will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "He will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By next month, tom will have watched a documentary.",
      "verb": "watched"
    },
    {
      "sentence": "The manager will have spoken with the manager by later.",
      "verb": "spoken"
    },
    {
      "sentence": "They will have drunk coffee by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "By later, my friend will have sketched a design.",
      "verb": "sketched"
    },
    {
      "sentence": "The teacher will have visited the team by soon.",
      "verb": "visited"
    },
    {
      "sentence": "Our neighbors will have visited the team by later.",
      "verb": "visited"
    },
    {
      "sentence": "By next year, the children will have bought the ticket.",
      "verb": "bought"
    },
    {
      "sentence": "By this evening, the teacher will have come downtown.",
      "verb": "come"
    },
    {
      "sentence": "My parents will have had soup by then.",
      "verb": "had"
    },
    {
      "sentence": "Tom will have written the presentation by next year.",
      "verb": "written"
    },
    {
      "sentence": "My parents will have designed a presentation by then.",
      "verb": "designed"
    },
    {
      "sentence": "He will have chosen the ticket by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By later, the bird will have slept under the table.",
      "verb": "slept"
    },
    {
      "sentence": "Her sister will have emailed my parents by then.",
      "verb": "emailed"
    },
    {
      "sentence": "My parents will have watched football by next year.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, the students will have read mathematics.",
      "verb": "read"
    },
    {
      "sentence": "By in two days, her sister will have played video games.",
      "verb": "played"
    },
    {
      "sentence": "They will have eaten a meal by next month.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have studied the material by in two days.",
      "verb": "studied"
    },
    {
      "sentence": "He will have talked to the neighbors by then.",
      "verb": "talked"
    },
    {
      "sentence": "Her sister will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have listened to music by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "You will have talked to my family by next week.",
      "verb": "talked"
    },
    {
      "sentence": "By tonight, her sister will have designed an app.",
      "verb": "designed"
    },
    {
      "sentence": "Tom will have repaired the door by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The children will have drawn a picture by next week.",
      "verb": "drawn"
    },
    {
      "sentence": "They will have seen the teacher by next month.",
      "verb": "seen"
    },
    {
      "sentence": "He will have studied French by soon.",
      "verb": "studied"
    },
    {
      "sentence": "By tomorrow, emma will have prepared the project.",
      "verb": "prepared"
    },
    {
      "sentence": "They will have met the neighbors by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "The bird will have chased the toy by this evening.",
      "verb": "chased"
    },
    {
      "sentence": "By next month, tom will have sent the task.",
      "verb": "sent"
    },
    {
      "sentence": "By tomorrow, the children will have flown to the beach.",
      "verb": "flown"
    },
    {
      "sentence": "I will have spoken with my family by this evening.",
      "verb": "spoken"
    },
    {
      "sentence": "By next month, the dog will have chased the squirrel.",
      "verb": "chased"
    },
    {
      "sentence": "Tom will have drunk water by next week.",
      "verb": "drunk"
    },
    {
      "sentence": "By tomorrow, sarah will have met the client.",
      "verb": "met"
    },
    {
      "sentence": "You will have drawn the wall by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The manager will have made cookies by soon.",
      "verb": "made"
    },
    {
      "sentence": "The dog will have played in the park by then.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, you will have spoken to the teacher.",
      "verb": "spoken"
    },
    {
      "sentence": "By tonight, john will have drunk a smoothie.",
      "verb": "drunk"
    },
    {
      "sentence": "You will have listened to the radio by then.",
      "verb": "listened"
    },
    {
      "sentence": "The manager will have come to school by then.",
      "verb": "come"
    },
    {
      "sentence": "The dog will have chased the other pets by this weekend.",
      "verb": "chased"
    },
    {
      "sentence": "We will have learned mathematics by soon.",
      "verb": "learned"
    },
    {
      "sentence": "By soon, the teacher will have sketched a picture.",
      "verb": "sketched"
    },
    {
      "sentence": "By next week, the dog will have chased the mouse.",
      "verb": "chased"
    },
    {
      "sentence": "Tom will have chosen the phone by then.",
      "verb": "chosen"
    },
    {
      "sentence": "The dog will have eaten a treat by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The bird will have eaten its breakfast by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, i will have sketched the wall.",
      "verb": "sketched"
    },
    {
      "sentence": "By in two days, tom will have fixed the sink.",
      "verb": "fixed"
    },
    {
      "sentence": "I will have decided on the trip by tomorrow.",
      "verb": "decided"
    },
    {
      "sentence": "You will have made a meal by next week.",
      "verb": "made"
    },
    {
      "sentence": "By next month, john will have painted a portrait.",
      "verb": "painted"
    },
    {
      "sentence": "By this weekend, my friend will have traveled to the bank.",
      "verb": "traveled"
    },
    {
      "sentence": "They will have organized the house by next year.",
      "verb": "organized"
    },
    {
      "sentence": "John will have drunk juice by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By next week, john will have arrived home.",
      "verb": "arrived"
    },
    {
      "sentence": "The children will have drunk tea by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Our neighbors will have built a presentation by next week.",
      "verb": "built"
    },
    {
      "sentence": "Her sister will have spoken to the manager by tonight.",
      "verb": "spoken"
    },
    {
      "sentence": "The dog will have eaten some food by later.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have talked to the professor by then.",
      "verb": "talked"
    },
    {
      "sentence": "By next week, the dog will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "The teacher will have forgotten the problem by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tomorrow, the manager will have tidied the kitchen.",
      "verb": "tidied"
    },
    {
      "sentence": "By this weekend, the team will have released the championship.",
      "verb": "released"
    },
    {
      "sentence": "Tom will have had a salad by this evening.",
      "verb": "had"
    },
    {
      "sentence": "By later, our neighbors will have watched TV.",
      "verb": "watched"
    },
    {
      "sentence": "By soon, emma will have chosen a laptop.",
      "verb": "chosen"
    },
    {
      "sentence": "By in two days, my parents will have drunk juice.",
      "verb": "drunk"
    },
    {
      "sentence": "By tonight, the manager will have talked to the team.",
      "verb": "talked"
    },
    {
      "sentence": "The team will have developed the software by this evening.",
      "verb": "developed"
    },
    {
      "sentence": "The team will have launched the deal by soon.",
      "verb": "launched"
    },
    {
      "sentence": "By later, i will have texted the manager.",
      "verb": "texted"
    },
    {
      "sentence": "The teacher will have drunk a smoothie by in two days.",
      "verb": "drunk"
    },
    {
      "sentence": "By tonight, my brother will have repaired the door.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, the cat will have slept under the table.",
      "verb": "slept"
    },
    {
      "sentence": "You will have studied the lesson by this weekend.",
      "verb": "studied"
    },
    {
      "sentence": "They will have seen the neighbors by then.",
      "verb": "seen"
    },
    {
      "sentence": "Our neighbors will have cleaned the office by later.",
      "verb": "cleaned"
    },
    {
      "sentence": "The manager will have had breakfast by tomorrow.",
      "verb": "had"
    },
    {
      "sentence": "They will have repaired the roof by then.",
      "verb": "repaired"
    },
    {
      "sentence": "He will have called my parents by next week.",
      "verb": "called"
    },
    {
      "sentence": "By this evening, the team will have launched the software.",
      "verb": "launched"
    },
    {
      "sentence": "By next week, the children will have played volleyball.",
      "verb": "played"
    },
    {
      "sentence": "You will have emailed the boss by tonight.",
      "verb": "emailed"
    },
    {
      "sentence": "By in two days, we will have gotten the ticket.",
      "verb": "gotten"
    },
    {
      "sentence": "By next month, the manager will have emailed customer service.",
      "verb": "emailed"
    },
    {
      "sentence": "By in two days, the cat will have played with its owner.",
      "verb": "played"
    },
    {
      "sentence": "By next month, the cat will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "By next month, tom will have texted the manager.",
      "verb": "texted"
    },
    {
      "sentence": "We will have listened to jazz by next year.",
      "verb": "listened"
    },
    {
      "sentence": "You will have fixed the sink by this evening.",
      "verb": "fixed"
    },
    {
      "sentence": "She will have received the contract by then.",
      "verb": "received"
    },
    {
      "sentence": "They will have spoken to the team by then.",
      "verb": "spoken"
    },
    {
      "sentence": "Her sister will have drunk coffee by then.",
      "verb": "drunk"
    },
    {
      "sentence": "My brother will have washed the house by then.",
      "verb": "washed"
    },
    {
      "sentence": "The teacher will have created a plan by then.",
      "verb": "created"
    },
    {
      "sentence": "By this evening, john will have prepared the report.",
      "verb": "prepared"
    },
    {
      "sentence": "I will have seen an old friend by then.",
      "verb": "seen"
    },
    {
      "sentence": "By soon, they will have washed the garage.",
      "verb": "washed"
    },
    {
      "sentence": "By soon, the bird will have slept in the corner.",
      "verb": "slept"
    },
    {
      "sentence": "They will have built a plan by then.",
      "verb": "built"
    },
    {
      "sentence": "The dog will have run through the grass by next month.",
      "verb": "run"
    },
    {
      "sentence": "The teacher will have bought a present by then.",
      "verb": "bought"
    },
    {
      "sentence": "By in two days, i will have played the piano.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have created a house by then.",
      "verb": "created"
    },
    {
      "sentence": "We will have repaired the machine by this weekend.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, the cat will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "By this evening, we will have drunk tea.",
      "verb": "drunk"
    },
    {
      "sentence": "By next week, the students will have repaired the computer.",
      "verb": "repaired"
    },
    {
      "sentence": "Our neighbors will have organized the garage by then.",
      "verb": "organized"
    },
    {
      "sentence": "The cat will have run in circles by soon.",
      "verb": "run"
    },
    {
      "sentence": "My brother will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "Sarah will have painted a landscape by then.",
      "verb": "painted"
    },
    {
      "sentence": "By next month, we will have gone to the office.",
      "verb": "gone"
    },
    {
      "sentence": "My parents will have built a prototype by tonight.",
      "verb": "built"
    },
    {
      "sentence": "By soon, the company will have developed the update.",
      "verb": "developed"
    },
    {
      "sentence": "The students will have come to work by then.",
      "verb": "come"
    },
    {
      "sentence": "They will have baked a meal by next year.",
      "verb": "baked"
    },
    {
      "sentence": "The cat will have run in the garden by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "My friend will have texted the office by next month.",
      "verb": "texted"
    },
    {
      "sentence": "By next month, we will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "He will have fixed the sink by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By soon, tom will have drunk tea.",
      "verb": "drunk"
    },
    {
      "sentence": "John will have arrived to the hospital by tonight.",
      "verb": "arrived"
    },
    {
      "sentence": "By later, the bird will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "Her sister will have talked to the team by then.",
      "verb": "talked"
    },
    {
      "sentence": "By next month, sarah will have played soccer.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have prepared the task by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The dog will have played with the ball by then.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, the dog will have run around the house.",
      "verb": "run"
    },
    {
      "sentence": "Emma will have sketched a picture by next month.",
      "verb": "sketched"
    },
    {
      "sentence": "By later, you will have had a salad.",
      "verb": "had"
    },
    {
      "sentence": "The dog will have chased the mouse by then.",
      "verb": "chased"
    },
    {
      "sentence": "You will have drawn a design by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The dog will have played in the yard by next month.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have visited my friend by tonight.",
      "verb": "visited"
    },
    {
      "sentence": "By next week, she will have eaten a sandwich.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have eaten a salad by next month.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, they will have drunk juice.",
      "verb": "drunk"
    },
    {
      "sentence": "My friend will have listened to classical music by then.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have run across the field by later.",
      "verb": "run"
    },
    {
      "sentence": "Our neighbors will have seen the client by this evening.",
      "verb": "seen"
    },
    {
      "sentence": "My parents will have cooked rice by tomorrow.",
      "verb": "cooked"
    },
    {
      "sentence": "My friend will have played guitar by then.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have played in the yard by next week.",
      "verb": "played"
    },
    {
      "sentence": "By later, the cat will have slept in the corner.",
      "verb": "slept"
    },
    {
      "sentence": "By in two days, john will have drunk milk.",
      "verb": "drunk"
    },
    {
      "sentence": "My brother will have received the application by then.",
      "verb": "received"
    },
    {
      "sentence": "By next week, the dog will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "The bird will have played in the yard by next week.",
      "verb": "played"
    },
    {
      "sentence": "He will have studied science by then.",
      "verb": "studied"
    },
    {
      "sentence": "The manager will have texted the client by in two days.",
      "verb": "texted"
    },
    {
      "sentence": "Tom will have remembered the situation by then.",
      "verb": "remembered"
    },
    {
      "sentence": "Sarah will have gotten a new car by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The cat will have slept in the corner by next year.",
      "verb": "slept"
    },
    {
      "sentence": "He will have finished the proposal by this evening.",
      "verb": "finished"
    },
    {
      "sentence": "By in two days, we will have emailed customer service.",
      "verb": "emailed"
    },
    {
      "sentence": "Tom will have played guitar by this evening.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have had pasta by then.",
      "verb": "had"
    },
    {
      "sentence": "The cat will have chased birds in the garden by next year.",
      "verb": "chased"
    },
    {
      "sentence": "I will have eaten pasta by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have called the manager by then.",
      "verb": "called"
    },
    {
      "sentence": "By next month, my parents will have forgotten the future.",
      "verb": "forgotten"
    },
    {
      "sentence": "The bird will have run in the park by then.",
      "verb": "run"
    },
    {
      "sentence": "We will have watched a documentary by then.",
      "verb": "watched"
    },
    {
      "sentence": "They will have traveled to the library by next month.",
      "verb": "traveled"
    },
    {
      "sentence": "You will have submitted the project by next week.",
      "verb": "submitted"
    },
    {
      "sentence": "The bird will have played in the park by soon.",
      "verb": "played"
    },
    {
      "sentence": "By next week, the students will have played volleyball.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have slept in the sun by in two days.",
      "verb": "slept"
    },
    {
      "sentence": "By soon, the cat will have slept on the bed.",
      "verb": "slept"
    },
    {
      "sentence": "Emma will have had pizza by next year.",
      "verb": "had"
    },
    {
      "sentence": "By next month, he will have fixed the sink.",
      "verb": "fixed"
    },
    {
      "sentence": "The dog will have played in the garden by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By next month, she will have prepared the project.",
      "verb": "prepared"
    },
    {
      "sentence": "The teacher will have seen an old friend by then.",
      "verb": "seen"
    },
    {
      "sentence": "By this weekend, we will have forgotten the birthday party.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this evening, the children will have flown to the library.",
      "verb": "flown"
    },
    {
      "sentence": "My parents will have remembered the birthday party by next month.",
      "verb": "remembered"
    },
    {
      "sentence": "We will have started the application by tomorrow.",
      "verb": "started"
    },
    {
      "sentence": "By next month, our neighbors will have organized the garage.",
      "verb": "organized"
    },
    {
      "sentence": "The students will have sold some clothes by later.",
      "verb": "sold"
    },
    {
      "sentence": "The teacher will have found a new car by next week.",
      "verb": "found"
    },
    {
      "sentence": "By in two days, tom will have thought about the situation.",
      "verb": "thought"
    },
    {
      "sentence": "My brother will have walked to the office by in two days.",
      "verb": "walked"
    },
    {
      "sentence": "By next month, sarah will have drawn a landscape.",
      "verb": "drawn"
    },
    {
      "sentence": "My parents will have had pizza by then.",
      "verb": "had"
    },
    {
      "sentence": "The cat will have caught the frisbee by then.",
      "verb": "caught"
    },
    {
      "sentence": "The cat will have slept in the sun by tonight.",
      "verb": "slept"
    },
    {
      "sentence": "The students will have left to school by in two days.",
      "verb": "left"
    },
    {
      "sentence": "By this evening, the bird will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "By soon, the manager will have chosen a book.",
      "verb": "chosen"
    },
    {
      "sentence": "The cat will have caught the mouse by later.",
      "verb": "caught"
    },
    {
      "sentence": "My parents will have drawn the wall by tomorrow.",
      "verb": "drawn"
    },
    {
      "sentence": "By this weekend, the dog will have eaten a treat.",
      "verb": "eaten"
    },
    {
      "sentence": "He will have prepared the report by then.",
      "verb": "prepared"
    },
    {
      "sentence": "Her sister will have texted my family by next year.",
      "verb": "texted"
    },
    {
      "sentence": "The dog will have eaten the leftover food by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have created a prototype by then.",
      "verb": "created"
    },
    {
      "sentence": "You will have drawn a design by next year.",
      "verb": "drawn"
    },
    {
      "sentence": "Our neighbors will have seen my family by then.",
      "verb": "seen"
    },
    {
      "sentence": "The bird will have chased the toy by next month.",
      "verb": "chased"
    },
    {
      "sentence": "My friend will have designed a house by later.",
      "verb": "designed"
    },
    {
      "sentence": "By soon, john will have painted the wall.",
      "verb": "painted"
    },
    {
      "sentence": "The cat will have caught the toy by tomorrow.",
      "verb": "caught"
    },
    {
      "sentence": "By next year, the dog will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have tidied the room by this weekend.",
      "verb": "tidied"
    },
    {
      "sentence": "Sarah will have listened to an audiobook by later.",
      "verb": "listened"
    },
    {
      "sentence": "The team will have completed the update by then.",
      "verb": "completed"
    },
    {
      "sentence": "My parents will have sketched an illustration by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By soon, her sister will have repaired the machine.",
      "verb": "repaired"
    },
    {
      "sentence": "The students will have written the presentation by this evening.",
      "verb": "written"
    },
    {
      "sentence": "The team will have announced the deal by then.",
      "verb": "announced"
    },
    {
      "sentence": "By this weekend, the bird will have eaten some food.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "He will have painted a picture by then.",
      "verb": "painted"
    },
    {
      "sentence": "John will have sketched an illustration by in two days.",
      "verb": "sketched"
    },
    {
      "sentence": "My friend will have played guitar by this evening.",
      "verb": "played"
    },
    {
      "sentence": "You will have visited my grandmother by then.",
      "verb": "visited"
    },
    {
      "sentence": "By in two days, the children will have cooked dinner.",
      "verb": "cooked"
    },
    {
      "sentence": "The bird will have run in the yard by then.",
      "verb": "run"
    },
    {
      "sentence": "By soon, the bird will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "By tonight, you will have eaten soup.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, john will have thought about the birthday party.",
      "verb": "thought"
    },
    {
      "sentence": "Sarah will have bought the phone by later.",
      "verb": "bought"
    },
    {
      "sentence": "By next week, sarah will have drunk juice.",
      "verb": "drunk"
    },
    {
      "sentence": "She will have repaired the machine by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The manager will have learned mathematics by then.",
      "verb": "learned"
    },
    {
      "sentence": "By soon, the teacher will have met the teacher.",
      "verb": "met"
    },
    {
      "sentence": "The cat will have eaten some food by this evening.",
      "verb": "eaten"
    },
    {
      "sentence": "The bird will have eaten the leftover food by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "The dog will have eaten its breakfast by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The dog will have caught the toy by then.",
      "verb": "caught"
    },
    {
      "sentence": "You will have repaired the machine by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By soon, they will have taught Spanish.",
      "verb": "taught"
    },
    {
      "sentence": "The children will have prepared pasta by then.",
      "verb": "prepared"
    },
    {
      "sentence": "Tom will have seen my friend by tonight.",
      "verb": "seen"
    },
    {
      "sentence": "You will have chosen flowers by tomorrow.",
      "verb": "chosen"
    },
    {
      "sentence": "I will have watched football by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next month, my friend will have sold groceries.",
      "verb": "sold"
    },
    {
      "sentence": "They will have listened to a podcast by then.",
      "verb": "listened"
    },
    {
      "sentence": "By soon, the cat will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "By next year, the dog will have run through the grass.",
      "verb": "run"
    },
    {
      "sentence": "The bird will have chased birds in the garden by this weekend.",
      "verb": "chased"
    },
    {
      "sentence": "The bird will have chased the toy by next week.",
      "verb": "chased"
    },
    {
      "sentence": "By soon, the dog will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "The children will have sent the presentation by then.",
      "verb": "sent"
    },
    {
      "sentence": "The cat will have eaten its food by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, they will have completed the task.",
      "verb": "completed"
    },
    {
      "sentence": "The teacher will have sent the letter by then.",
      "verb": "sent"
    },
    {
      "sentence": "The teacher will have drunk milk by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "The cat will have slept under the table by later.",
      "verb": "slept"
    },
    {
      "sentence": "By later, the students will have submitted the presentation.",
      "verb": "submitted"
    },
    {
      "sentence": "The company will have completed the results by next year.",
      "verb": "completed"
    },
    {
      "sentence": "By this evening, you will have designed a model.",
      "verb": "designed"
    },
    {
      "sentence": "By soon, the bird will have played with the other pets.",
      "verb": "played"
    },
    {
      "sentence": "By soon, the children will have repaired the roof.",
      "verb": "repaired"
    },
    {
      "sentence": "By next year, the manager will have thought about the situation.",
      "verb": "thought"
    },
    {
      "sentence": "By next year, the cat will have chased the mouse.",
      "verb": "chased"
    },
    {
      "sentence": "Our neighbors will have seen my friend by then.",
      "verb": "seen"
    },
    {
      "sentence": "By soon, he will have decided on the trip.",
      "verb": "decided"
    },
    {
      "sentence": "By next month, the teacher will have listened to the lecture.",
      "verb": "listened"
    },
    {
      "sentence": "The dog will have slept on the bed by this evening.",
      "verb": "slept"
    },
    {
      "sentence": "Emma will have talked to the team by then.",
      "verb": "talked"
    },
    {
      "sentence": "By later, the dog will have eaten quickly.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, the dog will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "The bird will have chased the ball by tomorrow.",
      "verb": "chased"
    },
    {
      "sentence": "The manager will have designed a presentation by next month.",
      "verb": "designed"
    },
    {
      "sentence": "By next week, my friend will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "By this evening, tom will have watched the news.",
      "verb": "watched"
    },
    {
      "sentence": "John will have prepared cookies by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The dog will have caught the frisbee by tomorrow.",
      "verb": "caught"
    },
    {
      "sentence": "The teacher will have submitted the assignment by soon.",
      "verb": "submitted"
    },
    {
      "sentence": "He will have come to the beach by then.",
      "verb": "come"
    },
    {
      "sentence": "The bird will have caught the frisbee by then.",
      "verb": "caught"
    },
    {
      "sentence": "I will have forgotten the meeting by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this evening, john will have listened to a song.",
      "verb": "listened"
    },
    {
      "sentence": "John will have eaten pizza by then.",
      "verb": "eaten"
    },
    {
      "sentence": "He will have drunk coffee by next month.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, our neighbors will have listened to music.",
      "verb": "listened"
    },
    {
      "sentence": "You will have prepared lunch by next week.",
      "verb": "prepared"
    },
    {
      "sentence": "The manager will have met the teacher by then.",
      "verb": "met"
    },
    {
      "sentence": "The bird will have run in the park by next month.",
      "verb": "run"
    },
    {
      "sentence": "The cat will have eaten its dinner by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Emma will have played football by then.",
      "verb": "played"
    },
    {
      "sentence": "They will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "The students will have played volleyball by then.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have found a new car by this weekend.",
      "verb": "found"
    },
    {
      "sentence": "Emma will have sold a laptop by tonight.",
      "verb": "sold"
    },
    {
      "sentence": "By later, he will have spoken to my family.",
      "verb": "spoken"
    },
    {
      "sentence": "Tom will have called the manager by then.",
      "verb": "called"
    },
    {
      "sentence": "By tonight, you will have sold a new house.",
      "verb": "sold"
    },
    {
      "sentence": "The students will have contacted the teacher by in two days.",
      "verb": "contacted"
    },
    {
      "sentence": "He will have made rice by then.",
      "verb": "made"
    },
    {
      "sentence": "I will have spoken with the team by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The teacher will have talked to my family by then.",
      "verb": "talked"
    },
    {
      "sentence": "Sarah will have listened to a song by then.",
      "verb": "listened"
    },
    {
      "sentence": "By next month, the students will have created a project.",
      "verb": "created"
    },
    {
      "sentence": "By tonight, you will have studied the material.",
      "verb": "studied"
    },
    {
      "sentence": "The students will have had a sandwich by then.",
      "verb": "had"
    },
    {
      "sentence": "The students will have designed a presentation by then.",
      "verb": "designed"
    },
    {
      "sentence": "My friend will have repaired the machine by then.",
      "verb": "repaired"
    },
    {
      "sentence": "John will have listened to the news by later.",
      "verb": "listened"
    },
    {
      "sentence": "The teacher will have baked a salad by then.",
      "verb": "baked"
    },
    {
      "sentence": "The cat will have run in the park by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "He will have decided on the trip by then.",
      "verb": "decided"
    },
    {
      "sentence": "By this weekend, she will have sketched a diagram.",
      "verb": "sketched"
    },
    {
      "sentence": "By later, the manager will have remembered the options.",
      "verb": "remembered"
    },
    {
      "sentence": "By tomorrow, tom will have listened to classical music.",
      "verb": "listened"
    },
    {
      "sentence": "By next week, they will have played football.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have drunk a smoothie by next week.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have caught a bird by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "I will have submitted the document by next week.",
      "verb": "submitted"
    },
    {
      "sentence": "The children will have designed an app by then.",
      "verb": "designed"
    },
    {
      "sentence": "By tonight, the dog will have played with its owner.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, john will have driven to the library.",
      "verb": "driven"
    },
    {
      "sentence": "Sarah will have talked to the neighbors by then.",
      "verb": "talked"
    },
    {
      "sentence": "By tonight, the cat will have played in the park.",
      "verb": "played"
    },
    {
      "sentence": "He will have seen the neighbors by then.",
      "verb": "seen"
    },
    {
      "sentence": "By tomorrow, the bird will have caught a treat.",
      "verb": "caught"
    },
    {
      "sentence": "The dog will have played with the ball by next year.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, the manager will have cleaned the room.",
      "verb": "cleaned"
    },
    {
      "sentence": "The cat will have slept by the window by tomorrow.",
      "verb": "slept"
    },
    {
      "sentence": "By this weekend, the dog will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have had a salad by tomorrow.",
      "verb": "had"
    },
    {
      "sentence": "The team will have completed the software by this weekend.",
      "verb": "completed"
    },
    {
      "sentence": "By this weekend, you will have played soccer.",
      "verb": "played"
    },
    {
      "sentence": "We will have run downtown by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "My friend will have spoken with my parents by then.",
      "verb": "spoken"
    },
    {
      "sentence": "He will have remembered the event by then.",
      "verb": "remembered"
    },
    {
      "sentence": "Sarah will have received the letter by next year.",
      "verb": "received"
    },
    {
      "sentence": "My brother will have listened to the news by tomorrow.",
      "verb": "listened"
    },
    {
      "sentence": "He will have texted customer service by next week.",
      "verb": "texted"
    },
    {
      "sentence": "My friend will have prepared a meal by then.",
      "verb": "prepared"
    },
    {
      "sentence": "John will have met my family by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "The team will have launched the deal by then.",
      "verb": "launched"
    },
    {
      "sentence": "By tomorrow, tom will have eaten a snack.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, i will have watched the match.",
      "verb": "watched"
    },
    {
      "sentence": "You will have fixed the machine by next month.",
      "verb": "fixed"
    },
    {
      "sentence": "The cat will have played in the park by then.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have written the task by then.",
      "verb": "written"
    },
    {
      "sentence": "The company will have won the update by then.",
      "verb": "won"
    },
    {
      "sentence": "By next month, john will have gone to the market.",
      "verb": "gone"
    },
    {
      "sentence": "By tonight, the company will have launched the project.",
      "verb": "launched"
    },
    {
      "sentence": "The cat will have caught a treat by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "The students will have prepared a cake by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The students will have played video games by then.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, you will have played volleyball.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have slept in the sun by next week.",
      "verb": "slept"
    },
    {
      "sentence": "Our neighbors will have seen an old friend by soon.",
      "verb": "seen"
    },
    {
      "sentence": "By soon, i will have gone to work.",
      "verb": "gone"
    },
    {
      "sentence": "The bird will have slept in the sun by then.",
      "verb": "slept"
    },
    {
      "sentence": "The bird will have slept all day by then.",
      "verb": "slept"
    },
    {
      "sentence": "I will have fixed the sink by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By later, the team will have launched a new product.",
      "verb": "launched"
    },
    {
      "sentence": "By tonight, tom will have drawn a picture.",
      "verb": "drawn"
    },
    {
      "sentence": "By next week, the bird will have played with the other pets.",
      "verb": "played"
    },
    {
      "sentence": "I will have taught for the exam by then.",
      "verb": "taught"
    },
    {
      "sentence": "The manager will have taught history by next week.",
      "verb": "taught"
    },
    {
      "sentence": "The teacher will have considered the decision by next year.",
      "verb": "considered"
    },
    {
      "sentence": "The dog will have eaten its food by next week.",
      "verb": "eaten"
    },
    {
      "sentence": "The bird will have slept under the table by then.",
      "verb": "slept"
    },
    {
      "sentence": "John will have drunk water by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, the dog will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "Emma will have gotten a present by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By tomorrow, the cat will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "By next month, my brother will have arrived to school.",
      "verb": "arrived"
    },
    {
      "sentence": "He will have drunk a smoothie by this evening.",
      "verb": "drunk"
    },
    {
      "sentence": "My brother will have found groceries by tomorrow.",
      "verb": "found"
    },
    {
      "sentence": "The students will have spoken with the team by this evening.",
      "verb": "spoken"
    },
    {
      "sentence": "The company will have released the software by then.",
      "verb": "released"
    },
    {
      "sentence": "By soon, my brother will have met the neighbors.",
      "verb": "met"
    },
    {
      "sentence": "By this evening, my brother will have repaired the door.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, the dog will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, the bird will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "By in two days, the teacher will have started the assignment.",
      "verb": "started"
    },
    {
      "sentence": "The bird will have chased the other pets by next month.",
      "verb": "chased"
    },
    {
      "sentence": "The students will have talked to a colleague by later.",
      "verb": "talked"
    },
    {
      "sentence": "My friend will have talked to the manager by then.",
      "verb": "talked"
    },
    {
      "sentence": "The teacher will have repaired the bike by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By this evening, john will have repaired the roof.",
      "verb": "repaired"
    },
    {
      "sentence": "My parents will have cleaned the dishes by tomorrow.",
      "verb": "cleaned"
    },
    {
      "sentence": "I will have prepared a salad by soon.",
      "verb": "prepared"
    },
    {
      "sentence": "Sarah will have fixed the machine by later.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have bought a book by then.",
      "verb": "bought"
    },
    {
      "sentence": "She will have gotten the keys by soon.",
      "verb": "gotten"
    },
    {
      "sentence": "You will have eaten lunch by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By tomorrow, the teacher will have had a snack.",
      "verb": "had"
    },
    {
      "sentence": "The manager will have built a house by tomorrow.",
      "verb": "built"
    },
    {
      "sentence": "Tom will have read English by tonight.",
      "verb": "read"
    },
    {
      "sentence": "My parents will have had some fruit by tomorrow.",
      "verb": "had"
    },
    {
      "sentence": "By next month, the students will have played football.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have run across the field by soon.",
      "verb": "run"
    },
    {
      "sentence": "By tonight, john will have thought about the options.",
      "verb": "thought"
    },
    {
      "sentence": "By next year, they will have gotten a laptop.",
      "verb": "gotten"
    },
    {
      "sentence": "My brother will have found groceries by then.",
      "verb": "found"
    },
    {
      "sentence": "By soon, sarah will have gotten a present.",
      "verb": "gotten"
    },
    {
      "sentence": "By tonight, we will have organized the clothes.",
      "verb": "organized"
    },
    {
      "sentence": "By this evening, emma will have organized the house.",
      "verb": "organized"
    },
    {
      "sentence": "By later, my parents will have baked a cake.",
      "verb": "baked"
    },
    {
      "sentence": "The students will have decided on the meeting by then.",
      "verb": "decided"
    },
    {
      "sentence": "By next month, the cat will have played with the toy.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have received the presentation by then.",
      "verb": "received"
    },
    {
      "sentence": "My parents will have washed the garage by next week.",
      "verb": "washed"
    },
    {
      "sentence": "They will have cooked dinner by then.",
      "verb": "cooked"
    },
    {
      "sentence": "The teacher will have sketched a picture by then.",
      "verb": "sketched"
    },
    {
      "sentence": "The teacher will have baked cookies by then.",
      "verb": "baked"
    },
    {
      "sentence": "Emma will have eaten breakfast by next month.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have sketched a portrait by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By soon, her sister will have drunk water.",
      "verb": "drunk"
    },
    {
      "sentence": "I will have listened to jazz by next month.",
      "verb": "listened"
    },
    {
      "sentence": "Tom will have spoken to the manager by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The dog will have eaten its dinner by tomorrow.",
      "verb": "eaten"
    },
    {
      "sentence": "Tom will have built a model by this weekend.",
      "verb": "built"
    },
    {
      "sentence": "My friend will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "You will have washed the car by tomorrow.",
      "verb": "washed"
    },
    {
      "sentence": "By later, the children will have watched a documentary.",
      "verb": "watched"
    },
    {
      "sentence": "My parents will have designed a presentation by next year.",
      "verb": "designed"
    },
    {
      "sentence": "The bird will have run in the garden by next month.",
      "verb": "run"
    },
    {
      "sentence": "By soon, the team will have developed the project.",
      "verb": "developed"
    },
    {
      "sentence": "They will have played soccer by then.",
      "verb": "played"
    },
    {
      "sentence": "The children will have met the neighbors by then.",
      "verb": "met"
    },
    {
      "sentence": "We will have planned the options by this weekend.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, the students will have considered the decision.",
      "verb": "considered"
    },
    {
      "sentence": "The bird will have run through the grass by later.",
      "verb": "run"
    },
    {
      "sentence": "He will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have drunk water by in two days.",
      "verb": "drunk"
    },
    {
      "sentence": "By later, the bird will have chased the squirrel.",
      "verb": "chased"
    },
    {
      "sentence": "They will have written the assignment by in two days.",
      "verb": "written"
    },
    {
      "sentence": "Emma will have sketched the wall by tonight.",
      "verb": "sketched"
    },
    {
      "sentence": "The teacher will have played video games by then.",
      "verb": "played"
    },
    {
      "sentence": "John will have played the piano by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By next month, the students will have organized the bathroom.",
      "verb": "organized"
    },
    {
      "sentence": "Her sister will have played golf by then.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, the teacher will have understood history.",
      "verb": "understood"
    },
    {
      "sentence": "The students will have texted the office by then.",
      "verb": "texted"
    },
    {
      "sentence": "By next week, john will have painted a portrait.",
      "verb": "painted"
    },
    {
      "sentence": "By next week, you will have left to the bank.",
      "verb": "left"
    },
    {
      "sentence": "Emma will have forgotten the decision by soon.",
      "verb": "forgotten"
    },
    {
      "sentence": "The cat will have played in the garden by next year.",
      "verb": "played"
    },
    {
      "sentence": "The teacher will have baked rice by then.",
      "verb": "baked"
    },
    {
      "sentence": "By tomorrow, sarah will have texted my friend.",
      "verb": "texted"
    },
    {
      "sentence": "By next week, the cat will have chased birds in the garden.",
      "verb": "chased"
    },
    {
      "sentence": "The cat will have slept on the couch by soon.",
      "verb": "slept"
    },
    {
      "sentence": "The dog will have played with the toy by then.",
      "verb": "played"
    },
    {
      "sentence": "Her sister will have had a meal by then.",
      "verb": "had"
    },
    {
      "sentence": "The manager will have texted the office by then.",
      "verb": "texted"
    },
    {
      "sentence": "By soon, she will have designed a presentation.",
      "verb": "designed"
    },
    {
      "sentence": "By this evening, you will have sketched a picture.",
      "verb": "sketched"
    },
    {
      "sentence": "The teacher will have watched the news by then.",
      "verb": "watched"
    },
    {
      "sentence": "Her sister will have spoken with my family by then.",
      "verb": "spoken"
    },
    {
      "sentence": "Tom will have thought about the meeting by tomorrow.",
      "verb": "thought"
    },
    {
      "sentence": "By soon, the cat will have caught a treat.",
      "verb": "caught"
    },
    {
      "sentence": "The cat will have chased the ball by next year.",
      "verb": "chased"
    },
    {
      "sentence": "My friend will have talked to my family by then.",
      "verb": "talked"
    },
    {
      "sentence": "They will have decided on the decision by then.",
      "verb": "decided"
    },
    {
      "sentence": "John will have designed a house by next year.",
      "verb": "designed"
    },
    {
      "sentence": "By soon, the bird will have chased its tail.",
      "verb": "chased"
    },
    {
      "sentence": "The students will have taught history by then.",
      "verb": "taught"
    },
    {
      "sentence": "By tomorrow, the manager will have eaten lunch.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have traveled to the airport by tomorrow.",
      "verb": "traveled"
    },
    {
      "sentence": "The teacher will have made breakfast by then.",
      "verb": "made"
    },
    {
      "sentence": "Our neighbors will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "The children will have fixed the bike by then.",
      "verb": "fixed"
    },
    {
      "sentence": "My parents will have had lunch by next year.",
      "verb": "had"
    },
    {
      "sentence": "Our neighbors will have contacted my family by tomorrow.",
      "verb": "contacted"
    },
    {
      "sentence": "By tonight, my friend will have baked a salad.",
      "verb": "baked"
    },
    {
      "sentence": "By this evening, you will have watched a series.",
      "verb": "watched"
    },
    {
      "sentence": "By soon, emma will have had dinner.",
      "verb": "had"
    },
    {
      "sentence": "Sarah will have chosen the ticket by then.",
      "verb": "chosen"
    },
    {
      "sentence": "They will have drunk water by this evening.",
      "verb": "drunk"
    },
    {
      "sentence": "By this weekend, we will have visited the neighbors.",
      "verb": "visited"
    },
    {
      "sentence": "Our neighbors will have forgotten the event by next month.",
      "verb": "forgotten"
    },
    {
      "sentence": "My friend will have run to work by then.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have considered the event by then.",
      "verb": "considered"
    },
    {
      "sentence": "John will have organized the clothes by in two days.",
      "verb": "organized"
    },
    {
      "sentence": "The cat will have run around the house by next year.",
      "verb": "run"
    },
    {
      "sentence": "By later, i will have walked to the beach.",
      "verb": "walked"
    },
    {
      "sentence": "The students will have prepared dinner by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The company will have developed the contract by then.",
      "verb": "developed"
    },
    {
      "sentence": "By this weekend, her sister will have played volleyball.",
      "verb": "played"
    },
    {
      "sentence": "I will have drunk coffee by this weekend.",
      "verb": "drunk"
    },
    {
      "sentence": "The students will have come to the bank by then.",
      "verb": "come"
    },
    {
      "sentence": "Sarah will have texted the manager by tomorrow.",
      "verb": "texted"
    },
    {
      "sentence": "By next week, i will have watched the news.",
      "verb": "watched"
    },
    {
      "sentence": "The children will have drunk coffee by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By this evening, my brother will have seen my parents.",
      "verb": "seen"
    },
    {
      "sentence": "Tom will have sketched a picture by next month.",
      "verb": "sketched"
    },
    {
      "sentence": "Tom will have completed the email by this weekend.",
      "verb": "completed"
    },
    {
      "sentence": "By next month, her sister will have thought about the problem.",
      "verb": "thought"
    },
    {
      "sentence": "By next month, her sister will have studied Spanish.",
      "verb": "studied"
    },
    {
      "sentence": "By next week, we will have repaired the fence.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, the bird will have slept in the corner.",
      "verb": "slept"
    },
    {
      "sentence": "The dog will have slept on the couch by next week.",
      "verb": "slept"
    },
    {
      "sentence": "The dog will have slept by the window by next week.",
      "verb": "slept"
    },
    {
      "sentence": "My brother will have listened to the news by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "By tonight, john will have tidied the car.",
      "verb": "tidied"
    },
    {
      "sentence": "By next week, they will have returned to school.",
      "verb": "returned"
    },
    {
      "sentence": "By this weekend, the manager will have fixed the door.",
      "verb": "fixed"
    },
    {
      "sentence": "By later, her sister will have prepared dinner.",
      "verb": "prepared"
    },
    {
      "sentence": "My parents will have designed a project by soon.",
      "verb": "designed"
    },
    {
      "sentence": "By soon, the bird will have eaten some food.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have sketched the wall by this weekend.",
      "verb": "sketched"
    },
    {
      "sentence": "He will have eaten soup by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have started the email by then.",
      "verb": "started"
    },
    {
      "sentence": "The bird will have caught a treat by this evening.",
      "verb": "caught"
    },
    {
      "sentence": "The company will have completed the update by then.",
      "verb": "completed"
    },
    {
      "sentence": "The bird will have caught the ball by next year.",
      "verb": "caught"
    },
    {
      "sentence": "Her sister will have met my parents by in two days.",
      "verb": "met"
    },
    {
      "sentence": "By this evening, sarah will have created a presentation.",
      "verb": "created"
    },
    {
      "sentence": "They will have texted my family by next week.",
      "verb": "texted"
    },
    {
      "sentence": "My parents will have repaired the door by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, he will have created a presentation.",
      "verb": "created"
    },
    {
      "sentence": "Sarah will have drunk a smoothie by later.",
      "verb": "drunk"
    },
    {
      "sentence": "By this weekend, she will have submitted the document.",
      "verb": "submitted"
    },
    {
      "sentence": "By tomorrow, she will have built a model.",
      "verb": "built"
    },
    {
      "sentence": "By soon, the students will have visited my family.",
      "verb": "visited"
    },
    {
      "sentence": "By next month, the dog will have slept on the bed.",
      "verb": "slept"
    },
    {
      "sentence": "The team will have announced the update by later.",
      "verb": "announced"
    },
    {
      "sentence": "By later, the dog will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "Tom will have listened to an audiobook by next year.",
      "verb": "listened"
    },
    {
      "sentence": "I will have baked a salad by later.",
      "verb": "baked"
    },
    {
      "sentence": "The cat will have played in the yard by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "By later, my brother will have remembered the vacation.",
      "verb": "remembered"
    },
    {
      "sentence": "The students will have fixed the machine by in two days.",
      "verb": "fixed"
    },
    {
      "sentence": "The bird will have caught a butterfly by then.",
      "verb": "caught"
    },
    {
      "sentence": "You will have read the chapter by next month.",
      "verb": "read"
    },
    {
      "sentence": "They will have played the piano by this evening.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have run through the grass by then.",
      "verb": "run"
    },
    {
      "sentence": "By tonight, the manager will have bought a new house.",
      "verb": "bought"
    },
    {
      "sentence": "The cat will have played with the other pets by then.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, they will have played video games.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have chased its tail by then.",
      "verb": "chased"
    },
    {
      "sentence": "The team will have released the results by then.",
      "verb": "released"
    },
    {
      "sentence": "My brother will have fixed the door by tonight.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have played tennis by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The company will have developed the results by then.",
      "verb": "developed"
    },
    {
      "sentence": "The dog will have run in the yard by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "By tonight, our neighbors will have texted the office.",
      "verb": "texted"
    },
    {
      "sentence": "My brother will have had lunch by then.",
      "verb": "had"
    },
    {
      "sentence": "My brother will have had some fruit by soon.",
      "verb": "had"
    },
    {
      "sentence": "By next week, i will have arrived to the office.",
      "verb": "arrived"
    },
    {
      "sentence": "The company will have developed the software by later.",
      "verb": "developed"
    },
    {
      "sentence": "My parents will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, my brother will have fixed the door.",
      "verb": "fixed"
    },
    {
      "sentence": "By this weekend, the bird will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "The dog will have run in circles by then.",
      "verb": "run"
    },
    {
      "sentence": "By tomorrow, tom will have contacted my friend.",
      "verb": "contacted"
    },
    {
      "sentence": "By next week, our neighbors will have texted the teacher.",
      "verb": "texted"
    },
    {
      "sentence": "The children will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "By later, my parents will have written the document.",
      "verb": "written"
    },
    {
      "sentence": "My friend will have painted an illustration by then.",
      "verb": "painted"
    },
    {
      "sentence": "By tomorrow, tom will have built a project.",
      "verb": "built"
    },
    {
      "sentence": "The cat will have eaten its dinner by next week.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, her sister will have had breakfast.",
      "verb": "had"
    },
    {
      "sentence": "The children will have eaten a sandwich by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, sarah will have visited the manager.",
      "verb": "visited"
    },
    {
      "sentence": "Emma will have met my family by then.",
      "verb": "met"
    },
    {
      "sentence": "The dog will have slept on the bed by this weekend.",
      "verb": "slept"
    },
    {
      "sentence": "He will have sketched a diagram by then.",
      "verb": "sketched"
    },
    {
      "sentence": "The teacher will have met the neighbors by next week.",
      "verb": "met"
    },
    {
      "sentence": "Sarah will have gone to the gym by then.",
      "verb": "gone"
    },
    {
      "sentence": "By next year, my brother will have cleaned the room.",
      "verb": "cleaned"
    },
    {
      "sentence": "By this weekend, she will have called my parents.",
      "verb": "called"
    },
    {
      "sentence": "The teacher will have had dinner by tomorrow.",
      "verb": "had"
    },
    {
      "sentence": "By this weekend, the dog will have run in the park.",
      "verb": "run"
    },
    {
      "sentence": "My friend will have watched a series by then.",
      "verb": "watched"
    },
    {
      "sentence": "John will have seen my parents by next month.",
      "verb": "seen"
    },
    {
      "sentence": "The bird will have eaten its dinner by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The cat will have chased the mouse by tonight.",
      "verb": "chased"
    },
    {
      "sentence": "I will have listened to an audiobook by later.",
      "verb": "listened"
    },
    {
      "sentence": "Emma will have decided on the vacation by soon.",
      "verb": "decided"
    },
    {
      "sentence": "Our neighbors will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "She will have repaired the fence by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, the cat will have slept in the corner.",
      "verb": "slept"
    },
    {
      "sentence": "By this weekend, the cat will have played with its owner.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, he will have given a new house.",
      "verb": "given"
    },
    {
      "sentence": "You will have eaten pizza by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The students will have taught English by then.",
      "verb": "taught"
    },
    {
      "sentence": "By tonight, the cat will have eaten its breakfast.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, the bird will have eaten its food.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, you will have spoken to my friend.",
      "verb": "spoken"
    },
    {
      "sentence": "By next month, the team will have completed the contract.",
      "verb": "completed"
    },
    {
      "sentence": "I will have drunk a smoothie by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By soon, my brother will have eaten a meal.",
      "verb": "eaten"
    },
    {
      "sentence": "The cat will have slept on the bed by then.",
      "verb": "slept"
    },
    {
      "sentence": "You will have texted the team by later.",
      "verb": "texted"
    },
    {
      "sentence": "The teacher will have run downtown by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "By soon, the bird will have chased the squirrel.",
      "verb": "chased"
    },
    {
      "sentence": "By this weekend, you will have fixed the door.",
      "verb": "fixed"
    },
    {
      "sentence": "She will have come to the airport by this evening.",
      "verb": "come"
    },
    {
      "sentence": "By tomorrow, i will have forgotten the event.",
      "verb": "forgotten"
    },
    {
      "sentence": "The students will have tidied the clothes by this evening.",
      "verb": "tidied"
    },
    {
      "sentence": "The company will have completed the championship by next year.",
      "verb": "completed"
    },
    {
      "sentence": "Tom will have prepared the email by tomorrow.",
      "verb": "prepared"
    },
    {
      "sentence": "The cat will have played with the toy by then.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, my parents will have run to the bank.",
      "verb": "run"
    },
    {
      "sentence": "My brother will have watched the game by then.",
      "verb": "watched"
    },
    {
      "sentence": "By later, i will have baked soup.",
      "verb": "baked"
    },
    {
      "sentence": "By next year, they will have given some clothes.",
      "verb": "given"
    },
    {
      "sentence": "The manager will have remembered the options by then.",
      "verb": "remembered"
    },
    {
      "sentence": "My brother will have painted the wall by next week.",
      "verb": "painted"
    },
    {
      "sentence": "By this evening, her sister will have baked a meal.",
      "verb": "baked"
    },
    {
      "sentence": "By next year, you will have run to work.",
      "verb": "run"
    },
    {
      "sentence": "The students will have read mathematics by this evening.",
      "verb": "read"
    },
    {
      "sentence": "Her sister will have emailed the manager by later.",
      "verb": "emailed"
    },
    {
      "sentence": "By next year, i will have cooked soup.",
      "verb": "cooked"
    },
    {
      "sentence": "The teacher will have repaired the bike by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, you will have drunk milk.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, the students will have painted a poster.",
      "verb": "painted"
    },
    {
      "sentence": "My friend will have received the project by later.",
      "verb": "received"
    },
    {
      "sentence": "The company will have launched the contract by next week.",
      "verb": "launched"
    },
    {
      "sentence": "The cat will have slept all day by next week.",
      "verb": "slept"
    },
    {
      "sentence": "Her sister will have received the contract by next week.",
      "verb": "received"
    },
    {
      "sentence": "The children will have studied French by then.",
      "verb": "studied"
    },
    {
      "sentence": "They will have completed the presentation by then.",
      "verb": "completed"
    },
    {
      "sentence": "By tonight, the company will have released the championship.",
      "verb": "released"
    },
    {
      "sentence": "The bird will have eaten its food by tomorrow.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, the teacher will have built a plan.",
      "verb": "built"
    },
    {
      "sentence": "John will have played golf by in two days.",
      "verb": "played"
    },
    {
      "sentence": "The children will have eaten lunch by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, the bird will have eaten its food.",
      "verb": "eaten"
    },
    {
      "sentence": "John will have watched a series by then.",
      "verb": "watched"
    },
    {
      "sentence": "The manager will have created an app by tomorrow.",
      "verb": "created"
    },
    {
      "sentence": "My friend will have watched the game by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, sarah will have practiced the textbook.",
      "verb": "practiced"
    },
    {
      "sentence": "By next month, the company will have developed the deal.",
      "verb": "developed"
    },
    {
      "sentence": "By this evening, my friend will have watched football.",
      "verb": "watched"
    },
    {
      "sentence": "The company will have launched the deal by next week.",
      "verb": "launched"
    },
    {
      "sentence": "The cat will have played in the garden by later.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, they will have arrived to work.",
      "verb": "arrived"
    },
    {
      "sentence": "Her sister will have driven to the market by then.",
      "verb": "driven"
    },
    {
      "sentence": "The cat will have played with its owner by then.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have taught the material by next month.",
      "verb": "taught"
    },
    {
      "sentence": "John will have made dinner by this weekend.",
      "verb": "made"
    },
    {
      "sentence": "By this evening, he will have eaten soup.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, sarah will have seen the client.",
      "verb": "seen"
    },
    {
      "sentence": "The dog will have run around the house by then.",
      "verb": "run"
    },
    {
      "sentence": "By soon, john will have seen the client.",
      "verb": "seen"
    },
    {
      "sentence": "By this evening, the team will have launched the deal.",
      "verb": "launched"
    },
    {
      "sentence": "By soon, the cat will have chased the squirrel.",
      "verb": "chased"
    },
    {
      "sentence": "By next week, they will have made a cake.",
      "verb": "made"
    },
    {
      "sentence": "They will have sketched a picture by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By tonight, my parents will have played tennis.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have seen my parents by this evening.",
      "verb": "seen"
    },
    {
      "sentence": "He will have learned mathematics by tomorrow.",
      "verb": "learned"
    },
    {
      "sentence": "My parents will have received the assignment by then.",
      "verb": "received"
    },
    {
      "sentence": "He will have talked to my family by tonight.",
      "verb": "talked"
    },
    {
      "sentence": "By next month, the manager will have started the email.",
      "verb": "started"
    },
    {
      "sentence": "By next month, i will have cleaned the garage.",
      "verb": "cleaned"
    },
    {
      "sentence": "By in two days, we will have received the contract.",
      "verb": "received"
    },
    {
      "sentence": "Our neighbors will have texted the client by next week.",
      "verb": "texted"
    },
    {
      "sentence": "The company will have developed the update by then.",
      "verb": "developed"
    },
    {
      "sentence": "They will have emailed the boss by next month.",
      "verb": "emailed"
    },
    {
      "sentence": "By tonight, you will have spoken to my parents.",
      "verb": "spoken"
    },
    {
      "sentence": "She will have sketched an illustration by then.",
      "verb": "sketched"
    },
    {
      "sentence": "We will have drunk milk by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The children will have watched the game by next month.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, i will have prepared a cake.",
      "verb": "prepared"
    },
    {
      "sentence": "The bird will have played with the toy by then.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have chased its tail by in two days.",
      "verb": "chased"
    },
    {
      "sentence": "Emma will have organized the clothes by then.",
      "verb": "organized"
    },
    {
      "sentence": "The manager will have gotten the phone by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By this weekend, they will have cooked pasta.",
      "verb": "cooked"
    },
    {
      "sentence": "John will have found some clothes by next month.",
      "verb": "found"
    },
    {
      "sentence": "By next year, the cat will have chased the toy.",
      "verb": "chased"
    },
    {
      "sentence": "The bird will have played with the toy by next year.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have eaten a salad by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have thought about the event by then.",
      "verb": "thought"
    },
    {
      "sentence": "My parents will have played video games by then.",
      "verb": "played"
    },
    {
      "sentence": "By soon, the bird will have caught a butterfly.",
      "verb": "caught"
    },
    {
      "sentence": "They will have submitted the application by tonight.",
      "verb": "submitted"
    },
    {
      "sentence": "The company will have developed the championship by next year.",
      "verb": "developed"
    },
    {
      "sentence": "He will have painted the wall by next year.",
      "verb": "painted"
    },
    {
      "sentence": "The teacher will have started the contract by then.",
      "verb": "started"
    },
    {
      "sentence": "Sarah will have fixed the bike by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The dog will have chased the other pets by then.",
      "verb": "chased"
    },
    {
      "sentence": "Tom will have listened to a song by then.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have caught a butterfly by then.",
      "verb": "caught"
    },
    {
      "sentence": "I will have driven to the gym by later.",
      "verb": "driven"
    },
    {
      "sentence": "The cat will have eaten its breakfast by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have built a house by this weekend.",
      "verb": "built"
    },
    {
      "sentence": "You will have returned to the airport by this weekend.",
      "verb": "returned"
    },
    {
      "sentence": "The manager will have flown to the gym by then.",
      "verb": "flown"
    },
    {
      "sentence": "My brother will have organized the bathroom by then.",
      "verb": "organized"
    },
    {
      "sentence": "By in two days, i will have tidied the dishes.",
      "verb": "tidied"
    },
    {
      "sentence": "Emma will have come downtown by then.",
      "verb": "come"
    },
    {
      "sentence": "You will have prepared a cake by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By tonight, the dog will have eaten the leftover food.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, john will have met the neighbors.",
      "verb": "met"
    },
    {
      "sentence": "By this evening, the bird will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have eaten a salad by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, the cat will have run in circles.",
      "verb": "run"
    },
    {
      "sentence": "My friend will have bought some clothes by next year.",
      "verb": "bought"
    },
    {
      "sentence": "The bird will have caught the toy by next year.",
      "verb": "caught"
    },
    {
      "sentence": "We will have met my grandmother by next week.",
      "verb": "met"
    },
    {
      "sentence": "My friend will have repaired the bike by then.",
      "verb": "repaired"
    },
    {
      "sentence": "Sarah will have remembered the decision by later.",
      "verb": "remembered"
    },
    {
      "sentence": "Emma will have given a new car by next month.",
      "verb": "given"
    },
    {
      "sentence": "He will have sketched a portrait by next year.",
      "verb": "sketched"
    },
    {
      "sentence": "We will have learned grammar by next week.",
      "verb": "learned"
    },
    {
      "sentence": "By this weekend, sarah will have repaired the door.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, the bird will have eaten its breakfast.",
      "verb": "eaten"
    },
    {
      "sentence": "By soon, her sister will have organized the clothes.",
      "verb": "organized"
    },
    {
      "sentence": "By tonight, he will have thought about the decision.",
      "verb": "thought"
    },
    {
      "sentence": "By tonight, sarah will have practiced English.",
      "verb": "practiced"
    },
    {
      "sentence": "You will have started the contract by then.",
      "verb": "started"
    },
    {
      "sentence": "The students will have made a salad by then.",
      "verb": "made"
    },
    {
      "sentence": "The manager will have tidied the office by soon.",
      "verb": "tidied"
    },
    {
      "sentence": "The cat will have chased the mouse by then.",
      "verb": "chased"
    },
    {
      "sentence": "My parents will have spoken to the manager by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By this weekend, tom will have watched football.",
      "verb": "watched"
    },
    {
      "sentence": "By next month, he will have spoken to my family.",
      "verb": "spoken"
    },
    {
      "sentence": "By tonight, her sister will have left to the office.",
      "verb": "left"
    },
    {
      "sentence": "The cat will have played with its owner by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "My brother will have built a model by then.",
      "verb": "built"
    },
    {
      "sentence": "The company will have completed a new product by later.",
      "verb": "completed"
    },
    {
      "sentence": "My friend will have thought about the vacation by then.",
      "verb": "thought"
    },
    {
      "sentence": "You will have painted the wall by then.",
      "verb": "painted"
    },
    {
      "sentence": "By tonight, emma will have eaten soup.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "You will have taught grammar by next year.",
      "verb": "taught"
    },
    {
      "sentence": "By soon, emma will have washed the kitchen.",
      "verb": "washed"
    },
    {
      "sentence": "He will have driven to the market by this weekend.",
      "verb": "driven"
    },
    {
      "sentence": "Her sister will have traveled to the beach by later.",
      "verb": "traveled"
    },
    {
      "sentence": "By tomorrow, the company will have completed the project.",
      "verb": "completed"
    },
    {
      "sentence": "By soon, the students will have contacted the team.",
      "verb": "contacted"
    },
    {
      "sentence": "By tomorrow, i will have studied for the exam.",
      "verb": "studied"
    },
    {
      "sentence": "We will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "By next month, she will have submitted the task.",
      "verb": "submitted"
    },
    {
      "sentence": "The teacher will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have slept in the corner by in two days.",
      "verb": "slept"
    },
    {
      "sentence": "The cat will have caught a treat by then.",
      "verb": "caught"
    },
    {
      "sentence": "The cat will have played with the ball by then.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have texted my parents by soon.",
      "verb": "texted"
    },
    {
      "sentence": "By next week, the cat will have eaten its food.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "By this weekend, they will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "By this weekend, they will have completed the application.",
      "verb": "completed"
    },
    {
      "sentence": "By this evening, we will have watched football.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, the dog will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "By this evening, the company will have won the project.",
      "verb": "won"
    },
    {
      "sentence": "By next year, the teacher will have listened to the news.",
      "verb": "listened"
    },
    {
      "sentence": "By this evening, the bird will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "By next week, the dog will have chased its tail.",
      "verb": "chased"
    },
    {
      "sentence": "The bird will have run in the garden by this weekend.",
      "verb": "run"
    },
    {
      "sentence": "Her sister will have traveled to the store by then.",
      "verb": "traveled"
    },
    {
      "sentence": "She will have practiced mathematics by then.",
      "verb": "practiced"
    },
    {
      "sentence": "Sarah will have repaired the sink by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "The manager will have considered the situation by soon.",
      "verb": "considered"
    },
    {
      "sentence": "The company will have launched the deal by this evening.",
      "verb": "launched"
    },
    {
      "sentence": "Tom will have washed the room by next month.",
      "verb": "washed"
    },
    {
      "sentence": "You will have watched the match by later.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, we will have watched the match.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, john will have spoken to a colleague.",
      "verb": "spoken"
    },
    {
      "sentence": "My brother will have tidied the house by this weekend.",
      "verb": "tidied"
    },
    {
      "sentence": "The students will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "My brother will have watched a series by later.",
      "verb": "watched"
    },
    {
      "sentence": "My friend will have watched a video by tomorrow.",
      "verb": "watched"
    },
    {
      "sentence": "Tom will have made soup by then.",
      "verb": "made"
    },
    {
      "sentence": "The children will have decided on the event by next year.",
      "verb": "decided"
    },
    {
      "sentence": "Our neighbors will have drawn a picture by this evening.",
      "verb": "drawn"
    },
    {
      "sentence": "By tomorrow, the cat will have chased the toy.",
      "verb": "chased"
    },
    {
      "sentence": "By in two days, the bird will have run in the yard.",
      "verb": "run"
    },
    {
      "sentence": "By next month, the manager will have met the client.",
      "verb": "met"
    },
    {
      "sentence": "They will have sent the task by then.",
      "verb": "sent"
    },
    {
      "sentence": "My friend will have made a meal by then.",
      "verb": "made"
    },
    {
      "sentence": "Her sister will have had soup by this evening.",
      "verb": "had"
    },
    {
      "sentence": "The students will have eaten a snack by then.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have visited my friend by then.",
      "verb": "visited"
    },
    {
      "sentence": "We will have listened to jazz by next month.",
      "verb": "listened"
    },
    {
      "sentence": "By later, they will have eaten a meal.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, the manager will have started the report.",
      "verb": "started"
    },
    {
      "sentence": "By tonight, the children will have drunk a smoothie.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, the bird will have played with its owner.",
      "verb": "played"
    },
    {
      "sentence": "By later, the manager will have drunk a smoothie.",
      "verb": "drunk"
    },
    {
      "sentence": "Our neighbors will have eaten some fruit by in two days.",
      "verb": "eaten"
    },
    {
      "sentence": "The students will have watched the game by then.",
      "verb": "watched"
    },
    {
      "sentence": "The bird will have chased its tail by then.",
      "verb": "chased"
    },
    {
      "sentence": "He will have drunk coffee by this weekend.",
      "verb": "drunk"
    },
    {
      "sentence": "The team will have completed the championship by later.",
      "verb": "completed"
    },
    {
      "sentence": "Her sister will have repaired the door by this weekend.",
      "verb": "repaired"
    },
    {
      "sentence": "We will have arrived to the park by this weekend.",
      "verb": "arrived"
    },
    {
      "sentence": "By tomorrow, the company will have won the contract.",
      "verb": "won"
    },
    {
      "sentence": "She will have decided on the decision by then.",
      "verb": "decided"
    },
    {
      "sentence": "You will have watched the news by then.",
      "verb": "watched"
    },
    {
      "sentence": "Our neighbors will have had a salad by soon.",
      "verb": "had"
    },
    {
      "sentence": "By this weekend, the dog will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "The cat will have eaten quickly by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By next week, john will have taught the notes.",
      "verb": "taught"
    },
    {
      "sentence": "My brother will have started the report by then.",
      "verb": "started"
    },
    {
      "sentence": "He will have drunk a smoothie by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "My parents will have found the phone by in two days.",
      "verb": "found"
    },
    {
      "sentence": "The children will have forgotten the birthday party by tomorrow.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tomorrow, her sister will have sent the task.",
      "verb": "sent"
    },
    {
      "sentence": "The bird will have run in circles by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "Tom will have contacted the office by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, the bird will have played in the garden.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have created a model by then.",
      "verb": "created"
    },
    {
      "sentence": "The dog will have played in the garden by then.",
      "verb": "played"
    },
    {
      "sentence": "By next month, he will have forgotten the vacation.",
      "verb": "forgotten"
    },
    {
      "sentence": "She will have received the letter by next week.",
      "verb": "received"
    },
    {
      "sentence": "By next month, the dog will have caught the mouse.",
      "verb": "caught"
    },
    {
      "sentence": "My brother will have met an old friend by in two days.",
      "verb": "met"
    },
    {
      "sentence": "Sarah will have eaten pasta by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have watched a video by later.",
      "verb": "watched"
    },
    {
      "sentence": "My brother will have washed the garage by then.",
      "verb": "washed"
    },
    {
      "sentence": "The dog will have chased the squirrel by soon.",
      "verb": "chased"
    },
    {
      "sentence": "Tom will have tidied the garage by tomorrow.",
      "verb": "tidied"
    },
    {
      "sentence": "She will have chosen a laptop by then.",
      "verb": "chosen"
    },
    {
      "sentence": "The teacher will have cooked rice by next month.",
      "verb": "cooked"
    },
    {
      "sentence": "The company will have won the results by then.",
      "verb": "won"
    },
    {
      "sentence": "Her sister will have considered the future by tomorrow.",
      "verb": "considered"
    },
    {
      "sentence": "By next month, my friend will have fixed the sink.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "Sarah will have learned grammar by then.",
      "verb": "learned"
    },
    {
      "sentence": "Our neighbors will have traveled to the store by this evening.",
      "verb": "traveled"
    },
    {
      "sentence": "The cat will have chased the squirrel by tomorrow.",
      "verb": "chased"
    },
    {
      "sentence": "By next year, my friend will have designed a house.",
      "verb": "designed"
    },
    {
      "sentence": "By next year, she will have listened to classical music.",
      "verb": "listened"
    },
    {
      "sentence": "My parents will have visited the manager by then.",
      "verb": "visited"
    },
    {
      "sentence": "My friend will have drunk milk by next year.",
      "verb": "drunk"
    },
    {
      "sentence": "By soon, john will have cooked a salad.",
      "verb": "cooked"
    },
    {
      "sentence": "The teacher will have played soccer by then.",
      "verb": "played"
    },
    {
      "sentence": "The company will have launched the update by then.",
      "verb": "launched"
    },
    {
      "sentence": "The teacher will have prepared cookies by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The cat will have chased the squirrel by then.",
      "verb": "chased"
    },
    {
      "sentence": "By next year, the children will have contacted customer service.",
      "verb": "contacted"
    },
    {
      "sentence": "By this evening, the cat will have run in the park.",
      "verb": "run"
    },
    {
      "sentence": "By later, the bird will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "By next week, the bird will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "By tonight, i will have drunk milk.",
      "verb": "drunk"
    },
    {
      "sentence": "By next year, the dog will have played in the garden.",
      "verb": "played"
    },
    {
      "sentence": "By next month, my friend will have started the report.",
      "verb": "started"
    },
    {
      "sentence": "He will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "I will have made pasta by next week.",
      "verb": "made"
    },
    {
      "sentence": "The team will have completed the deal by next week.",
      "verb": "completed"
    },
    {
      "sentence": "By next year, they will have drunk some water.",
      "verb": "drunk"
    },
    {
      "sentence": "The students will have written the project by next month.",
      "verb": "written"
    },
    {
      "sentence": "My parents will have seen an old friend by tomorrow.",
      "verb": "seen"
    },
    {
      "sentence": "I will have remembered the decision by next year.",
      "verb": "remembered"
    },
    {
      "sentence": "She will have washed the office by tomorrow.",
      "verb": "washed"
    },
    {
      "sentence": "By later, her sister will have seen my grandmother.",
      "verb": "seen"
    },
    {
      "sentence": "They will have repaired the roof by soon.",
      "verb": "repaired"
    },
    {
      "sentence": "I will have met the team by then.",
      "verb": "met"
    },
    {
      "sentence": "I will have organized the car by then.",
      "verb": "organized"
    },
    {
      "sentence": "By next month, the teacher will have considered the plan.",
      "verb": "considered"
    },
    {
      "sentence": "Emma will have made a cake by then.",
      "verb": "made"
    },
    {
      "sentence": "By tonight, the cat will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have texted the boss by then.",
      "verb": "texted"
    },
    {
      "sentence": "We will have drawn a diagram by in two days.",
      "verb": "drawn"
    },
    {
      "sentence": "By next year, my parents will have met my parents.",
      "verb": "met"
    },
    {
      "sentence": "By this weekend, my friend will have submitted the letter.",
      "verb": "submitted"
    },
    {
      "sentence": "Sarah will have submitted the presentation by this weekend.",
      "verb": "submitted"
    },
    {
      "sentence": "By in two days, sarah will have watched a documentary.",
      "verb": "watched"
    },
    {
      "sentence": "She will have run to the park by then.",
      "verb": "run"
    },
    {
      "sentence": "The bird will have run in the yard by in two days.",
      "verb": "run"
    },
    {
      "sentence": "By next month, the team will have completed the software.",
      "verb": "completed"
    },
    {
      "sentence": "The teacher will have understood mathematics by then.",
      "verb": "understood"
    },
    {
      "sentence": "John will have learned the chapter by then.",
      "verb": "learned"
    },
    {
      "sentence": "By tonight, the cat will have eaten some food.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have eaten a salad by in two days.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have seen an old friend by next week.",
      "verb": "seen"
    },
    {
      "sentence": "By in two days, he will have texted the doctor.",
      "verb": "texted"
    },
    {
      "sentence": "John will have forgotten the plan by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "Her sister will have submitted the report by then.",
      "verb": "submitted"
    },
    {
      "sentence": "By later, sarah will have created a website.",
      "verb": "created"
    },
    {
      "sentence": "By soon, the dog will have caught the frisbee.",
      "verb": "caught"
    },
    {
      "sentence": "The bird will have chased birds in the garden by then.",
      "verb": "chased"
    },
    {
      "sentence": "The cat will have eaten its breakfast by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Her sister will have watched a show by tonight.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, the children will have spoken with the neighbors.",
      "verb": "spoken"
    },
    {
      "sentence": "Sarah will have drunk milk by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "My parents will have had a meal by then.",
      "verb": "had"
    },
    {
      "sentence": "The dog will have slept all day by then.",
      "verb": "slept"
    },
    {
      "sentence": "The cat will have chased its tail by then.",
      "verb": "chased"
    },
    {
      "sentence": "She will have organized the kitchen by then.",
      "verb": "organized"
    },
    {
      "sentence": "The dog will have eaten a treat by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "The cat will have caught a treat by this evening.",
      "verb": "caught"
    },
    {
      "sentence": "Sarah will have eaten pizza by then.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have submitted the letter by then.",
      "verb": "submitted"
    },
    {
      "sentence": "Her sister will have played basketball by next month.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have seen my parents by next month.",
      "verb": "seen"
    },
    {
      "sentence": "The children will have listened to a song by then.",
      "verb": "listened"
    },
    {
      "sentence": "By this evening, she will have eaten lunch.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have drawn a diagram by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By in two days, the cat will have run around the house.",
      "verb": "run"
    },
    {
      "sentence": "The dog will have run in the park by then.",
      "verb": "run"
    },
    {
      "sentence": "Emma will have had pizza by then.",
      "verb": "had"
    },
    {
      "sentence": "You will have had a sandwich by then.",
      "verb": "had"
    },
    {
      "sentence": "Our neighbors will have played golf by then.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, i will have played tennis.",
      "verb": "played"
    },
    {
      "sentence": "The students will have listened to a podcast by soon.",
      "verb": "listened"
    },
    {
      "sentence": "Sarah will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "By this weekend, he will have reviewed the lesson.",
      "verb": "reviewed"
    },
    {
      "sentence": "By next week, he will have planned the birthday party.",
      "verb": "planned"
    },
    {
      "sentence": "By tonight, my friend will have drawn an illustration.",
      "verb": "drawn"
    },
    {
      "sentence": "The students will have texted my friend by then.",
      "verb": "texted"
    },
    {
      "sentence": "The company will have released the update by next year.",
      "verb": "released"
    },
    {
      "sentence": "The cat will have chased its tail by next year.",
      "verb": "chased"
    },
    {
      "sentence": "Her sister will have made pasta by then.",
      "verb": "made"
    },
    {
      "sentence": "The cat will have played with the toy by next week.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have caught a bird by then.",
      "verb": "caught"
    },
    {
      "sentence": "By soon, the teacher will have drawn an illustration.",
      "verb": "drawn"
    },
    {
      "sentence": "She will have written the proposal by then.",
      "verb": "written"
    },
    {
      "sentence": "By next month, sarah will have spoken with the professor.",
      "verb": "spoken"
    },
    {
      "sentence": "I will have met an old friend by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "By this evening, the children will have watched football.",
      "verb": "watched"
    },
    {
      "sentence": "John will have called the boss by tonight.",
      "verb": "called"
    },
    {
      "sentence": "Our neighbors will have talked to the client by then.",
      "verb": "talked"
    },
    {
      "sentence": "The manager will have listened to the radio by later.",
      "verb": "listened"
    },
    {
      "sentence": "By next year, her sister will have had pizza.",
      "verb": "had"
    },
    {
      "sentence": "The dog will have run through the grass by then.",
      "verb": "run"
    },
    {
      "sentence": "The children will have watched a series by this weekend.",
      "verb": "watched"
    },
    {
      "sentence": "Sarah will have forgotten the event by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "Emma will have met my family by next month.",
      "verb": "met"
    },
    {
      "sentence": "By later, you will have visited my family.",
      "verb": "visited"
    },
    {
      "sentence": "The bird will have run around the house by then.",
      "verb": "run"
    },
    {
      "sentence": "By tomorrow, her sister will have drunk some water.",
      "verb": "drunk"
    },
    {
      "sentence": "By this weekend, the dog will have caught a treat.",
      "verb": "caught"
    },
    {
      "sentence": "The team will have won the deal by then.",
      "verb": "won"
    },
    {
      "sentence": "Our neighbors will have created a house by then.",
      "verb": "created"
    },
    {
      "sentence": "My brother will have cleaned the bathroom by tomorrow.",
      "verb": "cleaned"
    },
    {
      "sentence": "The dog will have slept in the corner by then.",
      "verb": "slept"
    },
    {
      "sentence": "By in two days, my friend will have seen the client.",
      "verb": "seen"
    },
    {
      "sentence": "The dog will have played in the yard by then.",
      "verb": "played"
    },
    {
      "sentence": "She will have sold a gift by next year.",
      "verb": "sold"
    },
    {
      "sentence": "You will have chosen some clothes by then.",
      "verb": "chosen"
    },
    {
      "sentence": "You will have emailed the team by tonight.",
      "verb": "emailed"
    },
    {
      "sentence": "By this weekend, we will have played video games.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have drunk juice by soon.",
      "verb": "drunk"
    },
    {
      "sentence": "My parents will have repaired the door by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "The students will have emailed the client by then.",
      "verb": "emailed"
    },
    {
      "sentence": "By next month, my brother will have drunk juice.",
      "verb": "drunk"
    },
    {
      "sentence": "By next week, he will have practiced the chapter.",
      "verb": "practiced"
    },
    {
      "sentence": "My parents will have drunk tea by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have watched the match by later.",
      "verb": "watched"
    },
    {
      "sentence": "Emma will have given the ticket by this weekend.",
      "verb": "given"
    },
    {
      "sentence": "The dog will have run in the garden by then.",
      "verb": "run"
    },
    {
      "sentence": "The dog will have eaten some food by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, sarah will have listened to a song.",
      "verb": "listened"
    },
    {
      "sentence": "We will have eaten pasta by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have drunk juice by then.",
      "verb": "drunk"
    },
    {
      "sentence": "My parents will have listened to the radio by next month.",
      "verb": "listened"
    },
    {
      "sentence": "My parents will have drunk coffee by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By this evening, you will have built a plan.",
      "verb": "built"
    },
    {
      "sentence": "By soon, my friend will have fixed the computer.",
      "verb": "fixed"
    },
    {
      "sentence": "We will have remembered the event by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By tonight, the manager will have played basketball.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have sold groceries by later.",
      "verb": "sold"
    },
    {
      "sentence": "Emma will have watched TV by this weekend.",
      "verb": "watched"
    },
    {
      "sentence": "John will have bought a book by in two days.",
      "verb": "bought"
    },
    {
      "sentence": "By this evening, the students will have drunk water.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have spoken with my friend by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By tonight, the team will have won the update.",
      "verb": "won"
    },
    {
      "sentence": "Sarah will have visited the teacher by later.",
      "verb": "visited"
    },
    {
      "sentence": "By this evening, my parents will have completed the assignment.",
      "verb": "completed"
    },
    {
      "sentence": "The teacher will have understood for the exam by next year.",
      "verb": "understood"
    },
    {
      "sentence": "The company will have won the software by tomorrow.",
      "verb": "won"
    },
    {
      "sentence": "The bird will have caught the toy by then.",
      "verb": "caught"
    },
    {
      "sentence": "The company will have developed the project by in two days.",
      "verb": "developed"
    },
    {
      "sentence": "Our neighbors will have visited an old friend by then.",
      "verb": "visited"
    },
    {
      "sentence": "The bird will have played in the garden by next month.",
      "verb": "played"
    },
    {
      "sentence": "He will have had pizza by then.",
      "verb": "had"
    },
    {
      "sentence": "By later, i will have seen my friend.",
      "verb": "seen"
    },
    {
      "sentence": "The cat will have caught a bird by then.",
      "verb": "caught"
    },
    {
      "sentence": "My friend will have had pizza by then.",
      "verb": "had"
    },
    {
      "sentence": "By in two days, i will have seen my friend.",
      "verb": "seen"
    },
    {
      "sentence": "By tomorrow, he will have completed the letter.",
      "verb": "completed"
    },
    {
      "sentence": "The manager will have had a snack by later.",
      "verb": "had"
    },
    {
      "sentence": "By tomorrow, the manager will have painted a diagram.",
      "verb": "painted"
    },
    {
      "sentence": "The cat will have eaten its breakfast by this evening.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have played tennis by then.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have slept all day by soon.",
      "verb": "slept"
    },
    {
      "sentence": "He will have drawn an illustration by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The bird will have played in the yard by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, they will have built an app.",
      "verb": "built"
    },
    {
      "sentence": "John will have seen the neighbors by then.",
      "verb": "seen"
    },
    {
      "sentence": "The bird will have slept in the corner by next year.",
      "verb": "slept"
    },
    {
      "sentence": "By soon, she will have forgotten the situation.",
      "verb": "forgotten"
    },
    {
      "sentence": "He will have traveled to the gym by then.",
      "verb": "traveled"
    },
    {
      "sentence": "By next year, the teacher will have completed the report.",
      "verb": "completed"
    },
    {
      "sentence": "Sarah will have sketched a landscape by then.",
      "verb": "sketched"
    },
    {
      "sentence": "The students will have seen the teacher by this evening.",
      "verb": "seen"
    },
    {
      "sentence": "By later, she will have eaten breakfast.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have listened to jazz by next month.",
      "verb": "listened"
    },
    {
      "sentence": "By next week, the dog will have played with the toy.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have caught the ball by then.",
      "verb": "caught"
    },
    {
      "sentence": "By tomorrow, she will have created a website.",
      "verb": "created"
    },
    {
      "sentence": "John will have gone to the office by soon.",
      "verb": "gone"
    },
    {
      "sentence": "By next year, john will have called the doctor.",
      "verb": "called"
    },
    {
      "sentence": "My brother will have drunk a smoothie by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The company will have announced the project by then.",
      "verb": "announced"
    },
    {
      "sentence": "By this evening, john will have prepared the application.",
      "verb": "prepared"
    },
    {
      "sentence": "Tom will have called the teacher by then.",
      "verb": "called"
    },
    {
      "sentence": "They will have repaired the computer by tomorrow.",
      "verb": "repaired"
    },
    {
      "sentence": "The bird will have caught a treat by then.",
      "verb": "caught"
    },
    {
      "sentence": "By this evening, the cat will have played with its owner.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have played video games by this evening.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have spoken with a colleague by tomorrow.",
      "verb": "spoken"
    },
    {
      "sentence": "Her sister will have had breakfast by then.",
      "verb": "had"
    },
    {
      "sentence": "The bird will have slept in the corner by later.",
      "verb": "slept"
    },
    {
      "sentence": "The team will have won the project by soon.",
      "verb": "won"
    },
    {
      "sentence": "They will have called the boss by then.",
      "verb": "called"
    },
    {
      "sentence": "My friend will have sketched a landscape by next year.",
      "verb": "sketched"
    },
    {
      "sentence": "Her sister will have sent the application by soon.",
      "verb": "sent"
    },
    {
      "sentence": "The students will have learned the lesson by tomorrow.",
      "verb": "learned"
    },
    {
      "sentence": "By soon, tom will have organized the garage.",
      "verb": "organized"
    },
    {
      "sentence": "John will have built an app by soon.",
      "verb": "built"
    },
    {
      "sentence": "My parents will have made breakfast by then.",
      "verb": "made"
    },
    {
      "sentence": "The dog will have caught the mouse by then.",
      "verb": "caught"
    },
    {
      "sentence": "John will have talked to my family by then.",
      "verb": "talked"
    },
    {
      "sentence": "They will have had a sandwich by soon.",
      "verb": "had"
    },
    {
      "sentence": "Our neighbors will have driven to the store by tonight.",
      "verb": "driven"
    },
    {
      "sentence": "By next year, the company will have launched the championship.",
      "verb": "launched"
    },
    {
      "sentence": "By next year, my parents will have decided on the decision.",
      "verb": "decided"
    },
    {
      "sentence": "My parents will have listened to the news by next year.",
      "verb": "listened"
    },
    {
      "sentence": "The company will have developed a new product by then.",
      "verb": "developed"
    },
    {
      "sentence": "By later, the cat will have chased its tail.",
      "verb": "chased"
    },
    {
      "sentence": "Her sister will have bought the ticket by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "The bird will have run in circles by tonight.",
      "verb": "run"
    },
    {
      "sentence": "By this weekend, my parents will have cooked a meal.",
      "verb": "cooked"
    },
    {
      "sentence": "By tomorrow, the cat will have chased the other pets.",
      "verb": "chased"
    },
    {
      "sentence": "By tonight, you will have completed the report.",
      "verb": "completed"
    },
    {
      "sentence": "My parents will have traveled to the market by this weekend.",
      "verb": "traveled"
    },
    {
      "sentence": "By this weekend, my parents will have spoken to a colleague.",
      "verb": "spoken"
    },
    {
      "sentence": "She will have traveled to the office by then.",
      "verb": "traveled"
    },
    {
      "sentence": "The students will have studied French by then.",
      "verb": "studied"
    },
    {
      "sentence": "By next month, the dog will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "Sarah will have met my grandmother by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "By later, the manager will have designed a website.",
      "verb": "designed"
    },
    {
      "sentence": "Our neighbors will have drunk water by tonight.",
      "verb": "drunk"
    },
    {
      "sentence": "By next year, the cat will have caught the ball.",
      "verb": "caught"
    },
    {
      "sentence": "The students will have seen the team by then.",
      "verb": "seen"
    },
    {
      "sentence": "By soon, my friend will have fixed the door.",
      "verb": "fixed"
    },
    {
      "sentence": "We will have listened to classical music by next week.",
      "verb": "listened"
    },
    {
      "sentence": "By this evening, the bird will have chased birds in the garden.",
      "verb": "chased"
    },
    {
      "sentence": "The children will have repaired the door by this weekend.",
      "verb": "repaired"
    },
    {
      "sentence": "By tonight, emma will have drunk a smoothie.",
      "verb": "drunk"
    },
    {
      "sentence": "They will have started the report by then.",
      "verb": "started"
    },
    {
      "sentence": "By tonight, the manager will have learned the material.",
      "verb": "learned"
    },
    {
      "sentence": "By tonight, the cat will have chased the mouse.",
      "verb": "chased"
    },
    {
      "sentence": "The manager will have cleaned the garage by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "John will have watched the match by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, our neighbors will have seen an old friend.",
      "verb": "seen"
    },
    {
      "sentence": "They will have contacted the client by next week.",
      "verb": "contacted"
    },
    {
      "sentence": "Her sister will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "The dog will have caught the toy by next week.",
      "verb": "caught"
    },
    {
      "sentence": "By next year, john will have listened to jazz.",
      "verb": "listened"
    },
    {
      "sentence": "By this weekend, the manager will have given flowers.",
      "verb": "given"
    },
    {
      "sentence": "The cat will have caught a bird by later.",
      "verb": "caught"
    },
    {
      "sentence": "The children will have played chess by this weekend.",
      "verb": "played"
    },
    {
      "sentence": "By soon, the cat will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "By later, the company will have completed the software.",
      "verb": "completed"
    },
    {
      "sentence": "Our neighbors will have called the doctor by then.",
      "verb": "called"
    },
    {
      "sentence": "She will have cleaned the clothes by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "My parents will have listened to jazz by this weekend.",
      "verb": "listened"
    },
    {
      "sentence": "Our neighbors will have repaired the computer by this weekend.",
      "verb": "repaired"
    },
    {
      "sentence": "He will have played volleyball by then.",
      "verb": "played"
    },
    {
      "sentence": "John will have visited my family by tomorrow.",
      "verb": "visited"
    },
    {
      "sentence": "The children will have found a new car by then.",
      "verb": "found"
    },
    {
      "sentence": "Emma will have played soccer by then.",
      "verb": "played"
    },
    {
      "sentence": "By soon, the dog will have chased the ball.",
      "verb": "chased"
    },
    {
      "sentence": "The bird will have chased the ball by soon.",
      "verb": "chased"
    },
    {
      "sentence": "The manager will have drunk coffee by later.",
      "verb": "drunk"
    },
    {
      "sentence": "They will have bought the ticket by then.",
      "verb": "bought"
    },
    {
      "sentence": "You will have considered the vacation by next month.",
      "verb": "considered"
    },
    {
      "sentence": "My parents will have spoken to my family by tomorrow.",
      "verb": "spoken"
    },
    {
      "sentence": "The dog will have run in the yard by this evening.",
      "verb": "run"
    },
    {
      "sentence": "By tonight, the children will have played guitar.",
      "verb": "played"
    },
    {
      "sentence": "The cat will have slept by the window by next year.",
      "verb": "slept"
    },
    {
      "sentence": "By next week, tom will have listened to the lecture.",
      "verb": "listened"
    },
    {
      "sentence": "She will have studied history by then.",
      "verb": "studied"
    },
    {
      "sentence": "By next week, the dog will have played with the ball.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have drunk coffee by next month.",
      "verb": "drunk"
    },
    {
      "sentence": "Her sister will have visited the doctor by soon.",
      "verb": "visited"
    },
    {
      "sentence": "Her sister will have listened to a podcast by then.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have played with the ball by this evening.",
      "verb": "played"
    },
    {
      "sentence": "Our neighbors will have repaired the sink by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By next month, you will have had dinner.",
      "verb": "had"
    },
    {
      "sentence": "He will have fixed the computer by tonight.",
      "verb": "fixed"
    },
    {
      "sentence": "The cat will have chased the ball by then.",
      "verb": "chased"
    },
    {
      "sentence": "By this weekend, she will have visited an old friend.",
      "verb": "visited"
    },
    {
      "sentence": "He will have drunk some water by this weekend.",
      "verb": "drunk"
    },
    {
      "sentence": "By later, the cat will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "I will have taught history by next month.",
      "verb": "taught"
    },
    {
      "sentence": "I will have played guitar by then.",
      "verb": "played"
    },
    {
      "sentence": "By next month, the teacher will have fixed the bike.",
      "verb": "fixed"
    },
    {
      "sentence": "By this evening, i will have baked dinner.",
      "verb": "baked"
    },
    {
      "sentence": "By later, the students will have planned the vacation.",
      "verb": "planned"
    },
    {
      "sentence": "The manager will have planned the situation by next month.",
      "verb": "planned"
    },
    {
      "sentence": "They will have forgotten the options by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "I will have found groceries by then.",
      "verb": "found"
    },
    {
      "sentence": "By soon, tom will have had dinner.",
      "verb": "had"
    },
    {
      "sentence": "By this weekend, the cat will have chased birds in the garden.",
      "verb": "chased"
    },
    {
      "sentence": "She will have baked a meal by then.",
      "verb": "baked"
    },
    {
      "sentence": "She will have remembered the future by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By tomorrow, the dog will have chased the toy.",
      "verb": "chased"
    },
    {
      "sentence": "He will have contacted my family by then.",
      "verb": "contacted"
    },
    {
      "sentence": "The bird will have run around the house by tonight.",
      "verb": "run"
    },
    {
      "sentence": "They will have traveled to the office by tonight.",
      "verb": "traveled"
    },
    {
      "sentence": "By this evening, the manager will have finished the email.",
      "verb": "finished"
    },
    {
      "sentence": "The bird will have played in the park by then.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have chased the mouse by next month.",
      "verb": "chased"
    },
    {
      "sentence": "Tom will have arrived downtown by next year.",
      "verb": "arrived"
    },
    {
      "sentence": "I will have watched the news by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "The children will have sketched the wall by this evening.",
      "verb": "sketched"
    },
    {
      "sentence": "John will have played guitar by next week.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, tom will have watched the match.",
      "verb": "watched"
    },
    {
      "sentence": "You will have built a project by tonight.",
      "verb": "built"
    },
    {
      "sentence": "The manager will have completed the presentation by then.",
      "verb": "completed"
    },
    {
      "sentence": "Emma will have painted a landscape by then.",
      "verb": "painted"
    },
    {
      "sentence": "The teacher will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "We will have given a new car by then.",
      "verb": "given"
    },
    {
      "sentence": "She will have considered the trip by then.",
      "verb": "considered"
    },
    {
      "sentence": "Sarah will have bought a present by then.",
      "verb": "bought"
    },
    {
      "sentence": "The children will have eaten soup by then.",
      "verb": "eaten"
    },
    {
      "sentence": "The company will have announced a new product by then.",
      "verb": "announced"
    },
    {
      "sentence": "My friend will have had soup by next year.",
      "verb": "had"
    },
    {
      "sentence": "By tonight, she will have prepared rice.",
      "verb": "prepared"
    },
    {
      "sentence": "The cat will have run in the garden by then.",
      "verb": "run"
    },
    {
      "sentence": "By this weekend, the team will have announced the software.",
      "verb": "announced"
    },
    {
      "sentence": "The students will have listened to a song by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "By tonight, sarah will have repaired the roof.",
      "verb": "repaired"
    },
    {
      "sentence": "By tomorrow, my friend will have run to the bank.",
      "verb": "run"
    },
    {
      "sentence": "We will have seen my friend by in two days.",
      "verb": "seen"
    },
    {
      "sentence": "By later, we will have painted a diagram.",
      "verb": "painted"
    },
    {
      "sentence": "You will have watched a movie by next year.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have caught a bird by next week.",
      "verb": "caught"
    },
    {
      "sentence": "Her sister will have studied the chapter by this weekend.",
      "verb": "studied"
    },
    {
      "sentence": "My brother will have called the doctor by then.",
      "verb": "called"
    },
    {
      "sentence": "He will have drawn the wall by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By next month, the bird will have eaten a treat.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, the bird will have played in the park.",
      "verb": "played"
    },
    {
      "sentence": "He will have spoken to a colleague by in two days.",
      "verb": "spoken"
    },
    {
      "sentence": "By in two days, the bird will have eaten its dinner.",
      "verb": "eaten"
    },
    {
      "sentence": "John will have listened to a podcast by next year.",
      "verb": "listened"
    },
    {
      "sentence": "Tom will have cleaned the garage by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "The dog will have slept all day by next month.",
      "verb": "slept"
    },
    {
      "sentence": "By later, john will have found the ticket.",
      "verb": "found"
    },
    {
      "sentence": "By tonight, the cat will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "By this evening, she will have eaten a sandwich.",
      "verb": "eaten"
    },
    {
      "sentence": "The dog will have played with the toy by in two days.",
      "verb": "played"
    },
    {
      "sentence": "By later, emma will have contacted my friend.",
      "verb": "contacted"
    },
    {
      "sentence": "The bird will have eaten its food by then.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have thought about the plan by tomorrow.",
      "verb": "thought"
    },
    {
      "sentence": "They will have built a prototype by then.",
      "verb": "built"
    },
    {
      "sentence": "The dog will have slept in the corner by this evening.",
      "verb": "slept"
    },
    {
      "sentence": "My parents will have traveled to the office by then.",
      "verb": "traveled"
    },
    {
      "sentence": "By next week, my friend will have completed the project.",
      "verb": "completed"
    },
    {
      "sentence": "By tonight, she will have flown to the office.",
      "verb": "flown"
    },
    {
      "sentence": "The dog will have played in the park by later.",
      "verb": "played"
    },
    {
      "sentence": "The students will have gone to the beach by this weekend.",
      "verb": "gone"
    },
    {
      "sentence": "By next week, the teacher will have tidied the office.",
      "verb": "tidied"
    },
    {
      "sentence": "I will have practiced the lesson by then.",
      "verb": "practiced"
    },
    {
      "sentence": "By this evening, you will have organized the car.",
      "verb": "organized"
    },
    {
      "sentence": "By tomorrow, i will have sketched an illustration.",
      "verb": "sketched"
    },
    {
      "sentence": "The dog will have slept all day by later.",
      "verb": "slept"
    },
    {
      "sentence": "By this evening, the cat will have run in circles.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have decided on the situation by then.",
      "verb": "decided"
    },
    {
      "sentence": "Our neighbors will have started the document by then.",
      "verb": "started"
    },
    {
      "sentence": "The dog will have caught a treat by next month.",
      "verb": "caught"
    },
    {
      "sentence": "My parents will have drunk tea by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have seen an old friend by then.",
      "verb": "seen"
    },
    {
      "sentence": "Emma will have contacted my parents by tomorrow.",
      "verb": "contacted"
    },
    {
      "sentence": "By tonight, the cat will have played with the other pets.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, we will have created an app.",
      "verb": "created"
    },
    {
      "sentence": "He will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, the students will have gotten groceries.",
      "verb": "gotten"
    },
    {
      "sentence": "I will have submitted the project by later.",
      "verb": "submitted"
    },
    {
      "sentence": "The bird will have caught the mouse by then.",
      "verb": "caught"
    },
    {
      "sentence": "By next year, my brother will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "By soon, the manager will have arrived home.",
      "verb": "arrived"
    },
    {
      "sentence": "My brother will have read science by then.",
      "verb": "read"
    },
    {
      "sentence": "The manager will have repaired the computer by in two days.",
      "verb": "repaired"
    },
    {
      "sentence": "The children will have chosen some clothes by then.",
      "verb": "chosen"
    },
    {
      "sentence": "The cat will have slept in the corner by then.",
      "verb": "slept"
    },
    {
      "sentence": "The manager will have given a book by then.",
      "verb": "given"
    },
    {
      "sentence": "The dog will have chased the other pets by soon.",
      "verb": "chased"
    },
    {
      "sentence": "By soon, the children will have watched a video.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have run in circles by next month.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have fixed the fence by next month.",
      "verb": "fixed"
    },
    {
      "sentence": "They will have sketched a portrait by soon.",
      "verb": "sketched"
    },
    {
      "sentence": "You will have watched TV by soon.",
      "verb": "watched"
    },
    {
      "sentence": "The dog will have caught a treat by then.",
      "verb": "caught"
    },
    {
      "sentence": "My brother will have returned to the beach by then.",
      "verb": "returned"
    },
    {
      "sentence": "We will have played video games by later.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have drunk water by in two days.",
      "verb": "drunk"
    },
    {
      "sentence": "The manager will have practiced Spanish by tonight.",
      "verb": "practiced"
    },
    {
      "sentence": "Our neighbors will have played the piano by then.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, the bird will have played with the toy.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have played tennis by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have slept in the corner by soon.",
      "verb": "slept"
    },
    {
      "sentence": "By later, the bird will have chased the ball.",
      "verb": "chased"
    },
    {
      "sentence": "By next month, tom will have organized the clothes.",
      "verb": "organized"
    },
    {
      "sentence": "The cat will have played in the yard by then.",
      "verb": "played"
    },
    {
      "sentence": "I will have drunk juice by tonight.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have played with its owner by tonight.",
      "verb": "played"
    },
    {
      "sentence": "Emma will have arrived to the library by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By this weekend, the bird will have caught a butterfly.",
      "verb": "caught"
    },
    {
      "sentence": "Sarah will have prepared a salad by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The dog will have eaten its dinner by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, the dog will have caught a bird.",
      "verb": "caught"
    },
    {
      "sentence": "Her sister will have bought the phone by then.",
      "verb": "bought"
    },
    {
      "sentence": "Her sister will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The company will have released the software by tonight.",
      "verb": "released"
    },
    {
      "sentence": "The cat will have slept under the table by next month.",
      "verb": "slept"
    },
    {
      "sentence": "By later, the dog will have slept on the bed.",
      "verb": "slept"
    },
    {
      "sentence": "By this evening, john will have planned the birthday party.",
      "verb": "planned"
    },
    {
      "sentence": "My parents will have spoken with my parents by then.",
      "verb": "spoken"
    },
    {
      "sentence": "Sarah will have talked to the manager by then.",
      "verb": "talked"
    },
    {
      "sentence": "The dog will have slept under the table by in two days.",
      "verb": "slept"
    },
    {
      "sentence": "By next year, the manager will have prepared the project.",
      "verb": "prepared"
    },
    {
      "sentence": "By next month, my brother will have repaired the car.",
      "verb": "repaired"
    },
    {
      "sentence": "The bird will have played with the ball by then.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have found a present by then.",
      "verb": "found"
    },
    {
      "sentence": "Emma will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "By tomorrow, the teacher will have thought about the options.",
      "verb": "thought"
    },
    {
      "sentence": "She will have sold the phone by in two days.",
      "verb": "sold"
    },
    {
      "sentence": "The dog will have chased the mouse by tonight.",
      "verb": "chased"
    },
    {
      "sentence": "Her sister will have fixed the sink by soon.",
      "verb": "fixed"
    },
    {
      "sentence": "The dog will have chased the toy by next week.",
      "verb": "chased"
    },
    {
      "sentence": "Our neighbors will have played soccer by next week.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have designed a website by this evening.",
      "verb": "designed"
    },
    {
      "sentence": "Tom will have created a house by then.",
      "verb": "created"
    },
    {
      "sentence": "Our neighbors will have sold flowers by then.",
      "verb": "sold"
    },
    {
      "sentence": "The dog will have caught a bird by next year.",
      "verb": "caught"
    },
    {
      "sentence": "By next month, we will have drawn a portrait.",
      "verb": "drawn"
    },
    {
      "sentence": "My brother will have played video games by then.",
      "verb": "played"
    },
    {
      "sentence": "Our neighbors will have spoken to my friend by soon.",
      "verb": "spoken"
    },
    {
      "sentence": "Tom will have cleaned the office by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "Tom will have built an app by tonight.",
      "verb": "built"
    },
    {
      "sentence": "My friend will have organized the room by then.",
      "verb": "organized"
    },
    {
      "sentence": "Emma will have finished the assignment by later.",
      "verb": "finished"
    },
    {
      "sentence": "He will have forgotten the plan by in two days.",
      "verb": "forgotten"
    },
    {
      "sentence": "John will have played guitar by soon.",
      "verb": "played"
    },
    {
      "sentence": "Her sister will have listened to classical music by then.",
      "verb": "listened"
    },
    {
      "sentence": "Her sister will have thought about the plan by tomorrow.",
      "verb": "thought"
    },
    {
      "sentence": "The teacher will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "He will have eaten pasta by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have repaired the roof by tomorrow.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, the dog will have eaten the leftover food.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, the manager will have bought the ticket.",
      "verb": "bought"
    },
    {
      "sentence": "By later, the dog will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "By in two days, we will have drunk milk.",
      "verb": "drunk"
    },
    {
      "sentence": "The teacher will have fixed the fence by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The bird will have chased the mouse by then.",
      "verb": "chased"
    },
    {
      "sentence": "Our neighbors will have written the proposal by then.",
      "verb": "written"
    },
    {
      "sentence": "By this evening, tom will have cooked a meal.",
      "verb": "cooked"
    },
    {
      "sentence": "By next week, john will have played football.",
      "verb": "played"
    },
    {
      "sentence": "By later, they will have prepared the document.",
      "verb": "prepared"
    },
    {
      "sentence": "By later, the teacher will have eaten a salad.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have decided on the meeting by then.",
      "verb": "decided"
    },
    {
      "sentence": "By this evening, they will have designed a project.",
      "verb": "designed"
    },
    {
      "sentence": "The cat will have played in the yard by later.",
      "verb": "played"
    },
    {
      "sentence": "By soon, tom will have seen the manager.",
      "verb": "seen"
    },
    {
      "sentence": "You will have remembered the meeting by then.",
      "verb": "remembered"
    },
    {
      "sentence": "The students will have met the team by this evening.",
      "verb": "met"
    },
    {
      "sentence": "My friend will have contacted the boss by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, he will have completed the report.",
      "verb": "completed"
    },
    {
      "sentence": "By tomorrow, the teacher will have run to work.",
      "verb": "run"
    },
    {
      "sentence": "By later, they will have flown to the airport.",
      "verb": "flown"
    },
    {
      "sentence": "By this weekend, we will have drawn a poster.",
      "verb": "drawn"
    },
    {
      "sentence": "The dog will have played with the other pets by this weekend.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have played in the yard by then.",
      "verb": "played"
    },
    {
      "sentence": "By next year, my parents will have watched a show.",
      "verb": "watched"
    },
    {
      "sentence": "He will have visited the doctor by soon.",
      "verb": "visited"
    },
    {
      "sentence": "He will have thought about the trip by tonight.",
      "verb": "thought"
    },
    {
      "sentence": "The dog will have slept all day by tonight.",
      "verb": "slept"
    },
    {
      "sentence": "By this weekend, the students will have had some fruit.",
      "verb": "had"
    },
    {
      "sentence": "Sarah will have painted a poster by later.",
      "verb": "painted"
    },
    {
      "sentence": "The children will have called the office by then.",
      "verb": "called"
    },
    {
      "sentence": "Our neighbors will have sketched a picture by soon.",
      "verb": "sketched"
    },
    {
      "sentence": "The bird will have played with the ball by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By soon, the company will have announced the results.",
      "verb": "announced"
    },
    {
      "sentence": "Emma will have completed the proposal by then.",
      "verb": "completed"
    },
    {
      "sentence": "I will have made soup by next month.",
      "verb": "made"
    },
    {
      "sentence": "Her sister will have cooked cookies by then.",
      "verb": "cooked"
    },
    {
      "sentence": "I will have watched TV by tomorrow.",
      "verb": "watched"
    },
    {
      "sentence": "The students will have watched TV by this evening.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have slept on the couch by this evening.",
      "verb": "slept"
    },
    {
      "sentence": "By next week, her sister will have played the piano.",
      "verb": "played"
    },
    {
      "sentence": "She will have played video games by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By next month, my brother will have sketched the wall.",
      "verb": "sketched"
    },
    {
      "sentence": "By tomorrow, john will have run downtown.",
      "verb": "run"
    },
    {
      "sentence": "The bird will have eaten its breakfast by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Her sister will have washed the house by then.",
      "verb": "washed"
    },
    {
      "sentence": "My parents will have walked to the gym by tomorrow.",
      "verb": "walked"
    },
    {
      "sentence": "The dog will have eaten a treat by later.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have arrived to work by tonight.",
      "verb": "arrived"
    },
    {
      "sentence": "My brother will have sketched a picture by then.",
      "verb": "sketched"
    },
    {
      "sentence": "He will have drunk some water by next week.",
      "verb": "drunk"
    },
    {
      "sentence": "By next year, the children will have sent the application.",
      "verb": "sent"
    },
    {
      "sentence": "The team will have won the deal by next week.",
      "verb": "won"
    },
    {
      "sentence": "My brother will have watched a show by soon.",
      "verb": "watched"
    },
    {
      "sentence": "He will have arrived to the office by then.",
      "verb": "arrived"
    },
    {
      "sentence": "They will have tidied the kitchen by next year.",
      "verb": "tidied"
    },
    {
      "sentence": "By tomorrow, my friend will have traveled to the park.",
      "verb": "traveled"
    },
    {
      "sentence": "By later, emma will have created a house.",
      "verb": "created"
    },
    {
      "sentence": "By this weekend, the cat will have slept on the bed.",
      "verb": "slept"
    },
    {
      "sentence": "The children will have cleaned the garage by this evening.",
      "verb": "cleaned"
    },
    {
      "sentence": "The cat will have caught the toy by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "My friend will have played basketball by this evening.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have listened to classical music by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "The manager will have emailed the client by next month.",
      "verb": "emailed"
    },
    {
      "sentence": "The students will have drunk some water by then.",
      "verb": "drunk"
    },
    {
      "sentence": "You will have designed a website by next month.",
      "verb": "designed"
    },
    {
      "sentence": "We will have practiced the chapter by then.",
      "verb": "practiced"
    },
    {
      "sentence": "My friend will have chosen a gift by this evening.",
      "verb": "chosen"
    },
    {
      "sentence": "The students will have drunk water by next year.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, our neighbors will have fixed the car.",
      "verb": "fixed"
    },
    {
      "sentence": "By soon, the students will have baked cookies.",
      "verb": "baked"
    },
    {
      "sentence": "By soon, sarah will have watched a video.",
      "verb": "watched"
    },
    {
      "sentence": "By soon, the bird will have slept under the table.",
      "verb": "slept"
    },
    {
      "sentence": "By in two days, our neighbors will have played golf.",
      "verb": "played"
    },
    {
      "sentence": "Sarah will have painted a picture by this evening.",
      "verb": "painted"
    },
    {
      "sentence": "By this evening, the cat will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "By next year, we will have received the document.",
      "verb": "received"
    },
    {
      "sentence": "They will have eaten a sandwich by next week.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, the team will have announced a new product.",
      "verb": "announced"
    },
    {
      "sentence": "Emma will have contacted customer service by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, emma will have listened to the radio.",
      "verb": "listened"
    },
    {
      "sentence": "Tom will have practiced history by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The manager will have seen the neighbors by next month.",
      "verb": "seen"
    },
    {
      "sentence": "Emma will have played soccer by later.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have run in circles by next month.",
      "verb": "run"
    },
    {
      "sentence": "The cat will have eaten quickly by this weekend.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, sarah will have listened to music.",
      "verb": "listened"
    },
    {
      "sentence": "The children will have bought a laptop by tomorrow.",
      "verb": "bought"
    },
    {
      "sentence": "I will have watched the match by then.",
      "verb": "watched"
    },
    {
      "sentence": "By in two days, the cat will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "Sarah will have had a salad by in two days.",
      "verb": "had"
    },
    {
      "sentence": "My brother will have watched a movie by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, i will have remembered the future.",
      "verb": "remembered"
    },
    {
      "sentence": "We will have remembered the problem by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "By later, our neighbors will have run home.",
      "verb": "run"
    },
    {
      "sentence": "They will have washed the office by in two days.",
      "verb": "washed"
    },
    {
      "sentence": "By this weekend, we will have called the client.",
      "verb": "called"
    },
    {
      "sentence": "The children will have gone downtown by this evening.",
      "verb": "gone"
    },
    {
      "sentence": "The bird will have caught the toy by tonight.",
      "verb": "caught"
    },
    {
      "sentence": "Her sister will have painted a picture by then.",
      "verb": "painted"
    },
    {
      "sentence": "Tom will have talked to the client by then.",
      "verb": "talked"
    },
    {
      "sentence": "By this weekend, our neighbors will have sent the document.",
      "verb": "sent"
    },
    {
      "sentence": "By this weekend, he will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "By this weekend, my friend will have texted the doctor.",
      "verb": "texted"
    },
    {
      "sentence": "My brother will have had dinner by tomorrow.",
      "verb": "had"
    },
    {
      "sentence": "By next week, my brother will have made pasta.",
      "verb": "made"
    },
    {
      "sentence": "The bird will have caught the toy by next week.",
      "verb": "caught"
    },
    {
      "sentence": "The dog will have chased the ball by next week.",
      "verb": "chased"
    },
    {
      "sentence": "Our neighbors will have drunk a smoothie by soon.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have cooked a cake by next year.",
      "verb": "cooked"
    },
    {
      "sentence": "Emma will have organized the bathroom by then.",
      "verb": "organized"
    },
    {
      "sentence": "We will have sketched a diagram by soon.",
      "verb": "sketched"
    },
    {
      "sentence": "We will have thought about the plan by soon.",
      "verb": "thought"
    },
    {
      "sentence": "By later, the manager will have created a project.",
      "verb": "created"
    },
    {
      "sentence": "The manager will have started the proposal by this evening.",
      "verb": "started"
    },
    {
      "sentence": "By in two days, the bird will have slept all day.",
      "verb": "slept"
    },
    {
      "sentence": "She will have washed the bathroom by then.",
      "verb": "washed"
    },
    {
      "sentence": "The company will have completed the championship by then.",
      "verb": "completed"
    },
    {
      "sentence": "By later, my friend will have cooked a salad.",
      "verb": "cooked"
    },
    {
      "sentence": "They will have gotten a present by then.",
      "verb": "gotten"
    },
    {
      "sentence": "Sarah will have sold some clothes by then.",
      "verb": "sold"
    },
    {
      "sentence": "By next week, the company will have announced the championship.",
      "verb": "announced"
    },
    {
      "sentence": "By tonight, tom will have drunk milk.",
      "verb": "drunk"
    },
    {
      "sentence": "You will have drunk a smoothie by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By soon, we will have contacted my family.",
      "verb": "contacted"
    },
    {
      "sentence": "By soon, my brother will have submitted the proposal.",
      "verb": "submitted"
    },
    {
      "sentence": "John will have texted the teacher by then.",
      "verb": "texted"
    },
    {
      "sentence": "My parents will have listened to the lecture by then.",
      "verb": "listened"
    },
    {
      "sentence": "My parents will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "The children will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "By tomorrow, her sister will have designed a house.",
      "verb": "designed"
    },
    {
      "sentence": "Sarah will have created a plan by then.",
      "verb": "created"
    },
    {
      "sentence": "By soon, the bird will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "They will have played video games by next week.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have eaten its dinner by this weekend.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have played golf by then.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have played video games by then.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, our neighbors will have washed the dishes.",
      "verb": "washed"
    },
    {
      "sentence": "The bird will have played with its owner by later.",
      "verb": "played"
    },
    {
      "sentence": "My friend will have listened to music by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "Our neighbors will have had lunch by then.",
      "verb": "had"
    },
    {
      "sentence": "The cat will have slept on the couch by next month.",
      "verb": "slept"
    },
    {
      "sentence": "We will have seen my parents by this weekend.",
      "verb": "seen"
    },
    {
      "sentence": "My parents will have tidied the car by next month.",
      "verb": "tidied"
    },
    {
      "sentence": "By next year, he will have visited the client.",
      "verb": "visited"
    },
    {
      "sentence": "The teacher will have eaten pasta by later.",
      "verb": "eaten"
    },
    {
      "sentence": "The students will have drawn a landscape by later.",
      "verb": "drawn"
    },
    {
      "sentence": "Her sister will have met an old friend by then.",
      "verb": "met"
    },
    {
      "sentence": "The cat will have slept on the bed by this evening.",
      "verb": "slept"
    },
    {
      "sentence": "He will have planned the vacation by then.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, he will have spoken to the teacher.",
      "verb": "spoken"
    },
    {
      "sentence": "By later, our neighbors will have designed a house.",
      "verb": "designed"
    },
    {
      "sentence": "Her sister will have gotten some clothes by next month.",
      "verb": "gotten"
    },
    {
      "sentence": "By tomorrow, he will have decided on the meeting.",
      "verb": "decided"
    },
    {
      "sentence": "The children will have washed the room by then.",
      "verb": "washed"
    },
    {
      "sentence": "By later, the manager will have learned French.",
      "verb": "learned"
    },
    {
      "sentence": "The children will have visited my parents by next week.",
      "verb": "visited"
    },
    {
      "sentence": "I will have visited my family by in two days.",
      "verb": "visited"
    },
    {
      "sentence": "By this evening, the children will have visited the teacher.",
      "verb": "visited"
    },
    {
      "sentence": "By tomorrow, the manager will have contacted the team.",
      "verb": "contacted"
    },
    {
      "sentence": "You will have planned the decision by tonight.",
      "verb": "planned"
    },
    {
      "sentence": "They will have baked a meal by next week.",
      "verb": "baked"
    },
    {
      "sentence": "By this weekend, the dog will have slept in the sun.",
      "verb": "slept"
    },
    {
      "sentence": "By this weekend, tom will have watched a show.",
      "verb": "watched"
    },
    {
      "sentence": "They will have practiced science by then.",
      "verb": "practiced"
    },
    {
      "sentence": "They will have listened to the news by next month.",
      "verb": "listened"
    },
    {
      "sentence": "The company will have won the contract by this weekend.",
      "verb": "won"
    },
    {
      "sentence": "By next year, she will have made soup.",
      "verb": "made"
    },
    {
      "sentence": "The students will have studied French by next year.",
      "verb": "studied"
    },
    {
      "sentence": "Our neighbors will have sold the keys by then.",
      "verb": "sold"
    },
    {
      "sentence": "Our neighbors will have sketched a poster by then.",
      "verb": "sketched"
    },
    {
      "sentence": "He will have taught science by this evening.",
      "verb": "taught"
    },
    {
      "sentence": "Her sister will have read vocabulary by then.",
      "verb": "read"
    },
    {
      "sentence": "By tonight, he will have had some fruit.",
      "verb": "had"
    },
    {
      "sentence": "By next year, the cat will have chased the other pets.",
      "verb": "chased"
    },
    {
      "sentence": "My parents will have come to school by then.",
      "verb": "come"
    },
    {
      "sentence": "The cat will have run in circles by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "The bird will have played in the park by later.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, the teacher will have organized the bathroom.",
      "verb": "organized"
    },
    {
      "sentence": "The children will have talked to my friend by this weekend.",
      "verb": "talked"
    },
    {
      "sentence": "Her sister will have learned grammar by this weekend.",
      "verb": "learned"
    },
    {
      "sentence": "Our neighbors will have played soccer by then.",
      "verb": "played"
    },
    {
      "sentence": "The students will have spoken with the doctor by in two days.",
      "verb": "spoken"
    },
    {
      "sentence": "The bird will have caught a butterfly by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "By later, the bird will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "By soon, the cat will have slept by the window.",
      "verb": "slept"
    },
    {
      "sentence": "The manager will have eaten a meal by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have sketched a portrait by tomorrow.",
      "verb": "sketched"
    },
    {
      "sentence": "By next year, the students will have sent the report.",
      "verb": "sent"
    },
    {
      "sentence": "My brother will have painted a portrait by next month.",
      "verb": "painted"
    },
    {
      "sentence": "The cat will have played with the other pets by next month.",
      "verb": "played"
    },
    {
      "sentence": "She will have drawn a design by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By next year, we will have written the task.",
      "verb": "written"
    },
    {
      "sentence": "By next year, john will have repaired the machine.",
      "verb": "repaired"
    },
    {
      "sentence": "By in two days, our neighbors will have considered the options.",
      "verb": "considered"
    },
    {
      "sentence": "Our neighbors will have spoken to the doctor by tonight.",
      "verb": "spoken"
    },
    {
      "sentence": "The cat will have chased birds in the garden by soon.",
      "verb": "chased"
    },
    {
      "sentence": "Her sister will have baked a meal by then.",
      "verb": "baked"
    },
    {
      "sentence": "Her sister will have prepared the project by next month.",
      "verb": "prepared"
    },
    {
      "sentence": "By in two days, the company will have launched the software.",
      "verb": "launched"
    },
    {
      "sentence": "The dog will have slept on the bed by then.",
      "verb": "slept"
    },
    {
      "sentence": "By next year, the cat will have run in the park.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have talked to the client by tomorrow.",
      "verb": "talked"
    },
    {
      "sentence": "Sarah will have played football by then.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have drawn a portrait by tonight.",
      "verb": "drawn"
    },
    {
      "sentence": "By tomorrow, john will have played golf.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, the dog will have caught a butterfly.",
      "verb": "caught"
    },
    {
      "sentence": "By later, the dog will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "Emma will have emailed my parents by then.",
      "verb": "emailed"
    },
    {
      "sentence": "By later, emma will have washed the room.",
      "verb": "washed"
    },
    {
      "sentence": "By in two days, john will have repaired the computer.",
      "verb": "repaired"
    },
    {
      "sentence": "The students will have given a laptop by this evening.",
      "verb": "given"
    },
    {
      "sentence": "You will have visited the neighbors by then.",
      "verb": "visited"
    },
    {
      "sentence": "I will have thought about the future by then.",
      "verb": "thought"
    },
    {
      "sentence": "My friend will have washed the dishes by next month.",
      "verb": "washed"
    },
    {
      "sentence": "By later, her sister will have drunk tea.",
      "verb": "drunk"
    },
    {
      "sentence": "The bird will have slept on the bed by next week.",
      "verb": "slept"
    },
    {
      "sentence": "My friend will have drunk milk by tonight.",
      "verb": "drunk"
    },
    {
      "sentence": "The cat will have played in the garden by then.",
      "verb": "played"
    },
    {
      "sentence": "By next week, my brother will have created a plan.",
      "verb": "created"
    },
    {
      "sentence": "By later, the bird will have run in circles.",
      "verb": "run"
    },
    {
      "sentence": "My brother will have listened to a song by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "The bird will have slept under the table by soon.",
      "verb": "slept"
    },
    {
      "sentence": "She will have repaired the computer by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By tomorrow, she will have had some fruit.",
      "verb": "had"
    },
    {
      "sentence": "The manager will have eaten pizza by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have played volleyball by then.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have designed a prototype by tonight.",
      "verb": "designed"
    },
    {
      "sentence": "By next year, the students will have sold a book.",
      "verb": "sold"
    },
    {
      "sentence": "The children will have had some fruit by in two days.",
      "verb": "had"
    },
    {
      "sentence": "You will have fixed the computer by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By in two days, the bird will have slept on the couch.",
      "verb": "slept"
    },
    {
      "sentence": "Sarah will have visited the neighbors by then.",
      "verb": "visited"
    },
    {
      "sentence": "The manager will have submitted the report by later.",
      "verb": "submitted"
    },
    {
      "sentence": "Our neighbors will have listened to a song by then.",
      "verb": "listened"
    },
    {
      "sentence": "Tom will have visited the manager by in two days.",
      "verb": "visited"
    },
    {
      "sentence": "Our neighbors will have built a project by soon.",
      "verb": "built"
    },
    {
      "sentence": "Sarah will have listened to jazz by next year.",
      "verb": "listened"
    },
    {
      "sentence": "My friend will have received the project by then.",
      "verb": "received"
    },
    {
      "sentence": "By in two days, the teacher will have contacted the boss.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, i will have made a cake.",
      "verb": "made"
    },
    {
      "sentence": "By this weekend, my brother will have read the material.",
      "verb": "read"
    },
    {
      "sentence": "She will have painted an illustration by in two days.",
      "verb": "painted"
    },
    {
      "sentence": "By this evening, the students will have seen my grandmother.",
      "verb": "seen"
    },
    {
      "sentence": "By this weekend, you will have watched a show.",
      "verb": "watched"
    },
    {
      "sentence": "John will have drunk milk by soon.",
      "verb": "drunk"
    },
    {
      "sentence": "The cat will have run in circles by then.",
      "verb": "run"
    },
    {
      "sentence": "They will have bought the phone by then.",
      "verb": "bought"
    },
    {
      "sentence": "By next week, emma will have designed a prototype.",
      "verb": "designed"
    },
    {
      "sentence": "Our neighbors will have sold a book by then.",
      "verb": "sold"
    },
    {
      "sentence": "By in two days, the cat will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "She will have eaten lunch by in two days.",
      "verb": "eaten"
    },
    {
      "sentence": "The manager will have washed the clothes by this evening.",
      "verb": "washed"
    },
    {
      "sentence": "By next week, the cat will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "Emma will have visited the client by next week.",
      "verb": "visited"
    },
    {
      "sentence": "By next week, emma will have seen my parents.",
      "verb": "seen"
    },
    {
      "sentence": "By soon, the company will have won the deal.",
      "verb": "won"
    },
    {
      "sentence": "John will have sketched a picture by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By this weekend, my parents will have found flowers.",
      "verb": "found"
    },
    {
      "sentence": "By this weekend, the cat will have caught a butterfly.",
      "verb": "caught"
    },
    {
      "sentence": "By later, the students will have built a model.",
      "verb": "built"
    },
    {
      "sentence": "The bird will have played with the other pets by then.",
      "verb": "played"
    },
    {
      "sentence": "He will have watched a video by then.",
      "verb": "watched"
    },
    {
      "sentence": "The teacher will have emailed the team by then.",
      "verb": "emailed"
    },
    {
      "sentence": "She will have sold a new house by next week.",
      "verb": "sold"
    },
    {
      "sentence": "By this evening, i will have spoken to the doctor.",
      "verb": "spoken"
    },
    {
      "sentence": "They will have contacted the client by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By next week, our neighbors will have spoken to the teacher.",
      "verb": "spoken"
    },
    {
      "sentence": "The bird will have played in the park by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have texted the manager by tomorrow.",
      "verb": "texted"
    },
    {
      "sentence": "The team will have developed a new product by in two days.",
      "verb": "developed"
    },
    {
      "sentence": "By soon, we will have listened to the news.",
      "verb": "listened"
    },
    {
      "sentence": "Her sister will have texted my family by then.",
      "verb": "texted"
    },
    {
      "sentence": "By this evening, emma will have sketched a diagram.",
      "verb": "sketched"
    },
    {
      "sentence": "You will have spoken with my parents by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By next week, we will have washed the car.",
      "verb": "washed"
    },
    {
      "sentence": "The children will have walked to the office by then.",
      "verb": "walked"
    },
    {
      "sentence": "We will have played football by then.",
      "verb": "played"
    },
    {
      "sentence": "The children will have contacted the office by then.",
      "verb": "contacted"
    },
    {
      "sentence": "My friend will have drunk some water by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have caught a bird by later.",
      "verb": "caught"
    },
    {
      "sentence": "By tomorrow, tom will have completed the contract.",
      "verb": "completed"
    },
    {
      "sentence": "We will have emailed the teacher by next year.",
      "verb": "emailed"
    },
    {
      "sentence": "By next week, the cat will have slept on the bed.",
      "verb": "slept"
    },
    {
      "sentence": "She will have played tennis by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have drunk juice by next year.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have played with its owner by then.",
      "verb": "played"
    },
    {
      "sentence": "We will have met my family by then.",
      "verb": "met"
    },
    {
      "sentence": "The teacher will have called the boss by then.",
      "verb": "called"
    },
    {
      "sentence": "By tonight, john will have sketched a diagram.",
      "verb": "sketched"
    },
    {
      "sentence": "By tomorrow, the cat will have eaten the leftover food.",
      "verb": "eaten"
    },
    {
      "sentence": "By tomorrow, the cat will have caught a butterfly.",
      "verb": "caught"
    },
    {
      "sentence": "Sarah will have spoken to the boss by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The cat will have caught the frisbee by tomorrow.",
      "verb": "caught"
    },
    {
      "sentence": "By soon, her sister will have emailed the office.",
      "verb": "emailed"
    },
    {
      "sentence": "He will have texted my family by then.",
      "verb": "texted"
    },
    {
      "sentence": "My brother will have watched the match by soon.",
      "verb": "watched"
    },
    {
      "sentence": "By this weekend, the manager will have watched TV.",
      "verb": "watched"
    },
    {
      "sentence": "They will have learned Spanish by then.",
      "verb": "learned"
    },
    {
      "sentence": "My friend will have created a presentation by in two days.",
      "verb": "created"
    },
    {
      "sentence": "By later, the dog will have chased the other pets.",
      "verb": "chased"
    },
    {
      "sentence": "John will have gotten a gift by soon.",
      "verb": "gotten"
    },
    {
      "sentence": "By this weekend, they will have considered the event.",
      "verb": "considered"
    },
    {
      "sentence": "She will have made a meal by then.",
      "verb": "made"
    },
    {
      "sentence": "By next year, they will have eaten a sandwich.",
      "verb": "eaten"
    },
    {
      "sentence": "Sarah will have drunk tea by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The cat will have run in the park by later.",
      "verb": "run"
    },
    {
      "sentence": "My friend will have visited my grandmother by soon.",
      "verb": "visited"
    },
    {
      "sentence": "The manager will have played video games by soon.",
      "verb": "played"
    },
    {
      "sentence": "By later, my brother will have contacted the boss.",
      "verb": "contacted"
    },
    {
      "sentence": "I will have fixed the fence by tonight.",
      "verb": "fixed"
    },
    {
      "sentence": "By next week, our neighbors will have played football.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, emma will have listened to jazz.",
      "verb": "listened"
    },
    {
      "sentence": "The bird will have caught the mouse by this weekend.",
      "verb": "caught"
    },
    {
      "sentence": "Emma will have watched a video by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "The bird will have run through the grass by then.",
      "verb": "run"
    },
    {
      "sentence": "The dog will have run across the field by then.",
      "verb": "run"
    },
    {
      "sentence": "The teacher will have eaten some fruit by then.",
      "verb": "eaten"
    },
    {
      "sentence": "My brother will have tidied the car by then.",
      "verb": "tidied"
    },
    {
      "sentence": "By next year, the manager will have eaten pizza.",
      "verb": "eaten"
    },
    {
      "sentence": "By tonight, the dog will have chased birds in the garden.",
      "verb": "chased"
    },
    {
      "sentence": "The manager will have repaired the computer by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By later, the manager will have studied science.",
      "verb": "studied"
    },
    {
      "sentence": "He will have created a plan by this evening.",
      "verb": "created"
    },
    {
      "sentence": "The cat will have chased the ball by later.",
      "verb": "chased"
    },
    {
      "sentence": "By next week, sarah will have played golf.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have visited the client by then.",
      "verb": "visited"
    },
    {
      "sentence": "The cat will have caught the frisbee by later.",
      "verb": "caught"
    },
    {
      "sentence": "By soon, the dog will have played in the yard.",
      "verb": "played"
    },
    {
      "sentence": "The company will have announced the software by then.",
      "verb": "announced"
    },
    {
      "sentence": "I will have tidied the room by then.",
      "verb": "tidied"
    },
    {
      "sentence": "By this weekend, tom will have finished the report.",
      "verb": "finished"
    },
    {
      "sentence": "By in two days, the cat will have chased the mouse.",
      "verb": "chased"
    },
    {
      "sentence": "By next week, the cat will have run around the house.",
      "verb": "run"
    },
    {
      "sentence": "You will have tidied the bathroom by tonight.",
      "verb": "tidied"
    },
    {
      "sentence": "The cat will have run across the field by then.",
      "verb": "run"
    },
    {
      "sentence": "I will have had pasta by then.",
      "verb": "had"
    },
    {
      "sentence": "By later, we will have had pizza.",
      "verb": "had"
    },
    {
      "sentence": "The team will have completed the contract by then.",
      "verb": "completed"
    },
    {
      "sentence": "By this weekend, the cat will have eaten quickly.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, emma will have texted my family.",
      "verb": "texted"
    },
    {
      "sentence": "By this evening, the dog will have chased its tail.",
      "verb": "chased"
    },
    {
      "sentence": "The teacher will have visited my family by then.",
      "verb": "visited"
    },
    {
      "sentence": "By tomorrow, we will have baked breakfast.",
      "verb": "baked"
    },
    {
      "sentence": "The teacher will have played video games by next year.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, you will have had some fruit.",
      "verb": "had"
    },
    {
      "sentence": "By this evening, the dog will have played in the garden.",
      "verb": "played"
    },
    {
      "sentence": "The team will have developed the project by next month.",
      "verb": "developed"
    },
    {
      "sentence": "The dog will have eaten its dinner by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have prepared the proposal by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By soon, the dog will have run across the field.",
      "verb": "run"
    },
    {
      "sentence": "The students will have thought about the plan by then.",
      "verb": "thought"
    },
    {
      "sentence": "By next year, emma will have repaired the computer.",
      "verb": "repaired"
    },
    {
      "sentence": "I will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have repaired the computer by tomorrow.",
      "verb": "repaired"
    },
    {
      "sentence": "Sarah will have left to the park by tonight.",
      "verb": "left"
    },
    {
      "sentence": "The bird will have slept on the bed by tonight.",
      "verb": "slept"
    },
    {
      "sentence": "My parents will have sketched a design by then.",
      "verb": "sketched"
    },
    {
      "sentence": "By in two days, the company will have released a new product.",
      "verb": "released"
    },
    {
      "sentence": "By next month, the students will have watched the match.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, the team will have released the deal.",
      "verb": "released"
    },
    {
      "sentence": "By soon, sarah will have bought the phone.",
      "verb": "bought"
    },
    {
      "sentence": "She will have had a sandwich by next week.",
      "verb": "had"
    },
    {
      "sentence": "We will have planned the trip by soon.",
      "verb": "planned"
    },
    {
      "sentence": "The company will have developed the deal by then.",
      "verb": "developed"
    },
    {
      "sentence": "My friend will have played tennis by then.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have played in the yard by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "The teacher will have spoken to the doctor by next week.",
      "verb": "spoken"
    },
    {
      "sentence": "My friend will have taught grammar by this evening.",
      "verb": "taught"
    },
    {
      "sentence": "The cat will have chased the other pets by then.",
      "verb": "chased"
    },
    {
      "sentence": "By next year, john will have arrived to the bank.",
      "verb": "arrived"
    },
    {
      "sentence": "The manager will have listened to the lecture by later.",
      "verb": "listened"
    },
    {
      "sentence": "We will have understood French by this weekend.",
      "verb": "understood"
    },
    {
      "sentence": "The students will have planned the situation by then.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, the bird will have caught the toy.",
      "verb": "caught"
    },
    {
      "sentence": "The team will have announced the project by then.",
      "verb": "announced"
    },
    {
      "sentence": "By tonight, our neighbors will have cooked a meal.",
      "verb": "cooked"
    },
    {
      "sentence": "By soon, you will have drunk coffee.",
      "verb": "drunk"
    },
    {
      "sentence": "By tomorrow, the manager will have created a presentation.",
      "verb": "created"
    },
    {
      "sentence": "You will have practiced science by next month.",
      "verb": "practiced"
    },
    {
      "sentence": "John will have bought flowers by then.",
      "verb": "bought"
    },
    {
      "sentence": "The cat will have slept under the table by then.",
      "verb": "slept"
    },
    {
      "sentence": "The manager will have painted a diagram by this evening.",
      "verb": "painted"
    }
  ]
}