{
  "tense": "Future Perfect Continuous",
  "description": "Used for actions that will have been ongoing until a future point",
  "examples": [
    {
      "sentence": "By tomorrow, we will have been running to the library.",
      "verb": "running"
    },
    {
      "sentence": "Next month, john will have been meeting the client since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the bird will have been listening to basketball all day.",
      "verb": "listening"
    },
    {
      "sentence": "The bird will have been arriving to school since yesterday by next year.",
      "verb": "arriving"
    },
    {
      "sentence": "The cat will have been cooking pizza all day by next year.",
      "verb": "cooking"
    },
    {
      "sentence": "She will have been selling flowers for years by in two days.",
      "verb": "selling"
    },
    {
      "sentence": "By next year, the dog will have been starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "We will have been playing a movie for two hours by next year.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, they will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, my parents will have been making tea all week.",
      "verb": "making"
    },
    {
      "sentence": "We will have been talking the neighbors all day by next week.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, my brother will have been meeting the boss since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, tom will have been completing the assignment since morning.",
      "verb": "completing"
    },
    {
      "sentence": "By next year, the cat will have been meeting the teacher.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, the manager will have been planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, her sister will have been considering the meeting for a month.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, we will have been driving downtown since yesterday.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, she will have been choosing a gift all week.",
      "verb": "choosing"
    },
    {
      "sentence": "The manager will have been ordering a salad for years by later.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, the cat will have been completing the email for a week.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, you will have been running to the library.",
      "verb": "running"
    },
    {
      "sentence": "Next month, tom will have been watching TV since morning.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, we will have been finding a new car since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "By in two days, she will have been studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "By tonight, the company will have been watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, tom will have been visiting the boss for years.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, my friend will have been meeting the neighbors all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By soon, we will have been reviewing French.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, he will have been cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend will have been visiting the manager for three days by this weekend.",
      "verb": "visiting"
    },
    {
      "sentence": "By next week, the manager will have been playing TV.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, i will have been enjoying the news.",
      "verb": "enjoying"
    },
    {
      "sentence": "The children will have been enjoying pizza for years by next month.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, my parents will have been starting the assignment for two hours.",
      "verb": "starting"
    },
    {
      "sentence": "You will have been making a snack since morning by tonight.",
      "verb": "making"
    },
    {
      "sentence": "The dog will have been teaching mathematics for a month by tomorrow.",
      "verb": "teaching"
    },
    {
      "sentence": "We will have been choosing a book since Monday by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "By tomorrow, we will have been coming to the library.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, the bird will have been fixing the furniture for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents will have been getting the ticket for a month by later.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, tom will have been drinking pizza all day.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, our neighbors will have been planning the future for a week.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, i will have been cleaning a website since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, the bird will have been sending the presentation.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, sarah will have been running to the park for a month.",
      "verb": "running"
    },
    {
      "sentence": "The children will have been cooking a snack for a month by this weekend.",
      "verb": "cooking"
    },
    {
      "sentence": "The cat will have been choosing a book since morning by in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "By in two days, the cat will have been giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "The children will have been enjoying dinner for a week by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird will have been sending the report for two hours by tonight.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, my parents will have been ordering a snack since Monday.",
      "verb": "ordering"
    },
    {
      "sentence": "You will have been eating a salad for three days by tonight.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been ordering tea for a month by next year.",
      "verb": "ordering"
    },
    {
      "sentence": "By next week, the children will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, my parents will have been finding flowers since morning.",
      "verb": "finding"
    },
    {
      "sentence": "My friend will have been arriving to the office since yesterday by soon.",
      "verb": "arriving"
    },
    {
      "sentence": "By this weekend, the students will have been coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, i will have been choosing a present since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "Tom will have been eating juice for two hours by tonight.",
      "verb": "eating"
    },
    {
      "sentence": "My friend will have been submitting the proposal all week by tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "By this evening, our neighbors will have been preparing pasta.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird will have been learning science since Monday by soon.",
      "verb": "learning"
    },
    {
      "sentence": "By this evening, the teacher will have been listening to a video.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, her sister will have been buying a new car.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, tom will have been cooking a sandwich since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "Our neighbors will have been reviewing grammar since yesterday by next month.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, sarah will have been enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "I will have been planning the birthday all day by in two days.",
      "verb": "planning"
    },
    {
      "sentence": "By next week, the team will have been writing the document.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, they will have been fixing the kitchen since morning.",
      "verb": "fixing"
    },
    {
      "sentence": "By in two days, she will have been listening to the game.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, we will have been leaving to school.",
      "verb": "leaving"
    },
    {
      "sentence": "By this evening, emma will have been contacting the boss.",
      "verb": "contacting"
    },
    {
      "sentence": "Emma will have been making a salad all day by in two days.",
      "verb": "making"
    },
    {
      "sentence": "Next month, my friend will have been visiting my friend for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, sarah will have been painting the room.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, her sister will have been arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "You will have been choosing the ticket for a week by next year.",
      "verb": "choosing"
    },
    {
      "sentence": "The teacher will have been planning the problem all week by later.",
      "verb": "planning"
    },
    {
      "sentence": "By this weekend, sarah will have been teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, my brother will have been painting the furniture for years.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, sarah will have been calling the teacher for three days.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, our neighbors will have been watching a song for years.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, my parents will have been thinking about the decision for two hours.",
      "verb": "thinking"
    },
    {
      "sentence": "The dog will have been starting the assignment for three days by next month.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, she will have been considering the future for a month.",
      "verb": "considering"
    },
    {
      "sentence": "By tomorrow, you will have been cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, emma will have been playing the news for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the cat will have been running home.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the teacher will have been writing the letter for a week.",
      "verb": "writing"
    },
    {
      "sentence": "John will have been remembering the event since yesterday by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "By later, the dog will have been calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, my parents will have been buying a book all week.",
      "verb": "buying"
    },
    {
      "sentence": "By this evening, he will have been running to school.",
      "verb": "running"
    },
    {
      "sentence": "The children will have been listening to a video for a month by tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "Emma will have been forgetting the future for a week by this weekend.",
      "verb": "forgetting"
    },
    {
      "sentence": "By this weekend, the teacher will have been designing the room.",
      "verb": "designing"
    },
    {
      "sentence": "The manager will have been giving the ticket since Monday by in two days.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the team will have been starting the proposal all week.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, the children will have been considering the trip all week.",
      "verb": "considering"
    },
    {
      "sentence": "By soon, i will have been designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, he will have been studying the chapter all day.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, emma will have been listening to a movie for a week.",
      "verb": "listening"
    },
    {
      "sentence": "By later, the manager will have been drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the children will have been selling a new car for three days.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, my parents will have been selling a gift for a month.",
      "verb": "selling"
    },
    {
      "sentence": "He will have been finding groceries for a month by this evening.",
      "verb": "finding"
    },
    {
      "sentence": "The cat will have been driving to school for years by later.",
      "verb": "driving"
    },
    {
      "sentence": "The children will have been watching the game for a month by next year.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, the children will have been fixing the garden.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom will have been building the house for years by this weekend.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the manager will have been considering the event since Monday.",
      "verb": "considering"
    },
    {
      "sentence": "By tonight, my parents will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the company will have been drinking coffee for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "By in two days, the children will have been reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, the team will have been considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "The dog will have been finding clothes for a week by tomorrow.",
      "verb": "finding"
    },
    {
      "sentence": "By tonight, my parents will have been writing the email.",
      "verb": "writing"
    },
    {
      "sentence": "By next year, i will have been writing the email.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will have been speaking the neighbors since Monday by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, her sister will have been fixing the house all week.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, john will have been leaving to school for years.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, the team will have been watching a documentary for a month.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will have been returning downtown all week by next week.",
      "verb": "returning"
    },
    {
      "sentence": "By next month, he will have been selling the phone.",
      "verb": "selling"
    },
    {
      "sentence": "By tomorrow, the company will have been drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "The manager will have been leaving downtown for three days by in two days.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, my parents will have been learning science for years.",
      "verb": "learning"
    },
    {
      "sentence": "Tom will have been preparing a snack for a week by in two days.",
      "verb": "preparing"
    },
    {
      "sentence": "The company will have been planning the meeting since yesterday by next year.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, my parents will have been repairing the computer since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager will have been running to the store for a month by next year.",
      "verb": "running"
    },
    {
      "sentence": "Next month, sarah will have been speaking the client for years.",
      "verb": "speaking"
    },
    {
      "sentence": "By next week, the students will have been understanding mathematics.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, he will have been getting a book all day.",
      "verb": "getting"
    },
    {
      "sentence": "Tom will have been cleaning the car for three days by this weekend.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next week, her sister will have been studying the textbook.",
      "verb": "studying"
    },
    {
      "sentence": "By tonight, tom will have been listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the manager will have been planning the options.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, the cat will have been cooking tea for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, john will have been listening to a documentary since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "They will have been flying to the beach for three days by this weekend.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher will have been remembering the event for two hours by this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, our neighbors will have been speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the teacher will have been reviewing English since Monday.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will have been planning the situation for years by next week.",
      "verb": "planning"
    },
    {
      "sentence": "John will have been preparing coffee for two hours by tonight.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the cat will have been completing the presentation since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "By tomorrow, she will have been drawing the computer.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, you will have been repairing the bathroom.",
      "verb": "repairing"
    },
    {
      "sentence": "Her sister will have been thinking about the trip for a month by this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "I will have been meeting the boss for years by in two days.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, our neighbors will have been calling the team for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, her sister will have been remembering the situation for a week.",
      "verb": "remembering"
    },
    {
      "sentence": "I will have been walking to the beach all day by next year.",
      "verb": "walking"
    },
    {
      "sentence": "We will have been talking my friend all week by this weekend.",
      "verb": "talking"
    },
    {
      "sentence": "The students will have been selling a present for years by this evening.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, her sister will have been painting the house all week.",
      "verb": "painting"
    },
    {
      "sentence": "The manager will have been remembering the trip for a week by later.",
      "verb": "remembering"
    },
    {
      "sentence": "By soon, the students will have been receiving the letter.",
      "verb": "receiving"
    },
    {
      "sentence": "We will have been forgetting the vacation for a week by later.",
      "verb": "forgetting"
    },
    {
      "sentence": "By later, the children will have been teaching for the exam.",
      "verb": "teaching"
    },
    {
      "sentence": "By later, my brother will have been completing the application.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, our neighbors will have been considering the event since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister will have been thinking about the birthday for a month by this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "By later, the children will have been running to the market.",
      "verb": "running"
    },
    {
      "sentence": "By soon, sarah will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the teacher will have been thinking about the decision for two hours.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the students will have been cooking a salad for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, she will have been buying clothes since morning.",
      "verb": "buying"
    },
    {
      "sentence": "By soon, the cat will have been listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the manager will have been playing a song all week.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, you will have been talking the teacher for three days.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, they will have been choosing a laptop.",
      "verb": "choosing"
    },
    {
      "sentence": "By later, john will have been playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, she will have been ordering a sandwich for a month.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, he will have been planning the event for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, she will have been reading the lesson for a month.",
      "verb": "reading"
    },
    {
      "sentence": "The manager will have been ordering pasta since Monday by in two days.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, i will have been understanding history all week.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, my parents will have been getting a laptop for a month.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, he will have been designing the house since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "The bird will have been driving to the store for years by in two days.",
      "verb": "driving"
    },
    {
      "sentence": "By in two days, my brother will have been watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the children will have been completing the proposal since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "Sarah will have been speaking the boss all week by next year.",
      "verb": "speaking"
    },
    {
      "sentence": "By in two days, we will have been talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, i will have been understanding history for two hours.",
      "verb": "understanding"
    },
    {
      "sentence": "I will have been finishing the document since yesterday by this evening.",
      "verb": "finishing"
    },
    {
      "sentence": "The children will have been enjoying a documentary for a month by next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, my brother will have been choosing the ticket since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "You will have been sending the proposal since morning by this evening.",
      "verb": "sending"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, john will have been repairing the furniture since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, john will have been speaking the neighbors for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "She will have been submitting the task for a week by tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, tom will have been leaving to the market for three days.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, they will have been contacting the team since yesterday.",
      "verb": "contacting"
    },
    {
      "sentence": "The team will have been running to the park for a week by this evening.",
      "verb": "running"
    },
    {
      "sentence": "The bird will have been practicing science for three days by tonight.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat will have been making lunch since morning by soon.",
      "verb": "making"
    },
    {
      "sentence": "Next month, tom will have been building the bathroom since yesterday.",
      "verb": "building"
    },
    {
      "sentence": "Next month, we will have been visiting my family since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "By next week, john will have been submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "She will have been calling the client all day by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "By next week, you will have been building the furniture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, emma will have been practicing the textbook since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, you will have been writing the application for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "By this weekend, we will have been practicing the textbook.",
      "verb": "practicing"
    },
    {
      "sentence": "By next week, tom will have been buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, he will have been choosing the ticket for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "The teacher will have been forgetting the situation for three days by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next year, the team will have been playing a movie.",
      "verb": "playing"
    },
    {
      "sentence": "Tom will have been considering the meeting for three days by tonight.",
      "verb": "considering"
    },
    {
      "sentence": "The bird will have been cooking a salad for a month by soon.",
      "verb": "cooking"
    },
    {
      "sentence": "By this evening, the teacher will have been eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been reading for the exam for three days by next month.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, tom will have been playing the game for years.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the company will have been thinking about the situation for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "They will have been finding the ticket since Monday by tonight.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, the team will have been playing basketball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been preparing pizza for years by this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the company will have been finding the phone for years.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, emma will have been running downtown for a week.",
      "verb": "running"
    },
    {
      "sentence": "By next month, we will have been painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "The company will have been speaking my parents since yesterday by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "He will have been buying flowers for a week by tonight.",
      "verb": "buying"
    },
    {
      "sentence": "By later, i will have been enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, she will have been receiving the task all week.",
      "verb": "receiving"
    },
    {
      "sentence": "You will have been submitting the contract all week by tonight.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, her sister will have been drinking lunch since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird will have been giving the keys since morning by soon.",
      "verb": "giving"
    },
    {
      "sentence": "They will have been running to the beach for three days by next year.",
      "verb": "running"
    },
    {
      "sentence": "John will have been talking the client for years by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, my friend will have been forgetting the options for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tomorrow, the manager will have been finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "The teacher will have been drinking coffee for a month by soon.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the bird will have been teaching English.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the manager will have been drinking pasta since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, they will have been considering the options since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "By next year, sarah will have been planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, my brother will have been selling the ticket all week.",
      "verb": "selling"
    },
    {
      "sentence": "By soon, emma will have been painting a website.",
      "verb": "painting"
    },
    {
      "sentence": "By later, our neighbors will have been reviewing French.",
      "verb": "reviewing"
    },
    {
      "sentence": "Our neighbors will have been planning the vacation for three days by soon.",
      "verb": "planning"
    },
    {
      "sentence": "The company will have been reading English all day by soon.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, the bird will have been giving clothes all week.",
      "verb": "giving"
    },
    {
      "sentence": "The children will have been submitting the assignment for years by next month.",
      "verb": "submitting"
    },
    {
      "sentence": "Emma will have been talking the client for years by next month.",
      "verb": "talking"
    },
    {
      "sentence": "She will have been reading science for two hours by tonight.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, i will have been planning the situation for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "Emma will have been meeting the client since morning by soon.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma will have been walking downtown for years by soon.",
      "verb": "walking"
    },
    {
      "sentence": "My brother will have been forgetting the situation since morning by next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students will have been making pizza all day by next year.",
      "verb": "making"
    },
    {
      "sentence": "By soon, our neighbors will have been building a website.",
      "verb": "building"
    },
    {
      "sentence": "He will have been running to the airport since morning by this weekend.",
      "verb": "running"
    },
    {
      "sentence": "My brother will have been walking to the beach all day by this evening.",
      "verb": "walking"
    },
    {
      "sentence": "Sarah will have been making juice for a month by tomorrow.",
      "verb": "making"
    },
    {
      "sentence": "Next month, the company will have been talking my friend since morning.",
      "verb": "talking"
    },
    {
      "sentence": "The company will have been leaving downtown for two hours by soon.",
      "verb": "leaving"
    },
    {
      "sentence": "By next month, he will have been cooking tea.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the dog will have been remembering the trip all day.",
      "verb": "remembering"
    },
    {
      "sentence": "Her sister will have been preparing a sandwich all day by later.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma will have been designing a website since morning by tomorrow.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, the children will have been watching a podcast since morning.",
      "verb": "watching"
    },
    {
      "sentence": "My brother will have been studying mathematics since Monday by this weekend.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my parents will have been making tea for two hours.",
      "verb": "making"
    },
    {
      "sentence": "My friend will have been considering the decision for a week by soon.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, she will have been making pasta for a week.",
      "verb": "making"
    },
    {
      "sentence": "By next month, the students will have been driving to the office.",
      "verb": "driving"
    },
    {
      "sentence": "Sarah will have been visiting the client for two hours by tonight.",
      "verb": "visiting"
    },
    {
      "sentence": "By next week, the manager will have been walking to the airport.",
      "verb": "walking"
    },
    {
      "sentence": "The cat will have been considering the options all day by this evening.",
      "verb": "considering"
    },
    {
      "sentence": "My brother will have been reading vocabulary for two hours by in two days.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, john will have been eating breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By later, the teacher will have been choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the students will have been choosing groceries for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird will have been forgetting the event for a week by soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "By this evening, they will have been finishing the letter.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, they will have been enjoying a snack since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "She will have been choosing the keys for a month by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, my friend will have been fixing the car for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, her sister will have been enjoying lunch for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, i will have been ordering a snack for years.",
      "verb": "ordering"
    },
    {
      "sentence": "By this evening, the team will have been buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, the company will have been painting a picture for three days.",
      "verb": "painting"
    },
    {
      "sentence": "The dog will have been driving to work for a month by this evening.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, she will have been coming to the beach for three days.",
      "verb": "coming"
    },
    {
      "sentence": "My parents will have been driving to the airport for a month by tomorrow.",
      "verb": "driving"
    },
    {
      "sentence": "By soon, the bird will have been finding the keys.",
      "verb": "finding"
    },
    {
      "sentence": "The students will have been cleaning the furniture for years by later.",
      "verb": "cleaning"
    },
    {
      "sentence": "By this evening, the teacher will have been calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "John will have been reviewing the chapter for two hours by later.",
      "verb": "reviewing"
    },
    {
      "sentence": "I will have been visiting the neighbors for a week by next year.",
      "verb": "visiting"
    },
    {
      "sentence": "The company will have been playing the game for a week by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, sarah will have been understanding the chapter all day.",
      "verb": "understanding"
    },
    {
      "sentence": "By this evening, the team will have been visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, i will have been watching a podcast since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "The company will have been enjoying a video since Monday by tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, the children will have been receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "By this evening, i will have been planning the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By next year, the team will have been making breakfast.",
      "verb": "making"
    },
    {
      "sentence": "By in two days, the teacher will have been studying the textbook.",
      "verb": "studying"
    },
    {
      "sentence": "The bird will have been visiting the teacher all day by tomorrow.",
      "verb": "visiting"
    },
    {
      "sentence": "By next year, john will have been remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "By later, the manager will have been speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "By next year, my friend will have been finding a gift.",
      "verb": "finding"
    },
    {
      "sentence": "By this evening, john will have been choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the manager will have been painting a website since Monday.",
      "verb": "painting"
    },
    {
      "sentence": "By soon, the dog will have been cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "The teacher will have been speaking my family since Monday by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, my parents will have been reading history for years.",
      "verb": "reading"
    },
    {
      "sentence": "He will have been writing the project all day by later.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will have been starting the project since morning by this weekend.",
      "verb": "starting"
    },
    {
      "sentence": "The manager will have been finding a new car since morning by soon.",
      "verb": "finding"
    },
    {
      "sentence": "By this evening, the team will have been listening to football.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will have been enjoying juice for a week by in two days.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next year, he will have been remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the students will have been speaking the boss for years.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister will have been walking to the airport for two hours by tonight.",
      "verb": "walking"
    },
    {
      "sentence": "Her sister will have been eating a salad for a week by next month.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, i will have been choosing a gift all day.",
      "verb": "choosing"
    },
    {
      "sentence": "Sarah will have been giving the keys for a month by later.",
      "verb": "giving"
    },
    {
      "sentence": "The dog will have been completing the task all week by in two days.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister will have been fixing the car for a week by tonight.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, john will have been practicing English all day.",
      "verb": "practicing"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "We will have been flying home since yesterday by in two days.",
      "verb": "flying"
    },
    {
      "sentence": "The students will have been making coffee since morning by soon.",
      "verb": "making"
    },
    {
      "sentence": "The team will have been ordering lunch for two hours by next week.",
      "verb": "ordering"
    },
    {
      "sentence": "The manager will have been driving to the beach for a month by tonight.",
      "verb": "driving"
    },
    {
      "sentence": "You will have been speaking my family all week by next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the students will have been drinking pizza since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "Our neighbors will have been cleaning the garden for three days by tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother will have been finding the phone for years by next year.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher will have been enjoying a video for three days by soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this evening, my friend will have been reading history.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister will have been understanding French since morning by next year.",
      "verb": "understanding"
    },
    {
      "sentence": "By tonight, john will have been finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "Her sister will have been visiting the teacher since yesterday by tomorrow.",
      "verb": "visiting"
    },
    {
      "sentence": "By later, my friend will have been ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, sarah will have been watching a song for years.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, we will have been receiving the document for years.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, emma will have been playing a video for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The manager will have been listening to a documentary all week by in two days.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the teacher will have been cooking juice for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "Her sister will have been thinking about the vacation for years by tonight.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, we will have been coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, sarah will have been fixing the bathroom all week.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother will have been playing basketball for two hours by next week.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the teacher will have been learning English.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, my parents will have been running to the store all week.",
      "verb": "running"
    },
    {
      "sentence": "You will have been watching a podcast all week by next month.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the company will have been visiting the teacher all day.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the bird will have been buying the keys since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "Our neighbors will have been drawing the kitchen for a month by next month.",
      "verb": "drawing"
    },
    {
      "sentence": "My parents will have been drinking breakfast for years by soon.",
      "verb": "drinking"
    },
    {
      "sentence": "By tomorrow, he will have been talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, the bird will have been driving to work since morning.",
      "verb": "driving"
    },
    {
      "sentence": "He will have been enjoying pasta for a month by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, john will have been forgetting the event for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, my friend will have been cleaning the furniture for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By this weekend, the cat will have been remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "The children will have been designing the computer all week by tonight.",
      "verb": "designing"
    },
    {
      "sentence": "They will have been choosing the ticket for three days by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the teacher will have been enjoying a podcast for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The cat will have been receiving the application for a month by next year.",
      "verb": "receiving"
    },
    {
      "sentence": "By next year, they will have been understanding vocabulary.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, the manager will have been choosing a laptop for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the cat will have been speaking the teacher since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog will have been receiving the email for three days by tonight.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, i will have been painting the car since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "By later, the bird will have been completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the teacher will have been sending the project since morning.",
      "verb": "sending"
    },
    {
      "sentence": "By next year, you will have been finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "We will have been finishing the letter for years by in two days.",
      "verb": "finishing"
    },
    {
      "sentence": "My brother will have been finishing the proposal for two hours by tonight.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, she will have been planning the vacation for a month.",
      "verb": "planning"
    },
    {
      "sentence": "The dog will have been remembering the decision since morning by later.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, i will have been writing the task all week.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, the students will have been playing the news all day.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will have been fixing the room since yesterday by tomorrow.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, my friend will have been leaving to the library for three days.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, the company will have been selling the keys for three days.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the team will have been playing the game for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, i will have been selling the keys since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "By in two days, i will have been getting groceries.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, john will have been listening to a documentary since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, her sister will have been forgetting the options since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, we will have been finishing the email for three days.",
      "verb": "finishing"
    },
    {
      "sentence": "John will have been remembering the event for a month by next year.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, he will have been submitting the project since yesterday.",
      "verb": "submitting"
    },
    {
      "sentence": "By tonight, the company will have been considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "The dog will have been thinking about the situation for three days by this evening.",
      "verb": "thinking"
    },
    {
      "sentence": "They will have been cleaning a picture for two hours by soon.",
      "verb": "cleaning"
    },
    {
      "sentence": "By this weekend, the team will have been completing the document.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, sarah will have been repairing the furniture all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By this weekend, the students will have been submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "By next week, the children will have been drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "By next year, sarah will have been getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "By this weekend, they will have been preparing a sandwich.",
      "verb": "preparing"
    },
    {
      "sentence": "By this weekend, the team will have been calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "By later, sarah will have been drawing a website.",
      "verb": "drawing"
    },
    {
      "sentence": "By in two days, they will have been cooking tea.",
      "verb": "cooking"
    },
    {
      "sentence": "My parents will have been running to the beach for three days by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the dog will have been playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my parents will have been finding a new car all day.",
      "verb": "finding"
    },
    {
      "sentence": "John will have been contacting the boss all week by next year.",
      "verb": "contacting"
    },
    {
      "sentence": "By soon, they will have been watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the dog will have been studying vocabulary all week.",
      "verb": "studying"
    },
    {
      "sentence": "The team will have been selling the keys since morning by tomorrow.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, emma will have been repairing the bathroom for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents will have been going downtown for a week by soon.",
      "verb": "going"
    },
    {
      "sentence": "My parents will have been leaving to the office since yesterday by later.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, the bird will have been sending the email for three days.",
      "verb": "sending"
    },
    {
      "sentence": "By this evening, emma will have been repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the team will have been walking downtown.",
      "verb": "walking"
    },
    {
      "sentence": "Tom will have been repairing the bathroom for years by next year.",
      "verb": "repairing"
    },
    {
      "sentence": "She will have been returning to the library all day by next month.",
      "verb": "returning"
    },
    {
      "sentence": "By tomorrow, my brother will have been submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, her sister will have been teaching the chapter for a month.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, my friend will have been repairing the bathroom for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, my brother will have been painting the room all week.",
      "verb": "painting"
    },
    {
      "sentence": "By soon, they will have been learning for the exam.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, he will have been leaving home.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, my brother will have been choosing a present all day.",
      "verb": "choosing"
    },
    {
      "sentence": "Her sister will have been driving to the beach all week by this evening.",
      "verb": "driving"
    },
    {
      "sentence": "You will have been remembering the options for three days by this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "The manager will have been playing a podcast since Monday by soon.",
      "verb": "playing"
    },
    {
      "sentence": "By later, the dog will have been teaching French.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the dog will have been teaching the textbook all week.",
      "verb": "teaching"
    },
    {
      "sentence": "By in two days, you will have been talking the doctor.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, our neighbors will have been receiving the letter for three days.",
      "verb": "receiving"
    },
    {
      "sentence": "The cat will have been selling a present for a month by this evening.",
      "verb": "selling"
    },
    {
      "sentence": "By next week, i will have been starting the presentation.",
      "verb": "starting"
    },
    {
      "sentence": "By this evening, my brother will have been submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, my friend will have been enjoying pizza since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "The cat will have been starting the contract for a month by next week.",
      "verb": "starting"
    },
    {
      "sentence": "By next week, she will have been running to work.",
      "verb": "running"
    },
    {
      "sentence": "By next year, tom will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By soon, her sister will have been enjoying a snack.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, you will have been getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "She will have been submitting the presentation for two hours by later.",
      "verb": "submitting"
    },
    {
      "sentence": "By in two days, my friend will have been driving to the library.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, she will have been remembering the decision all day.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, tom will have been building the car since Monday.",
      "verb": "building"
    },
    {
      "sentence": "Next month, my brother will have been walking to the beach since yesterday.",
      "verb": "walking"
    },
    {
      "sentence": "By soon, the manager will have been ordering lunch.",
      "verb": "ordering"
    },
    {
      "sentence": "He will have been coming home since Monday by next year.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, the cat will have been completing the email for a month.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, you will have been sending the email for a month.",
      "verb": "sending"
    },
    {
      "sentence": "By later, we will have been going to school.",
      "verb": "going"
    },
    {
      "sentence": "By next month, she will have been repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "By next week, she will have been buying the ticket.",
      "verb": "buying"
    },
    {
      "sentence": "My brother will have been talking my parents since Monday by later.",
      "verb": "talking"
    },
    {
      "sentence": "John will have been returning downtown since yesterday by this weekend.",
      "verb": "returning"
    },
    {
      "sentence": "The teacher will have been listening to a song all day by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the manager will have been playing football since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By later, my brother will have been speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the students will have been going to the market since Monday.",
      "verb": "going"
    },
    {
      "sentence": "The teacher will have been building the car since morning by next month.",
      "verb": "building"
    },
    {
      "sentence": "By soon, the students will have been meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "By this weekend, the children will have been building a picture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, my parents will have been finding a laptop since morning.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, my brother will have been designing the house for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "The students will have been remembering the future for years by next year.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the company will have been listening to the news all day.",
      "verb": "listening"
    },
    {
      "sentence": "You will have been cleaning a picture for years by next year.",
      "verb": "cleaning"
    },
    {
      "sentence": "My friend will have been preparing pasta for years by tomorrow.",
      "verb": "preparing"
    },
    {
      "sentence": "I will have been writing the proposal since Monday by this evening.",
      "verb": "writing"
    },
    {
      "sentence": "John will have been cleaning the garden since yesterday by this weekend.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, emma will have been sending the letter all day.",
      "verb": "sending"
    },
    {
      "sentence": "By this evening, the cat will have been arriving to the library.",
      "verb": "arriving"
    },
    {
      "sentence": "By next week, i will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, my friend will have been giving the keys.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, my parents will have been finding groceries since yesterday.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, our neighbors will have been walking home for a month.",
      "verb": "walking"
    },
    {
      "sentence": "The manager will have been meeting the doctor since morning by soon.",
      "verb": "meeting"
    },
    {
      "sentence": "By tonight, the children will have been drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, my parents will have been thinking about the event.",
      "verb": "thinking"
    },
    {
      "sentence": "By next week, tom will have been preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the children will have been going to the store all day.",
      "verb": "going"
    },
    {
      "sentence": "Emma will have been watching the game for a month by soon.",
      "verb": "watching"
    },
    {
      "sentence": "By soon, the students will have been leaving to work.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, he will have been repairing the kitchen all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, she will have been enjoying a sandwich.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this evening, the students will have been designing the furniture.",
      "verb": "designing"
    },
    {
      "sentence": "You will have been enjoying soup for a week by tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, we will have been contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "By in two days, she will have been receiving the task.",
      "verb": "receiving"
    },
    {
      "sentence": "By this evening, the manager will have been selling a new car.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, emma will have been drinking soup all week.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, my friend will have been speaking my friend since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, her sister will have been visiting the boss for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "By tomorrow, they will have been selling a book.",
      "verb": "selling"
    },
    {
      "sentence": "By soon, the children will have been cleaning the car.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother will have been cooking juice for a week by this weekend.",
      "verb": "cooking"
    },
    {
      "sentence": "We will have been calling the manager since Monday by this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, you will have been writing the report all week.",
      "verb": "writing"
    }
  ]
}