{
  "tense": "Future Perfect Continuous",
  "description": "Used for actions that will have been ongoing until a future point",
  "examples": [
    {
      "sentence": "By next month, the dog will have been sleeping under the table for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next week, emma will have been driving to work.",
      "verb": "driving"
    },
    {
      "sentence": "By next month, john will have been calling the team all day.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, the dog will have been eating its dinner all week.",
      "verb": "eating"
    },
    {
      "sentence": "I will have been emailing the team since this morning by in two days.",
      "verb": "emailing"
    },
    {
      "sentence": "The manager will have been eating a salad all week by later.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been repairing the computer for years by later.",
      "verb": "repairing"
    },
    {
      "sentence": "By next year, the teacher will have been playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been catching the ball all day.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, my parents will have been designing a house since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the dog will have been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will have been eating its breakfast since this morning by tonight.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, my parents will have been creating an app for a week.",
      "verb": "creating"
    },
    {
      "sentence": "We will have been drinking juice for a month by next year.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, she will have been listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, we will have been forgetting the plan.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents will have been building a project since this morning by later.",
      "verb": "building"
    },
    {
      "sentence": "By next month, the team will have been developing a new product all week.",
      "verb": "developing"
    },
    {
      "sentence": "The dog will have been chasing the toy for a month by next year.",
      "verb": "chasing"
    },
    {
      "sentence": "By soon, our neighbors will have been thinking about the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The manager will have been reading the textbook since Monday by next year.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, the bird will have been playing in the garden for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, she will have been sketching an illustration.",
      "verb": "sketching"
    },
    {
      "sentence": "The cat will have been chasing its tail for a month by this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "By this evening, the cat will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, the dog will have been chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah will have been calling my friend for three days by this evening.",
      "verb": "calling"
    },
    {
      "sentence": "By later, tom will have been building an app.",
      "verb": "building"
    },
    {
      "sentence": "By next month, my brother will have been repairing the computer for years.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the dog will have been eating its breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, they will have been painting a diagram since Monday.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the bird will have been playing in the park for years.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been drawing a portrait since Monday by soon.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, our neighbors will have been calling the boss for years.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, john will have been forgetting the meeting for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "He will have been listening to the news for two hours by this evening.",
      "verb": "listening"
    },
    {
      "sentence": "By later, the children will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager will have been drinking juice for years by next week.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, the cat will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the team will have been completing a new product for three days.",
      "verb": "completing"
    },
    {
      "sentence": "The teacher will have been building a presentation for a month by this weekend.",
      "verb": "building"
    },
    {
      "sentence": "By next month, the cat will have been chasing the ball all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the bird will have been catching the frisbee for years.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, john will have been teaching vocabulary for two hours.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister will have been drinking coffee since this morning by next year.",
      "verb": "drinking"
    },
    {
      "sentence": "I will have been tidying the kitchen for a month by next week.",
      "verb": "tidying"
    },
    {
      "sentence": "Sarah will have been calling the team all day by tonight.",
      "verb": "calling"
    },
    {
      "sentence": "By next year, the bird will have been eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "John will have been forgetting the meeting since Monday by next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the teacher will have been finding the ticket for three days.",
      "verb": "finding"
    },
    {
      "sentence": "By later, the students will have been sketching a diagram.",
      "verb": "sketching"
    },
    {
      "sentence": "By this evening, the cat will have been catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will have been sleeping in the corner all day by this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, our neighbors will have been visiting the team all day.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, john will have been listening to a podcast since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, my brother will have been talking to my friend all day.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, tom will have been drawing an illustration.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah will have been learning Spanish since this morning by tonight.",
      "verb": "learning"
    },
    {
      "sentence": "By next year, the students will have been remembering the birthday party.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, the children will have been creating a model all day.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the cat will have been catching the ball since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the students will have been repairing the sink for years.",
      "verb": "repairing"
    },
    {
      "sentence": "By tomorrow, she will have been playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "He will have been repairing the machine for three days by tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "By this evening, the bird will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next year, the cat will have been playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, we will have been speaking to the client for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "He will have been playing chess all day by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the company will have been launching the update since yesterday.",
      "verb": "launching"
    },
    {
      "sentence": "By next month, the children will have been fixing the car for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the team will have been winning the software for a week.",
      "verb": "winning"
    },
    {
      "sentence": "The dog will have been playing with the ball since this morning by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, john will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "John will have been eating breakfast for a week by this evening.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been teaching the notes for a month.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, the cat will have been sleeping by the window since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the teacher will have been calling the teacher all week.",
      "verb": "calling"
    },
    {
      "sentence": "By tonight, our neighbors will have been sketching the wall.",
      "verb": "sketching"
    },
    {
      "sentence": "By soon, the cat will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "You will have been talking to my family for a month by next week.",
      "verb": "talking"
    },
    {
      "sentence": "The cat will have been sleeping in the sun for three days by later.",
      "verb": "sleeping"
    },
    {
      "sentence": "By in two days, the dog will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the cat will have been eating quickly since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "John will have been finishing the document all day by next week.",
      "verb": "finishing"
    },
    {
      "sentence": "By in two days, the bird will have been eating some food.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will have been eating its breakfast since Monday by soon.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the students will have been listening to music for years.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, our neighbors will have been building a project all week.",
      "verb": "building"
    },
    {
      "sentence": "By in two days, my friend will have been eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, she will have been receiving the report for two hours.",
      "verb": "receiving"
    },
    {
      "sentence": "By next month, my parents will have been playing volleyball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, the dog will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "The children will have been eating some fruit since this morning by later.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, she will have been preparing dinner since this morning.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the teacher will have been repairing the bike for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, tom will have been drawing a poster for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, her sister will have been drawing a landscape since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "By tomorrow, the teacher will have been listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, they will have been seeing the doctor for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the cat will have been eating its food for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been playing with the ball for years by soon.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will have been watching the game for a week by in two days.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will have been playing with the ball for a month by next year.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping by the window since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, the students will have been playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "By this evening, the teacher will have been watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher will have been having a sandwich all week by later.",
      "verb": "having"
    },
    {
      "sentence": "By this weekend, the cat will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, sarah will have been eating pizza for a month.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will have been writing the report since Monday by next year.",
      "verb": "writing"
    },
    {
      "sentence": "By next month, my parents will have been organizing the room since Monday.",
      "verb": "organizing"
    },
    {
      "sentence": "Our neighbors will have been contacting the office for years by this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "By this weekend, the dog will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, she will have been choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, the cat will have been chasing the squirrel since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "By this weekend, the manager will have been speaking with the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog will have been eating some food all week by next year.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been watching a show for three days by next month.",
      "verb": "watching"
    },
    {
      "sentence": "By in two days, the children will have been thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "By soon, tom will have been buying the keys.",
      "verb": "buying"
    },
    {
      "sentence": "I will have been playing guitar for a week by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "By this evening, the manager will have been playing guitar.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the manager will have been visiting the team.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, our neighbors will have been submitting the presentation since yesterday.",
      "verb": "submitting"
    },
    {
      "sentence": "My parents will have been painting a landscape all day by tonight.",
      "verb": "painting"
    },
    {
      "sentence": "The cat will have been playing with the toy all day by later.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, my parents will have been painting the wall all week.",
      "verb": "painting"
    },
    {
      "sentence": "By tomorrow, sarah will have been planning the birthday party.",
      "verb": "planning"
    },
    {
      "sentence": "By next month, the manager will have been understanding French for a week.",
      "verb": "understanding"
    },
    {
      "sentence": "By next month, the cat will have been playing with the ball for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been sleeping on the bed all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, emma will have been having a sandwich all day.",
      "verb": "having"
    },
    {
      "sentence": "Our neighbors will have been watching TV for years by this evening.",
      "verb": "watching"
    },
    {
      "sentence": "By in two days, the cat will have been catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "The manager will have been sketching a landscape since yesterday by next month.",
      "verb": "sketching"
    },
    {
      "sentence": "By next month, they will have been repairing the car all day.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the teacher will have been preparing the presentation for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog will have been chasing the toy all week by tonight.",
      "verb": "chasing"
    },
    {
      "sentence": "By in two days, the students will have been painting a poster.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, the children will have been fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "The students will have been watching a show all week by next month.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will have been sleeping on the couch all week by this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next year, the bird will have been running in the park.",
      "verb": "running"
    },
    {
      "sentence": "By soon, they will have been listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, john will have been playing tennis since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "My parents will have been repairing the machine for a week by in two days.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher will have been building a presentation all week by next year.",
      "verb": "building"
    },
    {
      "sentence": "By in two days, they will have been cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "Emma will have been watching a video for years by tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, she will have been fixing the roof for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird will have been chasing the toy all week by in two days.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, the cat will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next year, he will have been playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, my parents will have been preparing cookies.",
      "verb": "preparing"
    },
    {
      "sentence": "The cat will have been chasing birds in the garden all week by this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors will have been teaching the textbook for a month by tonight.",
      "verb": "teaching"
    },
    {
      "sentence": "Sarah will have been listening to an audiobook for a week by this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "You will have been arriving to the store since yesterday by next month.",
      "verb": "arriving"
    },
    {
      "sentence": "By next month, he will have been contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the bird will have been running in circles for a month.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the children will have been watching TV all week.",
      "verb": "watching"
    },
    {
      "sentence": "The students will have been listening to an audiobook for years by later.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will have been drawing a picture all week by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will have been running in the yard all week by next week.",
      "verb": "running"
    },
    {
      "sentence": "By next month, we will have been fixing the machine.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the team will have been announcing the update all week.",
      "verb": "announcing"
    },
    {
      "sentence": "You will have been listening to an audiobook since yesterday by next week.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will have been returning to the library since yesterday by next year.",
      "verb": "returning"
    },
    {
      "sentence": "By next week, the team will have been winning the deal.",
      "verb": "winning"
    },
    {
      "sentence": "By next year, my friend will have been getting a present.",
      "verb": "getting"
    },
    {
      "sentence": "By soon, the bird will have been sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents will have been preparing rice since yesterday by in two days.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, our neighbors will have been considering the meeting for a week.",
      "verb": "considering"
    },
    {
      "sentence": "They will have been buying the ticket all day by in two days.",
      "verb": "buying"
    },
    {
      "sentence": "By tonight, tom will have been cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "The bird will have been playing with its owner since yesterday by later.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will have been sleeping in the sun for a week by later.",
      "verb": "sleeping"
    },
    {
      "sentence": "By soon, the dog will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, he will have been meeting the teacher since this morning.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma will have been watching football since this morning by later.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, john will have been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the bird will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the children will have been buying a laptop for a month.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, the dog will have been chasing the mouse all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By tonight, the dog will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, emma will have been watching the match since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will have been sketching a picture for a week by soon.",
      "verb": "sketching"
    },
    {
      "sentence": "By next month, emma will have been flying to school for two hours.",
      "verb": "flying"
    },
    {
      "sentence": "By soon, the company will have been completing the software.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping all day for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "The cat will have been eating its dinner since yesterday by next week.",
      "verb": "eating"
    },
    {
      "sentence": "I will have been washing the bathroom all day by soon.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, he will have been building a plan.",
      "verb": "building"
    },
    {
      "sentence": "By next month, my parents will have been tidying the room since Monday.",
      "verb": "tidying"
    },
    {
      "sentence": "By next month, the bird will have been running across the field for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Emma will have been making a salad for three days by tonight.",
      "verb": "making"
    },
    {
      "sentence": "The company will have been releasing the contract since this morning by later.",
      "verb": "releasing"
    },
    {
      "sentence": "I will have been playing guitar for a week by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "The children will have been repairing the fence all day by soon.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the students will have been drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, my parents will have been playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "My parents will have been drinking juice since this morning by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, she will have been eating some fruit for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been choosing groceries for a month by tomorrow.",
      "verb": "choosing"
    },
    {
      "sentence": "By this evening, they will have been watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "The bird will have been playing with the other pets for three days by next month.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been speaking to my parents since this morning by soon.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog will have been chasing birds in the garden since Monday by next month.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend will have been listening to the radio since Monday by this evening.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, the manager will have been studying French.",
      "verb": "studying"
    },
    {
      "sentence": "By next month, john will have been designing a presentation since this morning.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the teacher will have been eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the team will have been announcing the championship all week.",
      "verb": "announcing"
    },
    {
      "sentence": "Sarah will have been baking pasta since this morning by soon.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, the cat will have been catching the mouse since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "The students will have been listening to the lecture all day by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, my parents will have been drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah will have been preparing cookies since yesterday by tonight.",
      "verb": "preparing"
    },
    {
      "sentence": "We will have been finding a present since yesterday by next month.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher will have been seeing my parents since Monday by next year.",
      "verb": "seeing"
    },
    {
      "sentence": "My parents will have been washing the bathroom since this morning by later.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, her sister will have been washing the dishes for years.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping in the sun for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, our neighbors will have been drinking juice for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "John will have been drinking juice for a month by next month.",
      "verb": "drinking"
    },
    {
      "sentence": "By next week, you will have been writing the application.",
      "verb": "writing"
    },
    {
      "sentence": "By next month, he will have been contacting the doctor since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, she will have been forgetting the situation since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the children will have been buying a present since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, the bird will have been sleeping in the sun since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, she will have been reading Spanish since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "By this evening, they will have been sending the proposal.",
      "verb": "sending"
    },
    {
      "sentence": "By next year, the bird will have been playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the bird will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By later, the bird will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been creating a presentation for three days by next week.",
      "verb": "creating"
    },
    {
      "sentence": "They will have been listening to a podcast for a month by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the students will have been reading the textbook for two hours.",
      "verb": "reading"
    },
    {
      "sentence": "Tom will have been building a house since this morning by next month.",
      "verb": "building"
    },
    {
      "sentence": "By next month, the teacher will have been listening to music for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will have been running through the grass since yesterday by this weekend.",
      "verb": "running"
    },
    {
      "sentence": "By next month, i will have been watching a video for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, the dog will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the manager will have been playing football all day.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will have been selling groceries for a week by next month.",
      "verb": "selling"
    },
    {
      "sentence": "My brother will have been washing the house for three days by next year.",
      "verb": "washing"
    },
    {
      "sentence": "My parents will have been listening to an audiobook since yesterday by tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister will have been listening to the news for years by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the team will have been announcing the project for two hours.",
      "verb": "announcing"
    },
    {
      "sentence": "By next month, we will have been tidying the kitchen since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "They will have been having a sandwich since yesterday by in two days.",
      "verb": "having"
    },
    {
      "sentence": "By next year, our neighbors will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By soon, john will have been starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "By tomorrow, the company will have been launching the championship.",
      "verb": "launching"
    },
    {
      "sentence": "By soon, i will have been speaking to the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, my brother will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, the manager will have been forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, her sister will have been texting the boss all day.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, john will have been drinking a smoothie for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, our neighbors will have been watching a series all day.",
      "verb": "watching"
    },
    {
      "sentence": "My friend will have been reviewing the notes for a week by next year.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, the dog will have been chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, john will have been reading mathematics since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "The company will have been completing the contract for a week by later.",
      "verb": "completing"
    },
    {
      "sentence": "By this evening, john will have been visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister will have been watching a series for three days by soon.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, sarah will have been having breakfast all week.",
      "verb": "having"
    },
    {
      "sentence": "By next month, our neighbors will have been painting a picture since Monday.",
      "verb": "painting"
    },
    {
      "sentence": "By this weekend, the children will have been seeing the manager.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, her sister will have been thinking about the event.",
      "verb": "thinking"
    },
    {
      "sentence": "John will have been practicing the lesson for two hours by this weekend.",
      "verb": "practicing"
    },
    {
      "sentence": "By this weekend, the cat will have been chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the team will have been launching a new product since this morning.",
      "verb": "launching"
    },
    {
      "sentence": "The dog will have been eating quickly for years by soon.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will have been having breakfast for three days by soon.",
      "verb": "having"
    },
    {
      "sentence": "She will have been listening to jazz for a week by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will have been painting a picture for a week by this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, my parents will have been playing golf for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, our neighbors will have been reading mathematics all week.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, you will have been listening to the radio all day.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, i will have been seeing the team all week.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the dog will have been eating its breakfast for a week.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been catching the ball for three days by this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah will have been meeting my friend for years by later.",
      "verb": "meeting"
    },
    {
      "sentence": "She will have been learning Spanish since yesterday by next week.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, the company will have been developing the update.",
      "verb": "developing"
    },
    {
      "sentence": "The bird will have been chasing birds in the garden for two hours by in two days.",
      "verb": "chasing"
    },
    {
      "sentence": "The company will have been completing the software for a week by next week.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, emma will have been deciding on the event for years.",
      "verb": "deciding"
    },
    {
      "sentence": "By tonight, we will have been playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been running in the park since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the children will have been choosing a book for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "By tomorrow, the bird will have been playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, emma will have been getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "You will have been remembering the options for a month by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, the bird will have been playing with the other pets since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, my friend will have been washing the office all day.",
      "verb": "washing"
    },
    {
      "sentence": "They will have been coming to the hospital for a month by in two days.",
      "verb": "coming"
    },
    {
      "sentence": "By later, the manager will have been deciding on the vacation.",
      "verb": "deciding"
    },
    {
      "sentence": "The cat will have been running around the house for three days by later.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the students will have been organizing the kitchen all day.",
      "verb": "organizing"
    },
    {
      "sentence": "By soon, my brother will have been playing guitar.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the cat will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, they will have been painting a portrait.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the manager will have been seeing my parents all day.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, they will have been repairing the door for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, you will have been calling the manager all day.",
      "verb": "calling"
    },
    {
      "sentence": "The bird will have been running around the house since yesterday by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "By next month, she will have been speaking to the boss for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the students will have been designing a presentation for three days.",
      "verb": "designing"
    },
    {
      "sentence": "Our neighbors will have been repairing the bike for two hours by tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "By tonight, the cat will have been sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, my friend will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager will have been flying to the airport since yesterday by in two days.",
      "verb": "flying"
    },
    {
      "sentence": "By in two days, john will have been considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By tonight, the bird will have been sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the company will have been releasing the update.",
      "verb": "releasing"
    },
    {
      "sentence": "The dog will have been running across the field all day by in two days.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the dog will have been running in the yard for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By next month, my friend will have been visiting the teacher for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By next year, the cat will have been eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister will have been building a presentation for a week by next week.",
      "verb": "building"
    },
    {
      "sentence": "By tomorrow, my friend will have been speaking to the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "By next week, the bird will have been catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "I will have been washing the bathroom for three days by this evening.",
      "verb": "washing"
    },
    {
      "sentence": "He will have been preparing a salad since this morning by soon.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the students will have been watching a movie for years.",
      "verb": "watching"
    },
    {
      "sentence": "The students will have been visiting the doctor for a month by next month.",
      "verb": "visiting"
    },
    {
      "sentence": "My brother will have been drinking milk since Monday by this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the cat will have been running around the house for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By next month, he will have been playing guitar since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the team will have been launching the software for a month.",
      "verb": "launching"
    },
    {
      "sentence": "She will have been cleaning the garage for three days by next month.",
      "verb": "cleaning"
    },
    {
      "sentence": "Emma will have been buying the phone for a month by next week.",
      "verb": "buying"
    },
    {
      "sentence": "By this evening, the cat will have been sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By this evening, the bird will have been eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, sarah will have been listening to music since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, the students will have been playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "By later, the teacher will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, the company will have been completing a new product.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, john will have been playing football since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the dog will have been chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "By this evening, emma will have been creating a house.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the teacher will have been speaking to my friend all week.",
      "verb": "speaking"
    },
    {
      "sentence": "They will have been seeing my grandmother since Monday by soon.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird will have been playing with its owner for years by later.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, he will have been teaching history all day.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister will have been submitting the proposal since yesterday by next week.",
      "verb": "submitting"
    },
    {
      "sentence": "By next month, i will have been making pasta for years.",
      "verb": "making"
    },
    {
      "sentence": "By next month, my brother will have been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, i will have been playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the students will have been creating a website for three days.",
      "verb": "creating"
    },
    {
      "sentence": "We will have been seeing the team for three days by next week.",
      "verb": "seeing"
    },
    {
      "sentence": "Emma will have been drinking coffee since this morning by next week.",
      "verb": "drinking"
    },
    {
      "sentence": "You will have been calling the manager since yesterday by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "By later, my parents will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, they will have been drinking tea all week.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister will have been listening to a song since yesterday by next week.",
      "verb": "listening"
    },
    {
      "sentence": "He will have been seeing an old friend for three days by soon.",
      "verb": "seeing"
    },
    {
      "sentence": "Emma will have been playing soccer all day by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the dog will have been running around the house.",
      "verb": "running"
    },
    {
      "sentence": "By next week, john will have been making breakfast.",
      "verb": "making"
    },
    {
      "sentence": "By next year, he will have been having a meal.",
      "verb": "having"
    },
    {
      "sentence": "By next month, my parents will have been repairing the machine since this morning.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat will have been eating its breakfast for a month by this evening.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, my parents will have been learning the chapter.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, the dog will have been sleeping in the corner for a week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, her sister will have been speaking to the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the cat will have been sleeping on the bed all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the children will have been studying the textbook for years.",
      "verb": "studying"
    },
    {
      "sentence": "By next month, the manager will have been listening to an audiobook since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, i will have been building a plan.",
      "verb": "building"
    },
    {
      "sentence": "By in two days, the team will have been announcing the results.",
      "verb": "announcing"
    },
    {
      "sentence": "The dog will have been sleeping on the bed for years by this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, he will have been cleaning the bathroom for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, he will have been talking to the client since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "Tom will have been tidying the kitchen for years by tomorrow.",
      "verb": "tidying"
    },
    {
      "sentence": "The dog will have been sleeping on the couch for years by tomorrow.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, her sister will have been getting a new house for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "He will have been speaking to my family since yesterday by tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the dog will have been catching a treat for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, john will have been building a model since this morning.",
      "verb": "building"
    },
    {
      "sentence": "By next month, my brother will have been meeting the neighbors all day.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog will have been running across the field all week by soon.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the manager will have been speaking to the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the bird will have been running in the yard for a month.",
      "verb": "running"
    },
    {
      "sentence": "She will have been drawing the wall for a week by next year.",
      "verb": "drawing"
    },
    {
      "sentence": "By next week, we will have been talking to the team.",
      "verb": "talking"
    },
    {
      "sentence": "My parents will have been watching a show for a week by next year.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, i will have been washing the house.",
      "verb": "washing"
    },
    {
      "sentence": "They will have been designing a prototype for two hours by in two days.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah will have been learning Spanish for years by in two days.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, my brother will have been drawing a landscape.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will have been running in circles since Monday by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "By later, the manager will have been emailing customer service.",
      "verb": "emailing"
    },
    {
      "sentence": "The students will have been eating dinner for years by soon.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will have been sketching a poster all day by in two days.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister will have been fixing the computer for a week by soon.",
      "verb": "fixing"
    },
    {
      "sentence": "By tonight, i will have been contacting customer service.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the children will have been contacting the doctor for years.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents will have been playing basketball all day by tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, my friend will have been considering the event since Monday.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, the manager will have been considering the decision for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, he will have been contacting the office.",
      "verb": "contacting"
    },
    {
      "sentence": "By this weekend, we will have been talking to the client.",
      "verb": "talking"
    },
    {
      "sentence": "The cat will have been sleeping on the couch for three days by later.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tomorrow, the students will have been designing a prototype.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, we will have been designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, we will have been playing guitar since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Emma will have been sketching an illustration for three days by this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "By next month, the children will have been finishing the email for years.",
      "verb": "finishing"
    },
    {
      "sentence": "We will have been watching a movie for a week by next month.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, my brother will have been eating a meal.",
      "verb": "eating"
    },
    {
      "sentence": "John will have been painting a picture for years by in two days.",
      "verb": "painting"
    },
    {
      "sentence": "My friend will have been writing the project all day by soon.",
      "verb": "writing"
    },
    {
      "sentence": "By next year, the children will have been listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will have been emailing the office for a month by this weekend.",
      "verb": "emailing"
    },
    {
      "sentence": "By soon, the teacher will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, emma will have been drinking water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "She will have been playing the piano for three days by tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been catching a treat since Monday by next week.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, emma will have been listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, she will have been washing the office.",
      "verb": "washing"
    },
    {
      "sentence": "By tomorrow, the cat will have been sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird will have been chasing the toy for a month by tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will have been playing with the ball for a month by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "By later, the teacher will have been listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, you will have been emailing my family.",
      "verb": "emailing"
    },
    {
      "sentence": "By soon, the company will have been announcing the software.",
      "verb": "announcing"
    },
    {
      "sentence": "He will have been washing the car for a week by next month.",
      "verb": "washing"
    },
    {
      "sentence": "I will have been sketching a portrait for three days by tonight.",
      "verb": "sketching"
    },
    {
      "sentence": "The team will have been developing the results for three days by tonight.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, her sister will have been watching a documentary for a month.",
      "verb": "watching"
    },
    {
      "sentence": "By in two days, we will have been fixing the door.",
      "verb": "fixing"
    },
    {
      "sentence": "By this evening, the team will have been announcing the championship.",
      "verb": "announcing"
    },
    {
      "sentence": "By in two days, the bird will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "The team will have been developing the results since this morning by soon.",
      "verb": "developing"
    },
    {
      "sentence": "My brother will have been choosing a laptop for a week by tomorrow.",
      "verb": "choosing"
    },
    {
      "sentence": "By later, our neighbors will have been flying to the park.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, sarah will have been preparing rice all day.",
      "verb": "preparing"
    },
    {
      "sentence": "My parents will have been cleaning the bathroom all day by later.",
      "verb": "cleaning"
    },
    {
      "sentence": "He will have been sending the contract since Monday by next year.",
      "verb": "sending"
    },
    {
      "sentence": "By tonight, the cat will have been eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "The students will have been listening to jazz for a week by next week.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, my brother will have been making soup.",
      "verb": "making"
    },
    {
      "sentence": "By next month, the dog will have been catching the frisbee since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "He will have been deciding on the event for years by next week.",
      "verb": "deciding"
    },
    {
      "sentence": "My parents will have been cleaning the house since this morning by next week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog will have been catching the mouse since Monday by this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "They will have been meeting my parents all day by this weekend.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, the children will have been having dinner for a month.",
      "verb": "having"
    },
    {
      "sentence": "We will have been painting a portrait all day by this evening.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the team will have been releasing the deal for a week.",
      "verb": "releasing"
    },
    {
      "sentence": "By next year, my parents will have been having soup.",
      "verb": "having"
    },
    {
      "sentence": "By next month, emma will have been traveling to the hospital all day.",
      "verb": "traveling"
    },
    {
      "sentence": "By next month, the dog will have been sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "They will have been baking lunch since yesterday by tonight.",
      "verb": "baking"
    },
    {
      "sentence": "They will have been finding a book since yesterday by tonight.",
      "verb": "finding"
    },
    {
      "sentence": "By next month, we will have been drawing an illustration since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "By tonight, he will have been watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "They will have been selling a new car for three days by next month.",
      "verb": "selling"
    },
    {
      "sentence": "By next month, my brother will have been contacting my friend all day.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, he will have been watching a series since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "My parents will have been playing football since yesterday by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been reading the lesson since Monday by next month.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, tom will have been arriving home all week.",
      "verb": "arriving"
    },
    {
      "sentence": "By next month, the bird will have been running in the park all week.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the dog will have been chasing the other pets all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, you will have been speaking to the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "By in two days, my parents will have been drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "By this weekend, the teacher will have been speaking to the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, the cat will have been sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "By soon, we will have been cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, my parents will have been drinking milk since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, our neighbors will have been listening to jazz all day.",
      "verb": "listening"
    },
    {
      "sentence": "The children will have been meeting the team since this morning by next year.",
      "verb": "meeting"
    },
    {
      "sentence": "My friend will have been drawing a poster for three days by next year.",
      "verb": "drawing"
    },
    {
      "sentence": "They will have been seeing the neighbors all week by later.",
      "verb": "seeing"
    },
    {
      "sentence": "The teacher will have been tidying the bathroom since this morning by later.",
      "verb": "tidying"
    },
    {
      "sentence": "By next week, my brother will have been meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "By tonight, the cat will have been eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been creating a website since Monday by next week.",
      "verb": "creating"
    },
    {
      "sentence": "Sarah will have been eating a sandwich since this morning by next month.",
      "verb": "eating"
    },
    {
      "sentence": "The students will have been running to the library all week by this weekend.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the students will have been coming to the hospital all week.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, the teacher will have been eating lunch for three days.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will have been creating a plan for a month by tomorrow.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, emma will have been fixing the bike for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, my parents will have been organizing the room for a month.",
      "verb": "organizing"
    },
    {
      "sentence": "By next month, i will have been considering the vacation for three days.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, they will have been visiting the client all day.",
      "verb": "visiting"
    },
    {
      "sentence": "By tomorrow, she will have been watching a show.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, emma will have been playing golf for years.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, the students will have been creating a plan.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, my friend will have been drinking coffee since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the manager will have been listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the cat will have been running in the garden since this morning.",
      "verb": "running"
    },
    {
      "sentence": "Tom will have been watching the match since this morning by next week.",
      "verb": "watching"
    },
    {
      "sentence": "My friend will have been eating a sandwich since yesterday by next week.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, our neighbors will have been playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "They will have been deciding on the event for years by next month.",
      "verb": "deciding"
    },
    {
      "sentence": "He will have been understanding Spanish since this morning by next month.",
      "verb": "understanding"
    },
    {
      "sentence": "By in two days, her sister will have been painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, emma will have been creating a prototype since this morning.",
      "verb": "creating"
    },
    {
      "sentence": "The bird will have been chasing the squirrel for years by in two days.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the teacher will have been practicing the chapter all day.",
      "verb": "practicing"
    },
    {
      "sentence": "By next month, the dog will have been playing with the ball for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, he will have been repairing the bike since this morning.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the bird will have been eating a treat since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "By in two days, the manager will have been remembering the problem.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, the dog will have been chasing the other pets since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my friend will have been eating some fruit since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, the cat will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, the dog will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been visiting my friend.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, we will have been painting the wall for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "By later, my brother will have been starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "Her sister will have been drinking a smoothie since yesterday by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents will have been repairing the machine for a week by tonight.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the dog will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By in two days, the children will have been planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "By tonight, the cat will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, john will have been drinking water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "He will have been preparing rice for years by this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "By next year, the bird will have been chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the students will have been starting the project for three days.",
      "verb": "starting"
    },
    {
      "sentence": "By tonight, tom will have been reading French.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, the students will have been baking a salad since Monday.",
      "verb": "baking"
    },
    {
      "sentence": "By later, my friend will have been having a snack.",
      "verb": "having"
    },
    {
      "sentence": "By this weekend, my friend will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, my friend will have been drinking juice for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, the bird will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the teacher will have been contacting my friend all day.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, my parents will have been building a project for three days.",
      "verb": "building"
    },
    {
      "sentence": "By tomorrow, the dog will have been eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, they will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "By this evening, the dog will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By tomorrow, my friend will have been speaking with the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, emma will have been choosing groceries for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "By next year, sarah will have been watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the bird will have been running through the grass for three days.",
      "verb": "running"
    },
    {
      "sentence": "The cat will have been catching a butterfly since Monday by soon.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, sarah will have been speaking to the professor for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, i will have been getting a new car since this morning.",
      "verb": "getting"
    },
    {
      "sentence": "The dog will have been running in the park since Monday by soon.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the bird will have been running across the field for a week.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the dog will have been catching a treat all day.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the cat will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "By soon, the children will have been playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "You will have been listening to jazz since yesterday by next month.",
      "verb": "listening"
    },
    {
      "sentence": "My friend will have been watching a movie all day by later.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, the cat will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By later, the cat will have been catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "They will have been learning mathematics all week by next year.",
      "verb": "learning"
    },
    {
      "sentence": "The cat will have been playing with its owner for a month by later.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the cat will have been eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been practicing the notes for three days.",
      "verb": "practicing"
    },
    {
      "sentence": "The team will have been announcing the championship for years by soon.",
      "verb": "announcing"
    },
    {
      "sentence": "By next month, we will have been speaking to the client for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "By next year, john will have been listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, they will have been washing the kitchen for two hours.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, he will have been listening to classical music since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "My friend will have been building a house all day by tonight.",
      "verb": "building"
    },
    {
      "sentence": "The teacher will have been fixing the bike since yesterday by soon.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog will have been chasing the other pets since this morning by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, her sister will have been finding a present all day.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher will have been remembering the decision all week by tomorrow.",
      "verb": "remembering"
    },
    {
      "sentence": "By next year, my friend will have been seeing the manager.",
      "verb": "seeing"
    },
    {
      "sentence": "The cat will have been playing with the other pets since yesterday by later.",
      "verb": "playing"
    },
    {
      "sentence": "He will have been meeting the team for three days by tonight.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, emma will have been learning the chapter.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, emma will have been walking to the bank since Monday.",
      "verb": "walking"
    },
    {
      "sentence": "By next month, her sister will have been playing chess for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, i will have been remembering the situation all week.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, my brother will have been meeting my friend for two hours.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, the manager will have been eating some fruit for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By soon, john will have been speaking to the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the teacher will have been coming to the market since yesterday.",
      "verb": "coming"
    },
    {
      "sentence": "Tom will have been drinking juice for three days by next week.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will have been completing the project all day by next week.",
      "verb": "completing"
    },
    {
      "sentence": "By tomorrow, the children will have been submitting the document.",
      "verb": "submitting"
    },
    {
      "sentence": "By tomorrow, he will have been speaking to the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "I will have been finding a new house since Monday by next year.",
      "verb": "finding"
    },
    {
      "sentence": "By next month, they will have been choosing the ticket for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "By next week, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, my parents will have been speaking with the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "By next week, the company will have been launching the contract.",
      "verb": "launching"
    },
    {
      "sentence": "I will have been speaking with the client since Monday by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the team will have been launching the contract since yesterday.",
      "verb": "launching"
    },
    {
      "sentence": "She will have been drinking juice all week by next year.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, my brother will have been visiting the neighbors for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, john will have been cleaning the dishes for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, the dog will have been eating the leftover food all day.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will have been catching the toy all week by next year.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors will have been listening to the news since Monday by next month.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, they will have been writing the project for three days.",
      "verb": "writing"
    },
    {
      "sentence": "Her sister will have been listening to the news for a month by next month.",
      "verb": "listening"
    },
    {
      "sentence": "You will have been receiving the document since Monday by next month.",
      "verb": "receiving"
    },
    {
      "sentence": "By next month, emma will have been listening to an audiobook since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the students will have been watching a series for years.",
      "verb": "watching"
    },
    {
      "sentence": "She will have been building a plan all week by this evening.",
      "verb": "building"
    },
    {
      "sentence": "The children will have been driving home since this morning by this weekend.",
      "verb": "driving"
    },
    {
      "sentence": "By in two days, my brother will have been cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "By tomorrow, emma will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "By tonight, the students will have been completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, my brother will have been having breakfast for two hours.",
      "verb": "having"
    },
    {
      "sentence": "By next month, the children will have been eating a sandwich for a week.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will have been traveling downtown for three days by tonight.",
      "verb": "traveling"
    },
    {
      "sentence": "She will have been considering the problem since yesterday by this weekend.",
      "verb": "considering"
    },
    {
      "sentence": "Our neighbors will have been preparing pasta since Monday by tomorrow.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, emma will have been going to the office since yesterday.",
      "verb": "going"
    },
    {
      "sentence": "By soon, the bird will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "By this evening, we will have been drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, my parents will have been visiting the team all week.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, you will have been organizing the clothes for two hours.",
      "verb": "organizing"
    },
    {
      "sentence": "We will have been playing tennis for a week by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, he will have been contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, my friend will have been talking to the client all day.",
      "verb": "talking"
    },
    {
      "sentence": "You will have been repairing the sink since Monday by in two days.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the children will have been choosing groceries for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "The teacher will have been preparing cookies since this morning by this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, emma will have been preparing soup for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, my brother will have been visiting my family all day.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, the cat will have been playing with the toy for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been chasing birds in the garden all week by soon.",
      "verb": "chasing"
    },
    {
      "sentence": "Tom will have been playing tennis since this morning by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, we will have been speaking to my family all week.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the manager will have been visiting the neighbors since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, tom will have been emailing the office.",
      "verb": "emailing"
    },
    {
      "sentence": "By later, he will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, sarah will have been completing the assignment all week.",
      "verb": "completing"
    },
    {
      "sentence": "By soon, my friend will have been cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog will have been chasing the mouse all week by next year.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, the children will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, the dog will have been chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "The company will have been announcing the project since this morning by this evening.",
      "verb": "announcing"
    },
    {
      "sentence": "The dog will have been chasing the other pets for two hours by next month.",
      "verb": "chasing"
    },
    {
      "sentence": "By this weekend, sarah will have been contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "By this weekend, the bird will have been playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, john will have been contacting my parents.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the team will have been releasing the project since Monday.",
      "verb": "releasing"
    },
    {
      "sentence": "The students will have been watching the news since yesterday by this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "By soon, the team will have been developing the project.",
      "verb": "developing"
    },
    {
      "sentence": "Sarah will have been making cookies all week by next month.",
      "verb": "making"
    },
    {
      "sentence": "By tonight, she will have been having soup.",
      "verb": "having"
    },
    {
      "sentence": "By soon, my brother will have been baking a cake.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, her sister will have been listening to an audiobook since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the manager will have been washing the dishes for a week.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, the dog will have been running in the garden for two hours.",
      "verb": "running"
    },
    {
      "sentence": "The dog will have been catching the frisbee for years by this evening.",
      "verb": "catching"
    },
    {
      "sentence": "Tom will have been speaking to my friend since yesterday by tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "He will have been building a prototype all week by tonight.",
      "verb": "building"
    },
    {
      "sentence": "By next month, the dog will have been running around the house for a month.",
      "verb": "running"
    },
    {
      "sentence": "My brother will have been planning the vacation since yesterday by this evening.",
      "verb": "planning"
    },
    {
      "sentence": "My friend will have been repairing the fence since this morning by next week.",
      "verb": "repairing"
    },
    {
      "sentence": "Tom will have been organizing the garage since this morning by soon.",
      "verb": "organizing"
    },
    {
      "sentence": "The team will have been completing the deal for two hours by later.",
      "verb": "completing"
    },
    {
      "sentence": "He will have been learning grammar for three days by soon.",
      "verb": "learning"
    },
    {
      "sentence": "By next year, my friend will have been speaking with the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the teacher will have been teaching grammar since yesterday.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, john will have been seeing the teacher all day.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the cat will have been chasing the squirrel for years.",
      "verb": "chasing"
    },
    {
      "sentence": "By in two days, the cat will have been catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "By later, emma will have been understanding the chapter.",
      "verb": "understanding"
    },
    {
      "sentence": "By tonight, emma will have been listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, tom will have been deciding on the event.",
      "verb": "deciding"
    },
    {
      "sentence": "By next month, tom will have been considering the meeting all week.",
      "verb": "considering"
    },
    {
      "sentence": "He will have been creating a plan for a week by next month.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the team will have been winning the update all week.",
      "verb": "winning"
    },
    {
      "sentence": "By tomorrow, you will have been giving a new house.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher will have been drinking milk for two hours by this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, my brother will have been designing a house for a week.",
      "verb": "designing"
    },
    {
      "sentence": "By later, the dog will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog will have been sleeping on the bed all week by next month.",
      "verb": "sleeping"
    },
    {
      "sentence": "By this weekend, i will have been emailing the doctor.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, john will have been giving a new car since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "By next month, my friend will have been writing the document for years.",
      "verb": "writing"
    },
    {
      "sentence": "By tonight, my friend will have been going to the airport.",
      "verb": "going"
    },
    {
      "sentence": "By next month, i will have been cleaning the clothes since this morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, our neighbors will have been eating some fruit all day.",
      "verb": "eating"
    },
    {
      "sentence": "My brother will have been contacting my parents all day by next year.",
      "verb": "contacting"
    },
    {
      "sentence": "By tomorrow, sarah will have been seeing the teacher.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, tom will have been speaking to the professor all day.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, john will have been receiving the presentation.",
      "verb": "receiving"
    },
    {
      "sentence": "By next month, the dog will have been playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the children will have been driving to the market since this morning.",
      "verb": "driving"
    },
    {
      "sentence": "They will have been sketching a design for three days by next week.",
      "verb": "sketching"
    },
    {
      "sentence": "She will have been drinking coffee since Monday by next week.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will have been winning the software since yesterday by in two days.",
      "verb": "winning"
    },
    {
      "sentence": "By tonight, tom will have been practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "By next month, the bird will have been running in the yard all week.",
      "verb": "running"
    },
    {
      "sentence": "By this evening, the manager will have been playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, my brother will have been having a meal.",
      "verb": "having"
    },
    {
      "sentence": "By next year, he will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Our neighbors will have been baking a salad for a week by later.",
      "verb": "baking"
    },
    {
      "sentence": "By next week, emma will have been making soup.",
      "verb": "making"
    },
    {
      "sentence": "By tomorrow, my brother will have been sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "By next month, the bird will have been playing in the park for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been talking to a colleague since this morning by next month.",
      "verb": "talking"
    },
    {
      "sentence": "We will have been cooking soup all day by next year.",
      "verb": "cooking"
    },
    {
      "sentence": "By tomorrow, the bird will have been sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "The students will have been drinking milk all week by next month.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the bird will have been catching a butterfly all day.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, my friend will have been drinking milk since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The children will have been painting the wall all week by tonight.",
      "verb": "painting"
    },
    {
      "sentence": "Emma will have been playing tennis since yesterday by next year.",
      "verb": "playing"
    },
    {
      "sentence": "We will have been flying to the beach for a week by next month.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, the team will have been developing the results all week.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, the students will have been washing the kitchen for years.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, we will have been studying vocabulary since yesterday.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister will have been receiving the contract for three days by tonight.",
      "verb": "receiving"
    },
    {
      "sentence": "By next month, we will have been calling the teacher since this morning.",
      "verb": "calling"
    },
    {
      "sentence": "The bird will have been eating its food for three days by tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the dog will have been eating a treat for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, our neighbors will have been seeing the team for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, he will have been flying to the gym.",
      "verb": "flying"
    },
    {
      "sentence": "By in two days, the cat will have been playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the teacher will have been playing the piano for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, she will have been listening to the radio since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the teacher will have been cooking lunch all week.",
      "verb": "cooking"
    },
    {
      "sentence": "By tomorrow, you will have been repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, sarah will have been eating some fruit for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, our neighbors will have been drinking juice for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the dog will have been chasing the ball for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, our neighbors will have been preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "By this evening, we will have been playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, my parents will have been cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah will have been teaching English since this morning by tomorrow.",
      "verb": "teaching"
    },
    {
      "sentence": "By next week, the children will have been reviewing Spanish.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next month, he will have been designing a presentation for years.",
      "verb": "designing"
    },
    {
      "sentence": "By soon, the children will have been getting a gift.",
      "verb": "getting"
    },
    {
      "sentence": "By this weekend, my parents will have been fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister will have been washing the car for years by this weekend.",
      "verb": "washing"
    },
    {
      "sentence": "The teacher will have been designing a plan for a month by next year.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, my brother will have been deciding on the trip since yesterday.",
      "verb": "deciding"
    },
    {
      "sentence": "They will have been repairing the roof for a week by in two days.",
      "verb": "repairing"
    },
    {
      "sentence": "The students will have been cleaning the garage since this morning by tomorrow.",
      "verb": "cleaning"
    },
    {
      "sentence": "You will have been speaking to a colleague for two hours by in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, my brother will have been walking to the bank.",
      "verb": "walking"
    },
    {
      "sentence": "By next month, they will have been calling the team for a month.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, john will have been repairing the machine all day.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma will have been emailing the boss since this morning by later.",
      "verb": "emailing"
    },
    {
      "sentence": "Emma will have been having lunch for years by later.",
      "verb": "having"
    },
    {
      "sentence": "By in two days, the children will have been writing the letter.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will have been texting the boss for a week by soon.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, the dog will have been eating a treat since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the children will have been visiting my grandmother for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "I will have been fixing the sink for three days by this evening.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the bird will have been catching a bird for a month.",
      "verb": "catching"
    },
    {
      "sentence": "You will have been drawing an illustration since this morning by next week.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will have been playing with its owner all day by next week.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will have been traveling home for two hours by in two days.",
      "verb": "traveling"
    },
    {
      "sentence": "By next week, john will have been watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "John will have been making lunch since Monday by tonight.",
      "verb": "making"
    },
    {
      "sentence": "The cat will have been chasing the mouse for years by tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "She will have been submitting the contract for three days by tonight.",
      "verb": "submitting"
    },
    {
      "sentence": "He will have been playing volleyball for a month by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will have been running in the garden since Monday by next week.",
      "verb": "running"
    },
    {
      "sentence": "By in two days, the cat will have been chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, tom will have been speaking with the professor for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, emma will have been eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the children will have been creating a house for two hours.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, they will have been drinking a smoothie since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the teacher will have been fixing the car for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "By in two days, the students will have been submitting the assignment.",
      "verb": "submitting"
    },
    {
      "sentence": "We will have been having soup for two hours by later.",
      "verb": "having"
    },
    {
      "sentence": "By next month, the cat will have been chasing the other pets since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, he will have been fixing the fence for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "The students will have been painting a picture for three days by next month.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, our neighbors will have been preparing a cake.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, we will have been playing golf since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, my friend will have been sketching a diagram.",
      "verb": "sketching"
    },
    {
      "sentence": "The bird will have been eating quickly for a week by in two days.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, you will have been preparing a salad.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the bird will have been catching a bird since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, he will have been teaching English for a month.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, john will have been completing the proposal all week.",
      "verb": "completing"
    },
    {
      "sentence": "I will have been meeting the client all day by tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, i will have been considering the trip for a month.",
      "verb": "considering"
    },
    {
      "sentence": "John will have been listening to classical music for a week by this evening.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, john will have been selling the phone all day.",
      "verb": "selling"
    },
    {
      "sentence": "The manager will have been creating an app since this morning by tonight.",
      "verb": "creating"
    },
    {
      "sentence": "By this weekend, the cat will have been running across the field.",
      "verb": "running"
    },
    {
      "sentence": "The cat will have been eating its food all day by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, my parents will have been cooking a cake.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend will have been starting the document for years by tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "By this weekend, the children will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "Emma will have been seeing the teacher for a week by next year.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog will have been running around the house for three days by next year.",
      "verb": "running"
    },
    {
      "sentence": "She will have been emailing the manager for three days by in two days.",
      "verb": "emailing"
    },
    {
      "sentence": "The cat will have been chasing birds in the garden since Monday by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "By this evening, sarah will have been speaking to my family.",
      "verb": "speaking"
    },
    {
      "sentence": "Sarah will have been speaking to the manager for a week by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the children will have been drinking a smoothie for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird will have been playing with the toy all week by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, tom will have been playing basketball all day.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been buying a new car all day by tonight.",
      "verb": "buying"
    },
    {
      "sentence": "Sarah will have been playing the piano since yesterday by next year.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the dog will have been catching the mouse for a week.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, the company will have been winning the championship.",
      "verb": "winning"
    },
    {
      "sentence": "The students will have been organizing the kitchen for years by tomorrow.",
      "verb": "organizing"
    },
    {
      "sentence": "By this weekend, my friend will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "The manager will have been calling the client for a month by next week.",
      "verb": "calling"
    },
    {
      "sentence": "Our neighbors will have been starting the application since yesterday by tonight.",
      "verb": "starting"
    },
    {
      "sentence": "The cat will have been playing in the yard for years by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been starting the contract since yesterday by this weekend.",
      "verb": "starting"
    },
    {
      "sentence": "By this evening, john will have been speaking with my family.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother will have been playing chess all day by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "John will have been making dinner since this morning by next week.",
      "verb": "making"
    },
    {
      "sentence": "Her sister will have been emailing the team since this morning by next year.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, sarah will have been considering the meeting for years.",
      "verb": "considering"
    },
    {
      "sentence": "Our neighbors will have been cleaning the kitchen since Monday by next month.",
      "verb": "cleaning"
    },
    {
      "sentence": "By this weekend, they will have been seeing the neighbors.",
      "verb": "seeing"
    },
    {
      "sentence": "The cat will have been playing in the yard for a month by next year.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been chasing the other pets all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been emailing the doctor all week.",
      "verb": "emailing"
    },
    {
      "sentence": "By tomorrow, the teacher will have been having a meal.",
      "verb": "having"
    },
    {
      "sentence": "By next month, my friend will have been watching a movie for years.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the company will have been releasing the results for three days.",
      "verb": "releasing"
    },
    {
      "sentence": "By next month, she will have been reviewing Spanish since this morning.",
      "verb": "reviewing"
    },
    {
      "sentence": "By later, the dog will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "By in two days, my parents will have been reading the chapter.",
      "verb": "reading"
    },
    {
      "sentence": "I will have been listening to a song since this morning by in two days.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, we will have been forgetting the trip for two hours.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, i will have been finishing the document all day.",
      "verb": "finishing"
    },
    {
      "sentence": "My brother will have been repairing the door for a month by this weekend.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, my parents will have been fixing the car for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, my friend will have been contacting the doctor since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, tom will have been selling the ticket all week.",
      "verb": "selling"
    },
    {
      "sentence": "She will have been eating a meal for two hours by next month.",
      "verb": "eating"
    },
    {
      "sentence": "You will have been getting a new car for years by tonight.",
      "verb": "getting"
    },
    {
      "sentence": "By soon, my parents will have been repairing the sink.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird will have been running across the field all week by soon.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the bird will have been running across the field.",
      "verb": "running"
    },
    {
      "sentence": "By this weekend, the bird will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "By later, they will have been baking soup.",
      "verb": "baking"
    },
    {
      "sentence": "My friend will have been listening to the lecture for three days by this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "By tomorrow, my friend will have been finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "The company will have been releasing the project for years by this evening.",
      "verb": "releasing"
    },
    {
      "sentence": "By next month, her sister will have been drawing a design since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, you will have been walking to the gym for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "John will have been drinking juice since Monday by next month.",
      "verb": "drinking"
    },
    {
      "sentence": "By this evening, sarah will have been giving a gift.",
      "verb": "giving"
    },
    {
      "sentence": "By next month, we will have been drinking water for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, we will have been baking dinner for a month.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, the cat will have been sleeping all day all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "He will have been choosing flowers since yesterday by this evening.",
      "verb": "choosing"
    },
    {
      "sentence": "By next year, sarah will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah will have been contacting the client for three days by tomorrow.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister will have been preparing dinner all week by soon.",
      "verb": "preparing"
    },
    {
      "sentence": "By next week, john will have been forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, he will have been drinking milk all week.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the cat will have been eating its breakfast since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the manager will have been teaching vocabulary since yesterday.",
      "verb": "teaching"
    },
    {
      "sentence": "We will have been painting a landscape for three days by in two days.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, emma will have been choosing a laptop for a month.",
      "verb": "choosing"
    },
    {
      "sentence": "By soon, she will have been making lunch.",
      "verb": "making"
    },
    {
      "sentence": "By next month, the teacher will have been repairing the fence for years.",
      "verb": "repairing"
    },
    {
      "sentence": "We will have been leaving to the office since Monday by later.",
      "verb": "leaving"
    },
    {
      "sentence": "Emma will have been listening to the lecture for two hours by tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will have been catching a bird for years by this evening.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, you will have been playing the piano for a week.",
      "verb": "playing"
    },
    {
      "sentence": "You will have been building a plan all day by next week.",
      "verb": "building"
    },
    {
      "sentence": "The students will have been seeing my grandmother since yesterday by later.",
      "verb": "seeing"
    },
    {
      "sentence": "By this weekend, my brother will have been creating a plan.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the students will have been visiting my parents for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "By next year, the dog will have been playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been chasing the squirrel since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, they will have been fixing the fence all day.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the dog will have been playing with its owner for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, i will have been washing the garage.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, the bird will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "By in two days, the company will have been developing the software.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, the children will have been cooking cookies all week.",
      "verb": "cooking"
    },
    {
      "sentence": "By soon, i will have been creating a plan.",
      "verb": "creating"
    },
    {
      "sentence": "Emma will have been playing chess since Monday by later.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, my brother will have been understanding mathematics for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "He will have been building a model since this morning by next year.",
      "verb": "building"
    },
    {
      "sentence": "My friend will have been creating a house for three days by next week.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the bird will have been eating some food all week.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the cat will have been catching the frisbee since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the bird will have been sleeping in the corner for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tonight, the dog will have been chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the dog will have been chasing the squirrel for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, they will have been giving a book for a month.",
      "verb": "giving"
    },
    {
      "sentence": "By next month, my brother will have been practicing for the exam all week.",
      "verb": "practicing"
    },
    {
      "sentence": "By next week, the team will have been developing the contract.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, our neighbors will have been playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the bird will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, our neighbors will have been teaching English for a week.",
      "verb": "teaching"
    },
    {
      "sentence": "The cat will have been running through the grass for years by soon.",
      "verb": "running"
    },
    {
      "sentence": "By next month, tom will have been eating soup for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been meeting my family for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "By this weekend, he will have been drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend will have been reading the material all week by soon.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, my friend will have been listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "I will have been forgetting the vacation all day by next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "By soon, her sister will have been playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been catching the toy since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By next year, i will have been cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "By tonight, they will have been tidying the bathroom.",
      "verb": "tidying"
    },
    {
      "sentence": "By next month, the teacher will have been repairing the door since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the teacher will have been organizing the house.",
      "verb": "organizing"
    },
    {
      "sentence": "I will have been receiving the assignment for years by next month.",
      "verb": "receiving"
    },
    {
      "sentence": "By this weekend, he will have been talking to the neighbors.",
      "verb": "talking"
    },
    {
      "sentence": "The manager will have been cleaning the house since Monday by in two days.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, the students will have been preparing a meal for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "By soon, my brother will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the cat will have been sleeping on the couch for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The teacher will have been texting the office for a month by next year.",
      "verb": "texting"
    },
    {
      "sentence": "Her sister will have been emailing the client for a week by in two days.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, you will have been buying flowers all week.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, i will have been repairing the roof all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, her sister will have been contacting the client for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "We will have been washing the house for three days by tonight.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, sarah will have been playing volleyball all day.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been catching the ball for a month.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister will have been making a meal since yesterday by this evening.",
      "verb": "making"
    },
    {
      "sentence": "The team will have been winning the deal for years by this evening.",
      "verb": "winning"
    },
    {
      "sentence": "The teacher will have been running to the beach since yesterday by this evening.",
      "verb": "running"
    },
    {
      "sentence": "By next month, our neighbors will have been watching a show since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "The dog will have been running in the garden all week by this weekend.",
      "verb": "running"
    },
    {
      "sentence": "The teacher will have been seeing my parents since yesterday by tonight.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, you will have been drawing the wall all day.",
      "verb": "drawing"
    },
    {
      "sentence": "By soon, the cat will have been playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping on the bed for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents will have been seeing the client for years by tonight.",
      "verb": "seeing"
    },
    {
      "sentence": "By later, the bird will have been catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the bird will have been running in the yard all day.",
      "verb": "running"
    },
    {
      "sentence": "Sarah will have been receiving the task for years by next month.",
      "verb": "receiving"
    },
    {
      "sentence": "By in two days, my parents will have been calling the office.",
      "verb": "calling"
    },
    {
      "sentence": "By in two days, the cat will have been eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, john will have been having lunch.",
      "verb": "having"
    },
    {
      "sentence": "By next month, he will have been finishing the contract for three days.",
      "verb": "finishing"
    },
    {
      "sentence": "By next week, emma will have been listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, our neighbors will have been writing the project.",
      "verb": "writing"
    },
    {
      "sentence": "By next month, the cat will have been eating its breakfast since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "By soon, my parents will have been understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "By next month, the teacher will have been fixing the door since Monday.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, i will have been starting the letter for two hours.",
      "verb": "starting"
    },
    {
      "sentence": "By soon, john will have been preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "By later, the children will have been repairing the bike.",
      "verb": "repairing"
    },
    {
      "sentence": "My brother will have been talking to my friend since this morning by tomorrow.",
      "verb": "talking"
    },
    {
      "sentence": "The dog will have been chasing the toy for a month by tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, we will have been cleaning the kitchen all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next week, he will have been playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, the students will have been preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the company will have been releasing the results all week.",
      "verb": "releasing"
    },
    {
      "sentence": "By soon, sarah will have been watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, her sister will have been drawing a portrait for a week.",
      "verb": "drawing"
    },
    {
      "sentence": "By tomorrow, you will have been finding a present.",
      "verb": "finding"
    },
    {
      "sentence": "By in two days, you will have been walking to the library.",
      "verb": "walking"
    },
    {
      "sentence": "The cat will have been playing with its owner for years by soon.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the students will have been making soup since this morning.",
      "verb": "making"
    },
    {
      "sentence": "By next month, our neighbors will have been drinking some water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister will have been drawing a diagram all day by next year.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah will have been having pizza since this morning by tomorrow.",
      "verb": "having"
    },
    {
      "sentence": "By later, they will have been contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "She will have been calling the manager for a week by tonight.",
      "verb": "calling"
    },
    {
      "sentence": "The cat will have been sleeping on the bed for years by soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "John will have been arriving home since this morning by this weekend.",
      "verb": "arriving"
    },
    {
      "sentence": "Tom will have been building a model for years by tonight.",
      "verb": "building"
    },
    {
      "sentence": "Her sister will have been going to the library for two hours by later.",
      "verb": "going"
    },
    {
      "sentence": "By this weekend, tom will have been reviewing the textbook.",
      "verb": "reviewing"
    },
    {
      "sentence": "He will have been texting customer service for a month by tonight.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, they will have been speaking with my parents for years.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the children will have been driving to the park.",
      "verb": "driving"
    },
    {
      "sentence": "By next month, sarah will have been selling some clothes all day.",
      "verb": "selling"
    },
    {
      "sentence": "By next month, the manager will have been playing video games for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "You will have been speaking to the neighbors for years by later.",
      "verb": "speaking"
    },
    {
      "sentence": "By next year, the children will have been deciding on the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "He will have been baking dinner for three days by next year.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, you will have been repairing the door all week.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents will have been playing guitar all day by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will have been returning to the market since Monday by tonight.",
      "verb": "returning"
    },
    {
      "sentence": "By next month, her sister will have been preparing soup since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, my parents will have been walking to the office.",
      "verb": "walking"
    },
    {
      "sentence": "By next week, we will have been returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "By next month, the children will have been creating a website.",
      "verb": "creating"
    },
    {
      "sentence": "By this weekend, the cat will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By later, my parents will have been talking to my friend.",
      "verb": "talking"
    },
    {
      "sentence": "By tonight, the bird will have been sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "My friend will have been fixing the machine for three days by soon.",
      "verb": "fixing"
    },
    {
      "sentence": "By next year, the students will have been speaking with the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "I will have been forgetting the meeting since yesterday by later.",
      "verb": "forgetting"
    },
    {
      "sentence": "He will have been designing a project all day by in two days.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the dog will have been chasing the ball since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents will have been speaking to the boss for three days by next year.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, she will have been organizing the office since Monday.",
      "verb": "organizing"
    },
    {
      "sentence": "By this evening, he will have been practicing the material.",
      "verb": "practicing"
    },
    {
      "sentence": "By next month, the students will have been watching a video for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The students will have been coming to the store since this morning by this evening.",
      "verb": "coming"
    },
    {
      "sentence": "He will have been cooking pasta for three days by tonight.",
      "verb": "cooking"
    },
    {
      "sentence": "By later, my friend will have been fixing the bike.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, john will have been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "By in two days, tom will have been choosing a book.",
      "verb": "choosing"
    },
    {
      "sentence": "The manager will have been baking a meal since this morning by this weekend.",
      "verb": "baking"
    },
    {
      "sentence": "By tonight, the children will have been driving to the hospital.",
      "verb": "driving"
    },
    {
      "sentence": "The company will have been developing the project for a week by this weekend.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, he will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, they will have been talking to my parents for years.",
      "verb": "talking"
    },
    {
      "sentence": "The dog will have been eating its food for a month by later.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah will have been listening to music for a week by later.",
      "verb": "listening"
    },
    {
      "sentence": "Emma will have been eating dinner for a week by tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "By this evening, we will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, her sister will have been cleaning the kitchen for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "He will have been calling my parents for three days by tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "My parents will have been planning the options all week by later.",
      "verb": "planning"
    },
    {
      "sentence": "She will have been eating a snack since yesterday by next month.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been forgetting the vacation since this morning by in two days.",
      "verb": "forgetting"
    },
    {
      "sentence": "He will have been fixing the bike for a month by tomorrow.",
      "verb": "fixing"
    },
    {
      "sentence": "By tonight, i will have been teaching the chapter.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, tom will have been sketching an illustration for two hours.",
      "verb": "sketching"
    },
    {
      "sentence": "My parents will have been listening to jazz for a week by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the bird will have been sleeping under the table all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team will have been winning the results all day by next month.",
      "verb": "winning"
    },
    {
      "sentence": "By next month, the teacher will have been driving home since this morning.",
      "verb": "driving"
    },
    {
      "sentence": "By next month, they will have been playing soccer since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been running across the field since yesterday by in two days.",
      "verb": "running"
    },
    {
      "sentence": "He will have been arriving to the office since yesterday by next month.",
      "verb": "arriving"
    },
    {
      "sentence": "By later, you will have been learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "The bird will have been catching the frisbee for years by this evening.",
      "verb": "catching"
    },
    {
      "sentence": "The cat will have been chasing its tail all week by this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "By soon, sarah will have been understanding vocabulary.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog will have been running across the field for two hours by tonight.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors will have been designing a house since Monday by later.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, tom will have been arriving to the gym for two hours.",
      "verb": "arriving"
    },
    {
      "sentence": "John will have been thinking about the trip for two hours by this evening.",
      "verb": "thinking"
    },
    {
      "sentence": "By next year, the manager will have been playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will have been eating a treat for a month by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, emma will have been leaving to the market for three days.",
      "verb": "leaving"
    },
    {
      "sentence": "By next month, you will have been choosing a laptop for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "By in two days, the team will have been winning a new product.",
      "verb": "winning"
    },
    {
      "sentence": "We will have been washing the house since yesterday by soon.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, the bird will have been sleeping on the bed since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the teacher will have been preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird will have been chasing the other pets for a week by tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "By in two days, my friend will have been going downtown.",
      "verb": "going"
    },
    {
      "sentence": "By this weekend, her sister will have been listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "I will have been leaving home since this morning by soon.",
      "verb": "leaving"
    },
    {
      "sentence": "By next year, we will have been listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, my brother will have been remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "By tonight, the teacher will have been painting a portrait.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the manager will have been fixing the machine.",
      "verb": "fixing"
    },
    {
      "sentence": "The team will have been releasing the project all day by soon.",
      "verb": "releasing"
    },
    {
      "sentence": "By next year, i will have been choosing a gift.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, he will have been visiting an old friend.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, the bird will have been catching the frisbee since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "The cat will have been chasing its tail for three days by this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, they will have been coming to the market since yesterday.",
      "verb": "coming"
    },
    {
      "sentence": "We will have been fixing the car all week by next month.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents will have been preparing pasta for a month by next year.",
      "verb": "preparing"
    },
    {
      "sentence": "By soon, the company will have been completing the results.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, we will have been reviewing science for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "By soon, sarah will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "By next year, my parents will have been listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, he will have been reviewing English.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird will have been running in circles for years by next year.",
      "verb": "running"
    },
    {
      "sentence": "My parents will have been watching a documentary since this morning by soon.",
      "verb": "watching"
    },
    {
      "sentence": "The students will have been making soup since yesterday by in two days.",
      "verb": "making"
    },
    {
      "sentence": "By later, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By next week, the cat will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By next month, john will have been designing a plan all day.",
      "verb": "designing"
    },
    {
      "sentence": "My parents will have been drinking coffee since yesterday by this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, our neighbors will have been drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the bird will have been playing with the ball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, the team will have been completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "By this evening, emma will have been listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the dog will have been playing with the toy for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the students will have been fixing the sink all week.",
      "verb": "fixing"
    },
    {
      "sentence": "By tomorrow, my parents will have been sending the document.",
      "verb": "sending"
    },
    {
      "sentence": "By next month, the dog will have been eating its breakfast for three days.",
      "verb": "eating"
    },
    {
      "sentence": "They will have been emailing the doctor since yesterday by tonight.",
      "verb": "emailing"
    },
    {
      "sentence": "I will have been repairing the door for two hours by tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird will have been catching a treat for years by later.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, our neighbors will have been preparing a cake since this morning.",
      "verb": "preparing"
    },
    {
      "sentence": "The cat will have been playing with the other pets since yesterday by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "You will have been texting my family since Monday by in two days.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, the children will have been having dinner for a week.",
      "verb": "having"
    },
    {
      "sentence": "By next month, he will have been getting a laptop for a month.",
      "verb": "getting"
    },
    {
      "sentence": "By soon, she will have been cooking a cake.",
      "verb": "cooking"
    },
    {
      "sentence": "By later, the dog will have been playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will have been talking to my family since Monday by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, the bird will have been sleeping in the sun all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, i will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, we will have been cooking soup all day.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will have been sleeping by the window all week by this weekend.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tonight, the bird will have been running across the field.",
      "verb": "running"
    },
    {
      "sentence": "The team will have been winning the update for years by soon.",
      "verb": "winning"
    },
    {
      "sentence": "John will have been painting a portrait since yesterday by this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the cat will have been playing in the yard for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, the bird will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "The students will have been choosing the phone all week by next month.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents will have been buying the phone since yesterday by next week.",
      "verb": "buying"
    },
    {
      "sentence": "By soon, my brother will have been arriving to the library.",
      "verb": "arriving"
    },
    {
      "sentence": "By next month, sarah will have been starting the email since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "I will have been listening to music since yesterday by in two days.",
      "verb": "listening"
    },
    {
      "sentence": "She will have been listening to an audiobook since Monday by next year.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will have been eating breakfast since this morning by tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been chasing birds in the garden for a week by this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog will have been sleeping under the table for years by tonight.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team will have been developing a new product since yesterday by tonight.",
      "verb": "developing"
    },
    {
      "sentence": "She will have been having a snack since yesterday by tomorrow.",
      "verb": "having"
    },
    {
      "sentence": "By next week, the team will have been launching the contract.",
      "verb": "launching"
    },
    {
      "sentence": "By next month, the bird will have been chasing the toy for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "By later, they will have been meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma will have been painting a diagram for three days by next year.",
      "verb": "painting"
    },
    {
      "sentence": "The teacher will have been playing golf since Monday by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, he will have been fixing the door for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By tonight, her sister will have been reviewing the notes.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next month, the teacher will have been playing tennis since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, sarah will have been learning the chapter.",
      "verb": "learning"
    },
    {
      "sentence": "By soon, the manager will have been drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "By tomorrow, the manager will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the manager will have been speaking with my friend all day.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother will have been watching the news all day by in two days.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, my brother will have been selling a new car since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "By next month, you will have been listening to the lecture since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, i will have been buying a new car all day.",
      "verb": "buying"
    },
    {
      "sentence": "By in two days, my friend will have been repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "By next year, they will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By next year, we will have been speaking to my family.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the cat will have been catching a butterfly for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, the bird will have been running in circles.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the manager will have been choosing a new house since this morning.",
      "verb": "choosing"
    },
    {
      "sentence": "Her sister will have been selling flowers since Monday by this weekend.",
      "verb": "selling"
    },
    {
      "sentence": "By next month, the dog will have been playing with the other pets for three days.",
      "verb": "playing"
    },
    {
      "sentence": "They will have been flying home for three days by this evening.",
      "verb": "flying"
    },
    {
      "sentence": "By tomorrow, the students will have been starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "The teacher will have been drinking water for a month by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the teacher will have been flying to the market all week.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, the company will have been releasing a new product for a week.",
      "verb": "releasing"
    },
    {
      "sentence": "By later, sarah will have been contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, sarah will have been building a model for two hours.",
      "verb": "building"
    },
    {
      "sentence": "By next year, i will have been cooking a cake.",
      "verb": "cooking"
    },
    {
      "sentence": "Emma will have been drawing a picture all week by in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "By next year, the dog will have been sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the dog will have been running in the yard since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "Tom will have been choosing the keys since yesterday by next month.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, i will have been emailing my family for a week.",
      "verb": "emailing"
    },
    {
      "sentence": "My friend will have been considering the event since Monday by tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, tom will have been writing the project all day.",
      "verb": "writing"
    },
    {
      "sentence": "You will have been visiting the client all week by in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "By tomorrow, she will have been preparing the report.",
      "verb": "preparing"
    },
    {
      "sentence": "Sarah will have been eating breakfast for a month by this evening.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will have been speaking with the team for a week by tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "By tomorrow, you will have been reading English.",
      "verb": "reading"
    },
    {
      "sentence": "The bird will have been chasing the ball for years by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog will have been sleeping on the couch for a month by soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "The students will have been tidying the bathroom all week by next week.",
      "verb": "tidying"
    },
    {
      "sentence": "The bird will have been eating a treat all week by next year.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the bird will have been chasing birds in the garden since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will have been eating the leftover food for years by next year.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah will have been meeting the doctor since yesterday by soon.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager will have been painting a design for three days by soon.",
      "verb": "painting"
    },
    {
      "sentence": "John will have been buying a present since Monday by next week.",
      "verb": "buying"
    },
    {
      "sentence": "By tomorrow, he will have been going to the beach.",
      "verb": "going"
    },
    {
      "sentence": "I will have been learning for the exam for a month by tonight.",
      "verb": "learning"
    },
    {
      "sentence": "My friend will have been eating pasta for a month by later.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, the students will have been writing the project.",
      "verb": "writing"
    },
    {
      "sentence": "She will have been listening to music since Monday by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By this weekend, the manager will have been speaking with the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher will have been writing the document for two hours by soon.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors will have been getting groceries since this morning by later.",
      "verb": "getting"
    },
    {
      "sentence": "By next month, tom will have been eating pizza for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By later, the bird will have been catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the dog will have been eating its dinner for years.",
      "verb": "eating"
    },
    {
      "sentence": "The manager will have been watching a show all week by later.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher will have been cooking a meal all day by next week.",
      "verb": "cooking"
    },
    {
      "sentence": "By next year, my friend will have been creating a house.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the manager will have been playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, emma will have been speaking to my friend.",
      "verb": "speaking"
    },
    {
      "sentence": "By next year, my brother will have been playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, my parents will have been fixing the door all day.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother will have been reading the material since this morning by this weekend.",
      "verb": "reading"
    },
    {
      "sentence": "The dog will have been sleeping in the corner for three days by later.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother will have been planning the problem all day by in two days.",
      "verb": "planning"
    },
    {
      "sentence": "By next month, her sister will have been eating a sandwich since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "We will have been seeing my family since yesterday by next week.",
      "verb": "seeing"
    },
    {
      "sentence": "My brother will have been receiving the letter since this morning by later.",
      "verb": "receiving"
    },
    {
      "sentence": "The bird will have been eating a treat for three days by next year.",
      "verb": "eating"
    },
    {
      "sentence": "They will have been learning French all day by tomorrow.",
      "verb": "learning"
    },
    {
      "sentence": "By next year, she will have been playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, her sister will have been giving a new house.",
      "verb": "giving"
    },
    {
      "sentence": "By next month, the teacher will have been eating lunch for a month.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, she will have been calling the doctor since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, she will have been seeing the client all week.",
      "verb": "seeing"
    },
    {
      "sentence": "By soon, john will have been finding a new house.",
      "verb": "finding"
    },
    {
      "sentence": "By in two days, the teacher will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, my friend will have been speaking with the teacher for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother will have been repairing the car since yesterday by tonight.",
      "verb": "repairing"
    },
    {
      "sentence": "By soon, the bird will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been catching a bird all day by next year.",
      "verb": "catching"
    },
    {
      "sentence": "By this evening, my brother will have been creating a prototype.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, emma will have been eating dinner since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "The students will have been drinking a smoothie for a week by this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "We will have been washing the office since this morning by next week.",
      "verb": "washing"
    },
    {
      "sentence": "By next week, the teacher will have been cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "Our neighbors will have been drinking water for a month by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "By in two days, the teacher will have been sending the task.",
      "verb": "sending"
    },
    {
      "sentence": "By next month, the cat will have been catching a bird for a month.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the manager will have been fixing the computer all week.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird will have been catching the ball since this morning by tonight.",
      "verb": "catching"
    },
    {
      "sentence": "By tonight, the cat will have been playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the children will have been building a model for three days.",
      "verb": "building"
    },
    {
      "sentence": "By this evening, i will have been playing football.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the cat will have been running across the field for three days.",
      "verb": "running"
    },
    {
      "sentence": "By next month, john will have been drinking tea since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the students will have been seeing my friend since Monday.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the cat will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "You will have been organizing the dishes for years by tonight.",
      "verb": "organizing"
    },
    {
      "sentence": "By next month, my parents will have been fixing the sink for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the bird will have been eating quickly for a month.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, she will have been creating a presentation since yesterday.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the dog will have been eating some food since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "My parents will have been choosing flowers since Monday by tonight.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors will have been having pizza since yesterday by next month.",
      "verb": "having"
    },
    {
      "sentence": "By next month, he will have been repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, you will have been designing a prototype for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the students will have been cooking pasta all week.",
      "verb": "cooking"
    },
    {
      "sentence": "By next year, my parents will have been receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "By tonight, my friend will have been painting an illustration.",
      "verb": "painting"
    },
    {
      "sentence": "By this evening, her sister will have been emailing my friend.",
      "verb": "emailing"
    },
    {
      "sentence": "Tom will have been considering the event for two hours by tonight.",
      "verb": "considering"
    },
    {
      "sentence": "Emma will have been deciding on the plan for years by next month.",
      "verb": "deciding"
    },
    {
      "sentence": "By next month, the teacher will have been playing chess for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, tom will have been meeting the client for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "By this weekend, her sister will have been having a sandwich.",
      "verb": "having"
    },
    {
      "sentence": "Emma will have been repairing the sink for years by tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will have been playing in the yard for years by next year.",
      "verb": "playing"
    },
    {
      "sentence": "My parents will have been visiting the client since this morning by tomorrow.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher will have been cooking a meal since yesterday by tomorrow.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, the cat will have been playing with the toy since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, she will have been giving the ticket for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "By later, her sister will have been preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher will have been sketching a picture for a month by soon.",
      "verb": "sketching"
    },
    {
      "sentence": "The manager will have been designing a plan since this morning by tonight.",
      "verb": "designing"
    },
    {
      "sentence": "My friend will have been meeting my family since yesterday by this weekend.",
      "verb": "meeting"
    },
    {
      "sentence": "By soon, my brother will have been drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the bird will have been eating its food for a month.",
      "verb": "eating"
    },
    {
      "sentence": "My parents will have been playing guitar for a week by later.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, they will have been contacting my friend since this morning.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will have been considering the meeting for two hours by soon.",
      "verb": "considering"
    },
    {
      "sentence": "Tom will have been organizing the bathroom all day by tonight.",
      "verb": "organizing"
    },
    {
      "sentence": "By next month, the team will have been completing a new product for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, my brother will have been sketching a diagram since this morning.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma will have been drawing the wall for two hours by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, i will have been understanding science since yesterday.",
      "verb": "understanding"
    },
    {
      "sentence": "By next month, the dog will have been catching a butterfly since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By this evening, the teacher will have been speaking to my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat will have been eating its dinner for a month by in two days.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the teacher will have been drinking some water since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the dog will have been chasing the toy for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "John will have been speaking with the doctor for two hours by this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "By tonight, the manager will have been watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, she will have been watching a movie since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "The company will have been developing the results since Monday by next month.",
      "verb": "developing"
    },
    {
      "sentence": "My brother will have been texting the teacher for a week by later.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, my parents will have been coming to school.",
      "verb": "coming"
    },
    {
      "sentence": "Tom will have been repairing the computer for two hours by soon.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager will have been playing the piano for a month by next month.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been having a snack for three days by next week.",
      "verb": "having"
    },
    {
      "sentence": "By later, her sister will have been building a project.",
      "verb": "building"
    },
    {
      "sentence": "By next month, tom will have been understanding grammar for years.",
      "verb": "understanding"
    },
    {
      "sentence": "By tonight, she will have been drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "The children will have been buying flowers since this morning by this evening.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, my friend will have been watching a series since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will have been playing football for three days by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, she will have been contacting the office.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the bird will have been catching the frisbee for a week.",
      "verb": "catching"
    },
    {
      "sentence": "By next year, john will have been playing football.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the company will have been releasing the results for two hours.",
      "verb": "releasing"
    },
    {
      "sentence": "By next month, you will have been forgetting the situation for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the manager will have been writing the document all week.",
      "verb": "writing"
    },
    {
      "sentence": "By in two days, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By tonight, the bird will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, the company will have been releasing the project.",
      "verb": "releasing"
    },
    {
      "sentence": "By this evening, the students will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, tom will have been playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will have been going home for a week by this evening.",
      "verb": "going"
    },
    {
      "sentence": "By next month, you will have been painting a landscape for three days.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, sarah will have been forgetting the situation.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company will have been developing a new product since Monday by next month.",
      "verb": "developing"
    },
    {
      "sentence": "By next week, they will have been meeting an old friend.",
      "verb": "meeting"
    },
    {
      "sentence": "By tomorrow, the children will have been choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, our neighbors will have been listening to the news for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will have been chasing the other pets for a month by tonight.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been visiting the neighbors all week.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, the bird will have been chasing its tail for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, emma will have been painting a diagram all week.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the bird will have been sleeping all day all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the bird will have been sleeping on the couch since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "By this evening, i will have been calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "By next week, i will have been starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "By next month, the bird will have been eating its dinner for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the teacher will have been watching a show all day.",
      "verb": "watching"
    },
    {
      "sentence": "By later, the teacher will have been calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, the dog will have been eating some food all week.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been planning the birthday party for years.",
      "verb": "planning"
    },
    {
      "sentence": "By this weekend, the bird will have been playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the teacher will have been preparing pasta.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, he will have been getting a gift for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By next week, the children will have been repairing the roof.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the bird will have been sleeping by the window for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother will have been contacting the office for a month by next month.",
      "verb": "contacting"
    },
    {
      "sentence": "By next week, tom will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "Tom will have been playing soccer for three days by soon.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been playing in the park for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will have been fixing the machine all week by in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, her sister will have been painting a design all day.",
      "verb": "painting"
    },
    {
      "sentence": "The children will have been drinking milk since this morning by tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, my brother will have been choosing the phone for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "By this evening, my friend will have been visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, you will have been contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "I will have been reviewing vocabulary all day by tonight.",
      "verb": "reviewing"
    },
    {
      "sentence": "Our neighbors will have been listening to an audiobook for two hours by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the bird will have been chasing birds in the garden all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By later, the children will have been seeing the neighbors.",
      "verb": "seeing"
    },
    {
      "sentence": "John will have been tidying the house all week by next week.",
      "verb": "tidying"
    },
    {
      "sentence": "By next month, the dog will have been playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, sarah will have been contacting my family for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the company will have been winning the contract all week.",
      "verb": "winning"
    },
    {
      "sentence": "By tonight, he will have been cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "The students will have been repairing the computer for three days by this evening.",
      "verb": "repairing"
    },
    {
      "sentence": "By tonight, emma will have been finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "By next month, the bird will have been eating its breakfast for years.",
      "verb": "eating"
    },
    {
      "sentence": "My parents will have been seeing the client for two hours by this evening.",
      "verb": "seeing"
    },
    {
      "sentence": "By tomorrow, the bird will have been running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "By next month, my brother will have been considering the problem for three days.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, we will have been finishing the assignment for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping by the window for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the cat will have been playing with the other pets all week.",
      "verb": "playing"
    },
    {
      "sentence": "By this evening, our neighbors will have been cooking a cake.",
      "verb": "cooking"
    },
    {
      "sentence": "By soon, my brother will have been organizing the car.",
      "verb": "organizing"
    },
    {
      "sentence": "By next week, the bird will have been running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "By next year, she will have been making pasta.",
      "verb": "making"
    },
    {
      "sentence": "By next month, the students will have been drinking juice since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, our neighbors will have been returning to the park since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "By tomorrow, we will have been watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the bird will have been playing in the yard for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The children will have been flying to the airport since Monday by this evening.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah will have been eating some fruit all week by tonight.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the manager will have been playing the piano for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will have been playing with the toy for a week by later.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, my brother will have been designing an app.",
      "verb": "designing"
    },
    {
      "sentence": "We will have been meeting my friend for years by this weekend.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah will have been watching a show all day by next year.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will have been giving the ticket for a month by next month.",
      "verb": "giving"
    },
    {
      "sentence": "By tomorrow, the cat will have been eating some food.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will have been eating quickly since yesterday by in two days.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been baking dinner since Monday.",
      "verb": "baking"
    },
    {
      "sentence": "The students will have been forgetting the situation all week by soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the teacher will have been painting a design for three days.",
      "verb": "painting"
    },
    {
      "sentence": "By next week, our neighbors will have been reading the material.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, i will have been washing the office since Monday.",
      "verb": "washing"
    },
    {
      "sentence": "By this weekend, the bird will have been eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "We will have been listening to an audiobook all week by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By later, the students will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom will have been forgetting the future for three days by this weekend.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the cat will have been chasing the mouse for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my parents will have been watching football all day.",
      "verb": "watching"
    },
    {
      "sentence": "By later, the bird will have been running around the house.",
      "verb": "running"
    },
    {
      "sentence": "You will have been drawing the wall since yesterday by next year.",
      "verb": "drawing"
    },
    {
      "sentence": "By in two days, our neighbors will have been drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the team will have been launching the software since yesterday.",
      "verb": "launching"
    },
    {
      "sentence": "The children will have been coming to the airport for a month by in two days.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, the team will have been announcing the software for years.",
      "verb": "announcing"
    },
    {
      "sentence": "I will have been eating pasta since this morning by later.",
      "verb": "eating"
    },
    {
      "sentence": "The students will have been talking to the professor since this morning by next month.",
      "verb": "talking"
    },
    {
      "sentence": "The dog will have been chasing its tail for three days by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been tidying the kitchen since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "By next month, the bird will have been playing with the ball for three days.",
      "verb": "playing"
    },
    {
      "sentence": "We will have been playing volleyball since Monday by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been running around the house since yesterday by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the children will have been playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the teacher will have been reading the lesson for three days.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister will have been going to the beach all week by later.",
      "verb": "going"
    },
    {
      "sentence": "She will have been playing guitar for years by next month.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been watching a video since yesterday by next week.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the cat will have been running through the grass since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "The dog will have been chasing the squirrel since yesterday by next month.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been listening to music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The manager will have been finishing the presentation for two hours by next month.",
      "verb": "finishing"
    },
    {
      "sentence": "Emma will have been playing soccer for two hours by next month.",
      "verb": "playing"
    },
    {
      "sentence": "He will have been preparing soup all day by next month.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, we will have been talking to the client for years.",
      "verb": "talking"
    },
    {
      "sentence": "By in two days, emma will have been cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, he will have been watching a video for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, the teacher will have been listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the dog will have been eating its breakfast for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will have been playing with the ball for a week by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, we will have been teaching science.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, i will have been contacting the office for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, the manager will have been choosing a book since this morning.",
      "verb": "choosing"
    },
    {
      "sentence": "By in two days, tom will have been choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, the bird will have been running in the yard for three days.",
      "verb": "running"
    },
    {
      "sentence": "By later, my brother will have been organizing the room.",
      "verb": "organizing"
    },
    {
      "sentence": "By this weekend, the dog will have been running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "By this evening, the cat will have been chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog will have been catching a butterfly for a month by next week.",
      "verb": "catching"
    },
    {
      "sentence": "By this weekend, john will have been traveling to the bank.",
      "verb": "traveling"
    },
    {
      "sentence": "By next week, the dog will have been playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, sarah will have been fixing the machine for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By this evening, they will have been giving some clothes.",
      "verb": "giving"
    },
    {
      "sentence": "By next month, the teacher will have been drinking water since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, the students will have been starting the letter.",
      "verb": "starting"
    },
    {
      "sentence": "By this weekend, we will have been creating a model.",
      "verb": "creating"
    },
    {
      "sentence": "By this evening, the teacher will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "By in two days, emma will have been playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "I will have been repairing the sink for three days by this weekend.",
      "verb": "repairing"
    },
    {
      "sentence": "We will have been playing golf for two hours by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "By later, i will have been completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, the children will have been organizing the room for two hours.",
      "verb": "organizing"
    },
    {
      "sentence": "My parents will have been repairing the bike since Monday by next month.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will have been chasing its tail for years by tonight.",
      "verb": "chasing"
    },
    {
      "sentence": "By soon, the dog will have been eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "The children will have been visiting the team all week by later.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, the teacher will have been buying a present since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "The dog will have been playing in the park for a week by later.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, the cat will have been eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, we will have been making a salad since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "By next month, my brother will have been studying history.",
      "verb": "studying"
    },
    {
      "sentence": "The manager will have been cooking breakfast all day by next month.",
      "verb": "cooking"
    },
    {
      "sentence": "By this weekend, john will have been visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, my parents will have been thinking about the options for a week.",
      "verb": "thinking"
    },
    {
      "sentence": "My friend will have been playing golf for a month by next year.",
      "verb": "playing"
    },
    {
      "sentence": "John will have been creating a house for a week by later.",
      "verb": "creating"
    },
    {
      "sentence": "By in two days, the dog will have been eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "By in two days, tom will have been having lunch.",
      "verb": "having"
    },
    {
      "sentence": "By next month, my brother will have been preparing the task all week.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, emma will have been visiting the doctor for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "She will have been creating a presentation all week by tonight.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, my friend will have been tidying the clothes all day.",
      "verb": "tidying"
    },
    {
      "sentence": "Her sister will have been speaking with my friend all day by this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "The children will have been tidying the car all week by tomorrow.",
      "verb": "tidying"
    },
    {
      "sentence": "By in two days, emma will have been studying English.",
      "verb": "studying"
    },
    {
      "sentence": "Our neighbors will have been repairing the bike since this morning by next week.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will have been chasing the mouse since this morning by soon.",
      "verb": "chasing"
    },
    {
      "sentence": "By next week, the cat will have been running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "By next month, she will have been teaching grammar all day.",
      "verb": "teaching"
    },
    {
      "sentence": "By next week, the children will have been understanding Spanish.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog will have been sleeping in the corner since Monday by tomorrow.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the manager will have been speaking with my family since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, john will have been understanding English for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "By next month, sarah will have been cooking breakfast for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, the teacher will have been calling the teacher all day.",
      "verb": "calling"
    },
    {
      "sentence": "My parents will have been driving to school for a week by next month.",
      "verb": "driving"
    },
    {
      "sentence": "By next month, the cat will have been running in the yard since this morning.",
      "verb": "running"
    },
    {
      "sentence": "By next month, my brother will have been listening to an audiobook since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the cat will have been chasing the squirrel all week.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah will have been traveling to school for two hours by in two days.",
      "verb": "traveling"
    },
    {
      "sentence": "By next month, the dog will have been eating quickly for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, he will have been speaking with my parents all day.",
      "verb": "speaking"
    },
    {
      "sentence": "By next year, the cat will have been sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tonight, i will have been listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "By this weekend, the children will have been completing the email.",
      "verb": "completing"
    },
    {
      "sentence": "By later, emma will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "The bird will have been catching a butterfly for a week by this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, we will have been talking to the professor for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, the children will have been playing football since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, her sister will have been building a prototype since Monday.",
      "verb": "building"
    },
    {
      "sentence": "By next month, her sister will have been visiting the neighbors all week.",
      "verb": "visiting"
    },
    {
      "sentence": "By next month, the manager will have been texting the office for a month.",
      "verb": "texting"
    },
    {
      "sentence": "By in two days, john will have been listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "The manager will have been having soup since this morning by soon.",
      "verb": "having"
    },
    {
      "sentence": "The children will have been drawing a picture for a week by soon.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will have been playing with its owner for a week by next month.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will have been designing an app since yesterday by next year.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the cat will have been chasing its tail since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the team will have been developing the deal since Monday.",
      "verb": "developing"
    },
    {
      "sentence": "The dog will have been sleeping in the sun all day by next month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The teacher will have been meeting an old friend since Monday by this weekend.",
      "verb": "meeting"
    },
    {
      "sentence": "I will have been planning the situation all day by next year.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors will have been building a house for a month by later.",
      "verb": "building"
    },
    {
      "sentence": "By next month, she will have been deciding on the options for two hours.",
      "verb": "deciding"
    },
    {
      "sentence": "We will have been considering the decision for a month by tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "By tonight, she will have been repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "By this weekend, the teacher will have been eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the teacher will have been sending the proposal since yesterday.",
      "verb": "sending"
    },
    {
      "sentence": "By next week, the dog will have been playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been speaking to the doctor for years by next year.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, sarah will have been seeing the teacher for a month.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, our neighbors will have been sketching the wall since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "My parents will have been drawing a portrait for a week by next month.",
      "verb": "drawing"
    },
    {
      "sentence": "By in two days, the cat will have been chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my parents will have been drawing a picture since Monday.",
      "verb": "drawing"
    },
    {
      "sentence": "By tonight, i will have been speaking with my family.",
      "verb": "speaking"
    },
    {
      "sentence": "The children will have been buying a laptop since this morning by next week.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, she will have been watching a documentary for a week.",
      "verb": "watching"
    },
    {
      "sentence": "By soon, emma will have been repairing the bike.",
      "verb": "repairing"
    },
    {
      "sentence": "By soon, he will have been cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "By next week, john will have been emailing customer service.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, the children will have been flying to the market all day.",
      "verb": "flying"
    },
    {
      "sentence": "By next week, she will have been finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, our neighbors will have been practicing history for years.",
      "verb": "practicing"
    },
    {
      "sentence": "By this evening, my friend will have been designing a house.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, her sister will have been texting the client for a month.",
      "verb": "texting"
    },
    {
      "sentence": "The bird will have been catching a butterfly since this morning by next year.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, my friend will have been contacting the teacher for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "By next week, the bird will have been catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "The manager will have been drinking tea for three days by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will have been winning the deal since this morning by later.",
      "verb": "winning"
    },
    {
      "sentence": "By next month, he will have been drinking a smoothie for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "By this weekend, he will have been deciding on the trip.",
      "verb": "deciding"
    },
    {
      "sentence": "By next month, the bird will have been catching a treat for a month.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, tom will have been teaching English since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "My brother will have been texting the boss for years by this weekend.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, my brother will have been building a website all day.",
      "verb": "building"
    },
    {
      "sentence": "By in two days, he will have been cleaning the kitchen.",
      "verb": "cleaning"
    },
    {
      "sentence": "Our neighbors will have been teaching science since this morning by in two days.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog will have been catching a butterfly for a month by later.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, the dog will have been catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher will have been playing chess for three days by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the dog will have been chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister will have been calling the teacher all day by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "By this evening, we will have been painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "By next week, the cat will have been running in circles.",
      "verb": "running"
    },
    {
      "sentence": "We will have been arriving to the gym for a week by next week.",
      "verb": "arriving"
    },
    {
      "sentence": "By tonight, he will have been emailing the office.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, emma will have been preparing pasta for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the bird will have been playing with the toy for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the bird will have been playing in the garden for years.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the team will have been developing the software since this morning.",
      "verb": "developing"
    },
    {
      "sentence": "By tomorrow, the cat will have been sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, i will have been walking downtown all week.",
      "verb": "walking"
    },
    {
      "sentence": "By next month, i will have been coming to school all day.",
      "verb": "coming"
    },
    {
      "sentence": "By tomorrow, i will have been speaking with the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents will have been returning to the market all week by this evening.",
      "verb": "returning"
    },
    {
      "sentence": "The bird will have been chasing the squirrel for two hours by tonight.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, sarah will have been giving the phone for a week.",
      "verb": "giving"
    },
    {
      "sentence": "The students will have been talking to my friend for three days by next month.",
      "verb": "talking"
    },
    {
      "sentence": "By next year, the students will have been practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "By next month, my friend will have been studying science all day.",
      "verb": "studying"
    },
    {
      "sentence": "By next month, sarah will have been eating pasta since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been completing the report for a month by next year.",
      "verb": "completing"
    },
    {
      "sentence": "The cat will have been running in the park since this morning by next month.",
      "verb": "running"
    },
    {
      "sentence": "By next month, my brother will have been playing the piano since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By later, emma will have been speaking to the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, you will have been forgetting the problem for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "The dog will have been sleeping in the sun for two hours by in two days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the bird will have been playing with the toy all week.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the dog will have been sleeping in the corner since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "By later, the team will have been developing the software.",
      "verb": "developing"
    },
    {
      "sentence": "By tonight, you will have been building a project.",
      "verb": "building"
    },
    {
      "sentence": "By tonight, they will have been cleaning the dishes.",
      "verb": "cleaning"
    },
    {
      "sentence": "Sarah will have been fixing the car all day by this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "The company will have been developing a new product all day by next year.",
      "verb": "developing"
    },
    {
      "sentence": "The dog will have been catching the mouse for two hours by this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "By tomorrow, my friend will have been emailing the manager.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, the bird will have been playing with the other pets all week.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the dog will have been catching a butterfly for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "My friend will have been meeting the neighbors since yesterday by tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, my parents will have been tidying the room for three days.",
      "verb": "tidying"
    },
    {
      "sentence": "We will have been going to work since this morning by in two days.",
      "verb": "going"
    },
    {
      "sentence": "The dog will have been playing with the ball for years by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, i will have been practicing science.",
      "verb": "practicing"
    },
    {
      "sentence": "By next week, she will have been fixing the machine.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog will have been eating its breakfast for years by this evening.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, he will have been watching the game for a week.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, they will have been baking breakfast since yesterday.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, the teacher will have been washing the bathroom for years.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, the dog will have been running across the field for three days.",
      "verb": "running"
    },
    {
      "sentence": "By next month, our neighbors will have been fixing the machine for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "By next year, our neighbors will have been playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will have been chasing the squirrel since Monday by later.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will have been catching the mouse since Monday by this evening.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the team will have been developing the project for years.",
      "verb": "developing"
    },
    {
      "sentence": "By in two days, we will have been playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been preparing breakfast since yesterday by next week.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, her sister will have been eating a salad for years.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, sarah will have been creating a plan for a month.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, the team will have been winning the update.",
      "verb": "winning"
    },
    {
      "sentence": "The teacher will have been calling the manager all week by this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "By next month, john will have been giving some clothes.",
      "verb": "giving"
    },
    {
      "sentence": "By tomorrow, the children will have been organizing the car.",
      "verb": "organizing"
    },
    {
      "sentence": "He will have been watching the match since Monday by next year.",
      "verb": "watching"
    },
    {
      "sentence": "By soon, the students will have been preparing cookies.",
      "verb": "preparing"
    },
    {
      "sentence": "The cat will have been catching a butterfly for two hours by next month.",
      "verb": "catching"
    },
    {
      "sentence": "By this weekend, tom will have been having a meal.",
      "verb": "having"
    },
    {
      "sentence": "By next month, he will have been drinking a smoothie for years.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the students will have been getting the ticket for a month.",
      "verb": "getting"
    },
    {
      "sentence": "Tom will have been listening to jazz since Monday by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the bird will have been catching the toy for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the students will have been listening to the lecture for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, her sister will have been reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, he will have been listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, emma will have been cleaning the room.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, you will have been sending the contract for three days.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister will have been painting a portrait for three days by this evening.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, she will have been organizing the room all day.",
      "verb": "organizing"
    },
    {
      "sentence": "By next week, sarah will have been drawing a portrait.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, the dog will have been playing in the park since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been considering the meeting since yesterday by this evening.",
      "verb": "considering"
    },
    {
      "sentence": "The cat will have been catching a treat since Monday by later.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the cat will have been chasing the toy for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the teacher will have been watching the match since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, my parents will have been texting the client.",
      "verb": "texting"
    },
    {
      "sentence": "By soon, her sister will have been eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "My brother will have been making lunch since yesterday by this weekend.",
      "verb": "making"
    },
    {
      "sentence": "My parents will have been buying the ticket since this morning by this evening.",
      "verb": "buying"
    },
    {
      "sentence": "The dog will have been sleeping in the corner for a week by this weekend.",
      "verb": "sleeping"
    },
    {
      "sentence": "They will have been having pasta all day by next month.",
      "verb": "having"
    },
    {
      "sentence": "By soon, the dog will have been eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By later, emma will have been building a project.",
      "verb": "building"
    },
    {
      "sentence": "My brother will have been having lunch for two hours by next week.",
      "verb": "having"
    },
    {
      "sentence": "By soon, he will have been drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, the bird will have been chasing the ball since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog will have been chasing its tail since Monday by next year.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, she will have been painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "By this weekend, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher will have been forgetting the event all day by this weekend.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the manager will have been running to the market all week.",
      "verb": "running"
    },
    {
      "sentence": "John will have been leaving to the airport for a week by in two days.",
      "verb": "leaving"
    },
    {
      "sentence": "They will have been drinking water all day by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, john will have been creating a prototype since yesterday.",
      "verb": "creating"
    },
    {
      "sentence": "By tomorrow, the children will have been emailing my friend.",
      "verb": "emailing"
    },
    {
      "sentence": "By tomorrow, sarah will have been understanding the textbook.",
      "verb": "understanding"
    },
    {
      "sentence": "The students will have been playing the piano since Monday by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will have been sleeping under the table for a week by next year.",
      "verb": "sleeping"
    },
    {
      "sentence": "They will have been choosing a new house all week by later.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, our neighbors will have been watching a show for a week.",
      "verb": "watching"
    },
    {
      "sentence": "The children will have been designing a project for three days by soon.",
      "verb": "designing"
    },
    {
      "sentence": "Our neighbors will have been preparing soup for a week by next year.",
      "verb": "preparing"
    },
    {
      "sentence": "He will have been contacting the team since yesterday by this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "The dog will have been playing with the toy since Monday by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the cat will have been catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "My friend will have been drinking coffee since Monday by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "By next week, our neighbors will have been cleaning the room.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next week, we will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, my friend will have been writing the document all week.",
      "verb": "writing"
    },
    {
      "sentence": "I will have been making breakfast for a week by next week.",
      "verb": "making"
    },
    {
      "sentence": "By next year, they will have been walking to the beach.",
      "verb": "walking"
    },
    {
      "sentence": "He will have been arriving to the beach all week by this evening.",
      "verb": "arriving"
    },
    {
      "sentence": "The teacher will have been watching football since this morning by tonight.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, the dog will have been playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the students will have been cooking cookies all day.",
      "verb": "cooking"
    },
    {
      "sentence": "Our neighbors will have been emailing the boss for a week by tomorrow.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird will have been chasing its tail all day by next month.",
      "verb": "chasing"
    },
    {
      "sentence": "By soon, i will have been finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "By next week, my parents will have been making rice.",
      "verb": "making"
    },
    {
      "sentence": "By next month, the students will have been seeing the team for a week.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, they will have been thinking about the decision since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "The team will have been announcing the software all week by this weekend.",
      "verb": "announcing"
    },
    {
      "sentence": "She will have been having dinner since yesterday by this weekend.",
      "verb": "having"
    },
    {
      "sentence": "The company will have been completing the update since Monday by next month.",
      "verb": "completing"
    },
    {
      "sentence": "Sarah will have been drinking milk since Monday by next week.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat will have been chasing the mouse since this morning by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "By later, sarah will have been receiving the presentation.",
      "verb": "receiving"
    },
    {
      "sentence": "The dog will have been running in circles all week by later.",
      "verb": "running"
    },
    {
      "sentence": "You will have been texting the doctor since this morning by this evening.",
      "verb": "texting"
    },
    {
      "sentence": "She will have been choosing the ticket for three days by this evening.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents will have been preparing dinner for a month by next month.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, john will have been traveling to the beach since this morning.",
      "verb": "traveling"
    },
    {
      "sentence": "By next month, the bird will have been eating quickly for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By soon, our neighbors will have been teaching vocabulary.",
      "verb": "teaching"
    },
    {
      "sentence": "Sarah will have been listening to a song for years by later.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, the bird will have been chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my brother will have been watching a show for a week.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, john will have been playing soccer all week.",
      "verb": "playing"
    },
    {
      "sentence": "By this evening, tom will have been giving a new house.",
      "verb": "giving"
    },
    {
      "sentence": "By soon, the bird will have been eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, john will have been drinking a smoothie all week.",
      "verb": "drinking"
    },
    {
      "sentence": "By next week, john will have been watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "By later, the bird will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "John will have been thinking about the event since Monday by in two days.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, the dog will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "He will have been designing a website since yesterday by next year.",
      "verb": "designing"
    },
    {
      "sentence": "My friend will have been studying vocabulary for three days by tomorrow.",
      "verb": "studying"
    },
    {
      "sentence": "By this weekend, they will have been making pasta.",
      "verb": "making"
    },
    {
      "sentence": "Tom will have been designing a prototype since Monday by next month.",
      "verb": "designing"
    },
    {
      "sentence": "By later, we will have been running to work.",
      "verb": "running"
    },
    {
      "sentence": "By next month, he will have been listening to the lecture for a week.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, my parents will have been eating lunch for three days.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been writing the report for a month by this evening.",
      "verb": "writing"
    },
    {
      "sentence": "By next year, the teacher will have been forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the bird will have been catching the ball all week.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, sarah will have been studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "By tonight, we will have been washing the house.",
      "verb": "washing"
    },
    {
      "sentence": "By next month, emma will have been deciding on the event all week.",
      "verb": "deciding"
    },
    {
      "sentence": "By next month, he will have been leaving to the store for a week.",
      "verb": "leaving"
    },
    {
      "sentence": "By this evening, my friend will have been watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the cat will have been eating its breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will have been sleeping on the couch for years by in two days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By in two days, the students will have been drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, i will have been seeing the teacher.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird will have been running around the house for years by tonight.",
      "verb": "running"
    },
    {
      "sentence": "By next year, the bird will have been eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the dog will have been eating its dinner for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, i will have been baking rice.",
      "verb": "baking"
    },
    {
      "sentence": "By next month, i will have been selling the keys since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "By next month, the students will have been playing golf for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the dog will have been chasing the ball for years.",
      "verb": "chasing"
    },
    {
      "sentence": "By this evening, emma will have been having a snack.",
      "verb": "having"
    },
    {
      "sentence": "By this weekend, the cat will have been chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "By this weekend, the teacher will have been teaching French.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, the cat will have been sleeping on the bed since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the bird will have been chasing the toy for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "The students will have been speaking with the manager for three days by next month.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, the dog will have been catching the ball all day.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will have been playing in the garden for a month by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, my brother will have been cooking cookies.",
      "verb": "cooking"
    },
    {
      "sentence": "By next week, i will have been learning the textbook.",
      "verb": "learning"
    },
    {
      "sentence": "By tomorrow, they will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will have been fixing the roof for years by next week.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, my brother will have been giving a laptop for years.",
      "verb": "giving"
    },
    {
      "sentence": "Our neighbors will have been finding a book for two hours by next month.",
      "verb": "finding"
    },
    {
      "sentence": "By next month, they will have been designing a plan for a month.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, the cat will have been catching the mouse all week.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, my brother will have been seeing the neighbors since this morning.",
      "verb": "seeing"
    },
    {
      "sentence": "By soon, my brother will have been seeing my friend.",
      "verb": "seeing"
    },
    {
      "sentence": "The cat will have been eating its dinner for a week by next month.",
      "verb": "eating"
    },
    {
      "sentence": "By this evening, john will have been meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "John will have been cleaning the room for two hours by tomorrow.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, tom will have been visiting the neighbors for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By this weekend, he will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, our neighbors will have been listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, our neighbors will have been painting a poster for a month.",
      "verb": "painting"
    },
    {
      "sentence": "By next week, my friend will have been building a presentation.",
      "verb": "building"
    },
    {
      "sentence": "By next week, the bird will have been chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the teacher will have been watching football since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "By later, the cat will have been running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "By tonight, she will have been talking to my family.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, my brother will have been preparing rice for years.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird will have been running in the garden all week by this evening.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors will have been visiting my parents for a week by in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "He will have been listening to an audiobook all week by in two days.",
      "verb": "listening"
    },
    {
      "sentence": "He will have been creating a model for three days by this weekend.",
      "verb": "creating"
    },
    {
      "sentence": "By this weekend, he will have been washing the office.",
      "verb": "washing"
    },
    {
      "sentence": "Our neighbors will have been driving to the gym for a week by next month.",
      "verb": "driving"
    },
    {
      "sentence": "By next month, emma will have been playing the piano since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will have been preparing the email since this morning by this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, the team will have been winning the deal all day.",
      "verb": "winning"
    },
    {
      "sentence": "Emma will have been emailing the office all week by next month.",
      "verb": "emailing"
    },
    {
      "sentence": "By soon, the bird will have been catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "We will have been listening to the news for three days by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, we will have been understanding the lesson.",
      "verb": "understanding"
    },
    {
      "sentence": "By next month, john will have been eating lunch since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "John will have been repairing the door since this morning by tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "She will have been coming to the library for years by later.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, tom will have been watching football since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "By later, i will have been meeting the team.",
      "verb": "meeting"
    },
    {
      "sentence": "By this evening, you will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "By next month, i will have been arriving to the airport for a week.",
      "verb": "arriving"
    },
    {
      "sentence": "By next month, the teacher will have been playing tennis for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, our neighbors will have been repairing the bike all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, he will have been having dinner for a week.",
      "verb": "having"
    },
    {
      "sentence": "By tonight, you will have been painting an illustration.",
      "verb": "painting"
    },
    {
      "sentence": "John will have been having a salad for a week by tomorrow.",
      "verb": "having"
    },
    {
      "sentence": "By next month, the bird will have been catching the toy all week.",
      "verb": "catching"
    },
    {
      "sentence": "The students will have been painting a landscape for a week by this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the company will have been launching the update for a month.",
      "verb": "launching"
    },
    {
      "sentence": "The teacher will have been playing video games all day by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the students will have been meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "By tonight, the children will have been thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "By next month, john will have been creating a website all day.",
      "verb": "creating"
    },
    {
      "sentence": "By next month, i will have been cooking a meal for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, she will have been emailing my parents for a month.",
      "verb": "emailing"
    },
    {
      "sentence": "By next month, the manager will have been designing a model for a month.",
      "verb": "designing"
    },
    {
      "sentence": "By soon, she will have been buying groceries.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, sarah will have been drinking milk for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "By this weekend, her sister will have been talking to the client.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, the students will have been washing the room for years.",
      "verb": "washing"
    },
    {
      "sentence": "By later, our neighbors will have been finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, the students will have been driving to the office since Monday.",
      "verb": "driving"
    },
    {
      "sentence": "By soon, the teacher will have been returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "By next year, i will have been playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, she will have been listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, our neighbors will have been watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "They will have been deciding on the decision all week by tomorrow.",
      "verb": "deciding"
    },
    {
      "sentence": "By next month, my parents will have been speaking with my family for years.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager will have been listening to a podcast all week by this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "She will have been seeing the manager since yesterday by tomorrow.",
      "verb": "seeing"
    },
    {
      "sentence": "By soon, the team will have been launching the software.",
      "verb": "launching"
    },
    {
      "sentence": "By next month, john will have been listening to the lecture since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "Tom will have been flying downtown for a month by soon.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, the bird will have been eating its breakfast all week.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been repairing the fence all day by next month.",
      "verb": "repairing"
    },
    {
      "sentence": "John will have been planning the problem since yesterday by soon.",
      "verb": "planning"
    },
    {
      "sentence": "By next month, she will have been playing football all week.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, he will have been planning the situation since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "By next month, the cat will have been sleeping by the window all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the team will have been releasing the championship for a week.",
      "verb": "releasing"
    },
    {
      "sentence": "By next month, my brother will have been running to the gym all day.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the cat will have been sleeping under the table for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, the manager will have been listening to a song for years.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, my parents will have been listening to the radio since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah will have been fixing the computer since this morning by next month.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird will have been sleeping in the sun all week by soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird will have been eating its dinner for a month by in two days.",
      "verb": "eating"
    },
    {
      "sentence": "By tomorrow, her sister will have been watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will have been catching a treat since yesterday by tonight.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, you will have been playing soccer for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The students will have been playing volleyball since yesterday by next month.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, her sister will have been traveling to the office for two hours.",
      "verb": "traveling"
    },
    {
      "sentence": "You will have been talking to the doctor for two hours by soon.",
      "verb": "talking"
    },
    {
      "sentence": "By this weekend, the team will have been winning the update.",
      "verb": "winning"
    },
    {
      "sentence": "They will have been cooking a cake for a month by soon.",
      "verb": "cooking"
    },
    {
      "sentence": "By next month, the dog will have been sleeping on the couch since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, he will have been cleaning the garage for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, the cat will have been running in the garden for a week.",
      "verb": "running"
    },
    {
      "sentence": "By this weekend, the dog will have been sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "By this weekend, we will have been speaking with the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "By next month, tom will have been seeing the team all week.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog will have been chasing the toy for a week by this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, we will have been listening to the lecture for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will have been fixing the machine for two hours by next month.",
      "verb": "fixing"
    },
    {
      "sentence": "We will have been having breakfast for a week by soon.",
      "verb": "having"
    },
    {
      "sentence": "By next month, the students will have been finding some clothes for two hours.",
      "verb": "finding"
    },
    {
      "sentence": "By next month, the bird will have been catching the mouse for years.",
      "verb": "catching"
    },
    {
      "sentence": "By next month, the cat will have been running through the grass all day.",
      "verb": "running"
    },
    {
      "sentence": "By next week, i will have been drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "By tomorrow, they will have been designing a house.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, her sister will have been having a sandwich all week.",
      "verb": "having"
    },
    {
      "sentence": "By next month, she will have been preparing dinner for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By this weekend, the company will have been announcing the deal.",
      "verb": "announcing"
    },
    {
      "sentence": "By next year, the company will have been completing the deal.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, the teacher will have been sketching an illustration for years.",
      "verb": "sketching"
    },
    {
      "sentence": "My brother will have been reading the material all week by tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "They will have been choosing the keys since this morning by in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "By soon, the cat will have been playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "The children will have been talking to my parents for a week by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, the cat will have been catching the ball all day.",
      "verb": "catching"
    },
    {
      "sentence": "The dog will have been playing with its owner since this morning by next year.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, the cat will have been chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "You will have been coming to the park for years by next year.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, he will have been drawing a poster since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, tom will have been designing a plan for a week.",
      "verb": "designing"
    },
    {
      "sentence": "Tom will have been buying a book for a week by next year.",
      "verb": "buying"
    },
    {
      "sentence": "By next month, the children will have been drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "The teacher will have been starting the contract all day by tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "By next month, the students will have been visiting the teacher for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "My friend will have been listening to the lecture for a month by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will have been catching a butterfly since Monday by next year.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors will have been emailing the client for three days by this weekend.",
      "verb": "emailing"
    },
    {
      "sentence": "By next year, the cat will have been sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next week, the cat will have been sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, he will have been finding a present since yesterday.",
      "verb": "finding"
    },
    {
      "sentence": "By next year, the cat will have been sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "By soon, my friend will have been seeing my grandmother.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the cat will have been catching the toy for years.",
      "verb": "catching"
    },
    {
      "sentence": "By this evening, the team will have been launching the software.",
      "verb": "launching"
    },
    {
      "sentence": "I will have been listening to a podcast for three days by next week.",
      "verb": "listening"
    },
    {
      "sentence": "By next month, the cat will have been chasing birds in the garden for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend will have been getting flowers since this morning by soon.",
      "verb": "getting"
    },
    {
      "sentence": "The cat will have been running in the garden all week by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "The bird will have been playing in the garden all day by next week.",
      "verb": "playing"
    },
    {
      "sentence": "They will have been drawing a diagram for years by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "By next month, we will have been meeting the client since Monday.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, the students will have been remembering the trip for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "By in two days, the manager will have been designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "By next week, the dog will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By next year, the team will have been launching the deal.",
      "verb": "launching"
    },
    {
      "sentence": "By next year, the children will have been returning home.",
      "verb": "returning"
    },
    {
      "sentence": "By next month, tom will have been watching a show for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, sarah will have been walking to work for years.",
      "verb": "walking"
    },
    {
      "sentence": "By next month, tom will have been creating a plan for a week.",
      "verb": "creating"
    },
    {
      "sentence": "By this evening, the dog will have been catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "By soon, our neighbors will have been eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister will have been listening to the lecture since this morning by later.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, the cat will have been chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my brother will have been traveling downtown for two hours.",
      "verb": "traveling"
    },
    {
      "sentence": "Emma will have been running to the store all week by later.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the manager will have been playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "By this evening, the bird will have been sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next month, sarah will have been reviewing science all day.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, john will have been choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "By tomorrow, my parents will have been meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, he will have been forgetting the situation for two hours.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tomorrow, she will have been drawing a design.",
      "verb": "drawing"
    },
    {
      "sentence": "By later, the dog will have been chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, my brother will have been fixing the bike all week.",
      "verb": "fixing"
    },
    {
      "sentence": "My friend will have been painting a diagram all week by soon.",
      "verb": "painting"
    },
    {
      "sentence": "By tomorrow, she will have been listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "The bird will have been chasing birds in the garden for two hours by next week.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the children will have been baking pasta since this morning.",
      "verb": "baking"
    },
    {
      "sentence": "By this evening, the bird will have been playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, i will have been cleaning the house since this morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "The bird will have been chasing the toy for two hours by this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "By later, john will have been forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next year, the company will have been launching a new product.",
      "verb": "launching"
    },
    {
      "sentence": "By next month, the bird will have been eating its dinner since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, tom will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, she will have been meeting my friend for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "I will have been giving a book for three days by this evening.",
      "verb": "giving"
    },
    {
      "sentence": "By later, the children will have been sketching a landscape.",
      "verb": "sketching"
    },
    {
      "sentence": "By next month, she will have been eating lunch for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, they will have been remembering the vacation all week.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat will have been chasing the mouse for a week by next month.",
      "verb": "chasing"
    },
    {
      "sentence": "By tonight, the cat will have been chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "We will have been painting a design for three days by next week.",
      "verb": "painting"
    },
    {
      "sentence": "Sarah will have been designing a website all day by soon.",
      "verb": "designing"
    },
    {
      "sentence": "By next month, my parents will have been studying English.",
      "verb": "studying"
    },
    {
      "sentence": "By later, the cat will have been playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the teacher will have been forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, my friend will have been fixing the door since Monday.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat will have been catching the ball for two hours by tomorrow.",
      "verb": "catching"
    },
    {
      "sentence": "By tomorrow, sarah will have been drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "By this evening, sarah will have been creating a plan.",
      "verb": "creating"
    },
    {
      "sentence": "They will have been listening to the news for years by next week.",
      "verb": "listening"
    },
    {
      "sentence": "By this weekend, she will have been eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "By this evening, emma will have been repairing the door.",
      "verb": "repairing"
    },
    {
      "sentence": "By later, the dog will have been playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will have been reading Spanish since Monday by tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, the students will have been drawing the wall all week.",
      "verb": "drawing"
    },
    {
      "sentence": "By tomorrow, my brother will have been making dinner.",
      "verb": "making"
    },
    {
      "sentence": "By later, the dog will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "She will have been texting the boss for three days by tomorrow.",
      "verb": "texting"
    },
    {
      "sentence": "By next month, my friend will have been sending the contract.",
      "verb": "sending"
    },
    {
      "sentence": "The manager will have been eating pasta since Monday by next year.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been completing the assignment since yesterday by next month.",
      "verb": "completing"
    },
    {
      "sentence": "The bird will have been running in the yard all day by soon.",
      "verb": "running"
    },
    {
      "sentence": "My brother will have been building a plan since this morning by this weekend.",
      "verb": "building"
    },
    {
      "sentence": "By this evening, my parents will have been drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, her sister will have been coming to the office for three days.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, the bird will have been chasing the mouse since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "By this weekend, the manager will have been buying some clothes.",
      "verb": "buying"
    },
    {
      "sentence": "By in two days, the cat will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tomorrow, my brother will have been painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "He will have been playing soccer for a month by later.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the dog will have been playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, tom will have been organizing the office.",
      "verb": "organizing"
    },
    {
      "sentence": "By next month, our neighbors will have been preparing the project for years.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, emma will have been watching the news since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, the dog will have been playing in the yard for years.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been talking to the professor for years by next month.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, the bird will have been sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom will have been texting the doctor since yesterday by tomorrow.",
      "verb": "texting"
    },
    {
      "sentence": "The manager will have been seeing my parents for years by tonight.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the cat will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "By tomorrow, the company will have been completing the software.",
      "verb": "completing"
    },
    {
      "sentence": "By tonight, the team will have been releasing the championship.",
      "verb": "releasing"
    },
    {
      "sentence": "By this evening, the team will have been announcing the project.",
      "verb": "announcing"
    },
    {
      "sentence": "By later, the cat will have been playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "By later, the bird will have been sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "By soon, her sister will have been driving home.",
      "verb": "driving"
    },
    {
      "sentence": "By soon, the dog will have been sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "My friend will have been considering the vacation since yesterday by tonight.",
      "verb": "considering"
    },
    {
      "sentence": "By soon, her sister will have been playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "The manager will have been tidying the car all day by in two days.",
      "verb": "tidying"
    },
    {
      "sentence": "By next year, we will have been playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, john will have been creating a model.",
      "verb": "creating"
    },
    {
      "sentence": "By this evening, the cat will have been sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next week, tom will have been practicing the notes.",
      "verb": "practicing"
    },
    {
      "sentence": "By soon, the bird will have been eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, emma will have been cleaning the room all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, my brother will have been seeing the manager for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "Tom will have been seeing the neighbors since Monday by tonight.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird will have been running in the park all day by tonight.",
      "verb": "running"
    },
    {
      "sentence": "They will have been teaching the material since Monday by next month.",
      "verb": "teaching"
    },
    {
      "sentence": "The children will have been designing a website all week by this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "By next week, john will have been visiting the team.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird will have been eating its food since yesterday by next year.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, the company will have been developing the championship since yesterday.",
      "verb": "developing"
    },
    {
      "sentence": "By next month, she will have been drinking water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "She will have been repairing the door all week by this weekend.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors will have been forgetting the decision all week by next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tonight, her sister will have been meeting my grandmother.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, she will have been visiting the client for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By this weekend, the bird will have been chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "By next month, the teacher will have been starting the contract all week.",
      "verb": "starting"
    },
    {
      "sentence": "By next month, the manager will have been having pizza for a month.",
      "verb": "having"
    },
    {
      "sentence": "By next month, the cat will have been sleeping under the table all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird will have been playing in the yard for a week by tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been playing video games since yesterday by soon.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, the teacher will have been preparing dinner since this morning.",
      "verb": "preparing"
    },
    {
      "sentence": "By tonight, the manager will have been finding a new house.",
      "verb": "finding"
    },
    {
      "sentence": "By tonight, the company will have been developing the update.",
      "verb": "developing"
    },
    {
      "sentence": "The teacher will have been meeting my grandmother since yesterday by next month.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager will have been visiting my parents since yesterday by in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "My parents will have been watching a documentary for two hours by later.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, emma will have been running to the hospital since Monday.",
      "verb": "running"
    },
    {
      "sentence": "By next month, tom will have been cleaning the room since yesterday.",
      "verb": "cleaning"
    },
    {
      "sentence": "By next month, the bird will have been sleeping on the bed for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors will have been running to work for three days by in two days.",
      "verb": "running"
    },
    {
      "sentence": "The cat will have been playing in the park since yesterday by tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been coming home since yesterday by next month.",
      "verb": "coming"
    },
    {
      "sentence": "By tonight, our neighbors will have been playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "He will have been playing tennis for a month by next month.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, john will have been speaking with the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "By next week, the dog will have been sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "By next year, we will have been painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, the teacher will have been seeing my friend all day.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, the dog will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the manager will have been listening to jazz for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will have been running in the yard all day by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "You will have been preparing the assignment for a week by this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "We will have been watching the news for two hours by in two days.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, tom will have been talking to my family.",
      "verb": "talking"
    },
    {
      "sentence": "By later, the bird will have been running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "By this evening, we will have been considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, my friend will have been seeing the neighbors for years.",
      "verb": "seeing"
    },
    {
      "sentence": "By next month, i will have been coming to the airport.",
      "verb": "coming"
    },
    {
      "sentence": "By next month, my parents will have been fixing the door for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By next month, the students will have been watching a movie since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, the bird will have been running in the park.",
      "verb": "running"
    },
    {
      "sentence": "By next month, the children will have been drawing a diagram all day.",
      "verb": "drawing"
    },
    {
      "sentence": "By soon, the team will have been winning the software.",
      "verb": "winning"
    }
  ]
}