{
  "tense": "Future Perfect Continuous",
  "description": "Used for actions that will have been ongoing until a future point",
  "examples": [
    {
      "sentence": "By this evening, they will have been understanding history.",
      "verb": "understanding"
    },
    {
      "sentence": "He will have been calling the teacher since yesterday by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, the students will have been finding the keys since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "Her sister will have been painting the car for three days by next month.",
      "verb": "painting"
    },
    {
      "sentence": "The children will have been submitting the document all day by soon.",
      "verb": "submitting"
    },
    {
      "sentence": "By tonight, my parents will have been cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the cat will have been reviewing the chapter for a week.",
      "verb": "reviewing"
    },
    {
      "sentence": "By in two days, the company will have been preparing juice.",
      "verb": "preparing"
    },
    {
      "sentence": "We will have been cleaning the room for a week by tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, john will have been cleaning the car for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, she will have been watching TV all week.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, the cat will have been forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "By in two days, the team will have been forgetting the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By soon, my brother will have been playing a documentary.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, the team will have been teaching grammar.",
      "verb": "teaching"
    },
    {
      "sentence": "By next week, the company will have been reading history.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, he will have been walking to the market for a week.",
      "verb": "walking"
    },
    {
      "sentence": "The bird will have been receiving the presentation since yesterday by this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "The company will have been planning the meeting all day by later.",
      "verb": "planning"
    },
    {
      "sentence": "By this weekend, the team will have been teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "By soon, my friend will have been giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "By soon, my parents will have been leaving to the market.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, they will have been returning to the park since Monday.",
      "verb": "returning"
    },
    {
      "sentence": "The team will have been enjoying pasta all day by next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, he will have been making a snack all day.",
      "verb": "making"
    },
    {
      "sentence": "Next month, sarah will have been getting the ticket for a month.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, she will have been submitting the proposal for a week.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the bird will have been choosing a laptop since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "The team will have been receiving the report since yesterday by this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the manager will have been practicing history for years.",
      "verb": "practicing"
    },
    {
      "sentence": "She will have been choosing a new car since yesterday by next year.",
      "verb": "choosing"
    },
    {
      "sentence": "By soon, her sister will have been getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "The students will have been meeting the client for two hours by this evening.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom will have been buying a laptop since morning by next year.",
      "verb": "buying"
    },
    {
      "sentence": "The company will have been walking to the park all day by later.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, the children will have been giving groceries all week.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, she will have been building the house for three days.",
      "verb": "building"
    },
    {
      "sentence": "I will have been selling groceries for three days by in two days.",
      "verb": "selling"
    },
    {
      "sentence": "By in two days, the manager will have been preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, john will have been enjoying tennis for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "The students will have been practicing for the exam for a week by soon.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, emma will have been thinking about the options all week.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, the students will have been leaving to the library.",
      "verb": "leaving"
    },
    {
      "sentence": "By next week, my parents will have been watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, the company will have been considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "By next year, he will have been flying to the market.",
      "verb": "flying"
    },
    {
      "sentence": "We will have been enjoying a movie all day by tonight.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom will have been giving the ticket for a week by next week.",
      "verb": "giving"
    },
    {
      "sentence": "By later, tom will have been drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah will have been watching basketball for two hours by tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "The bird will have been preparing dinner all day by this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "By soon, emma will have been making a snack.",
      "verb": "making"
    },
    {
      "sentence": "Next month, the teacher will have been practicing the textbook for a week.",
      "verb": "practicing"
    },
    {
      "sentence": "By next month, tom will have been fixing a website.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, her sister will have been cooking tea for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the students will have been enjoying music since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will have been watching a movie for years.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the bird will have been buying a new car since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "The students will have been fixing the bathroom all week by in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, my parents will have been calling my parents all week.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, my parents will have been learning vocabulary all week.",
      "verb": "learning"
    },
    {
      "sentence": "By in two days, john will have been visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the students will have been forgetting the trip for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next week, they will have been starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "The students will have been playing a movie all week by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will have been speaking the teacher since morning by tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, john will have been practicing French for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "By next year, the dog will have been giving a laptop.",
      "verb": "giving"
    },
    {
      "sentence": "My parents will have been listening to basketball all day by this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, you will have been fixing the house all week.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, my parents will have been giving clothes for years.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the dog will have been preparing soup since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By next month, they will have been studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, tom will have been listening to the game since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "By later, my friend will have been studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "By soon, they will have been remembering the problem.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, you will have been considering the decision since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "By next year, john will have been designing the house.",
      "verb": "designing"
    },
    {
      "sentence": "By soon, sarah will have been talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, our neighbors will have been coming to the airport for a week.",
      "verb": "coming"
    },
    {
      "sentence": "By tomorrow, he will have been walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, we will have been selling the ticket for a month.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the students will have been fixing the car all day.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, the children will have been finding the ticket for a week.",
      "verb": "finding"
    },
    {
      "sentence": "John will have been flying to the market for a week by soon.",
      "verb": "flying"
    },
    {
      "sentence": "By tomorrow, her sister will have been flying to the airport.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, her sister will have been listening to a movie since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "He will have been drawing the kitchen all day by tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will have been arriving to the market all day by this evening.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, my brother will have been submitting the email all week.",
      "verb": "submitting"
    },
    {
      "sentence": "She will have been getting a laptop since morning by later.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, sarah will have been learning the chapter all week.",
      "verb": "learning"
    },
    {
      "sentence": "By later, i will have been talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, she will have been calling the boss for years.",
      "verb": "calling"
    },
    {
      "sentence": "By this evening, they will have been sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, tom will have been building the furniture all day.",
      "verb": "building"
    },
    {
      "sentence": "Sarah will have been drinking soup since yesterday by this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, he will have been ordering juice since yesterday.",
      "verb": "ordering"
    },
    {
      "sentence": "By soon, john will have been remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, sarah will have been contacting my friend since yesterday.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, i will have been cooking a sandwich all day.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog will have been submitting the document for three days by soon.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, i will have been writing the document since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "By this evening, the dog will have been giving a book.",
      "verb": "giving"
    },
    {
      "sentence": "By tomorrow, the students will have been finishing the application.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, my parents will have been sending the application for years.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, her sister will have been forgetting the event for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By this evening, you will have been enjoying tennis.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, the children will have been calling the doctor.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher will have been going to school for three days by next year.",
      "verb": "going"
    },
    {
      "sentence": "Next month, i will have been visiting the doctor all week.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom will have been sending the application since morning by this evening.",
      "verb": "sending"
    },
    {
      "sentence": "The cat will have been reviewing the chapter for years by next year.",
      "verb": "reviewing"
    },
    {
      "sentence": "By tonight, the company will have been building the car.",
      "verb": "building"
    },
    {
      "sentence": "By later, the company will have been buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "John will have been forgetting the trip for two hours by next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the dog will have been enjoying a sandwich since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents will have been remembering the event all day by this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom will have been making pizza for three days by tonight.",
      "verb": "making"
    },
    {
      "sentence": "Next month, they will have been leaving to the park all day.",
      "verb": "leaving"
    },
    {
      "sentence": "He will have been enjoying breakfast for a month by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "The children will have been studying Spanish since morning by tomorrow.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my brother will have been submitting the document since Monday.",
      "verb": "submitting"
    },
    {
      "sentence": "The teacher will have been returning to the airport since Monday by next month.",
      "verb": "returning"
    },
    {
      "sentence": "By this weekend, the cat will have been arriving to the market.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, my brother will have been getting the phone since morning.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, the bird will have been going to the library since Monday.",
      "verb": "going"
    },
    {
      "sentence": "Next month, my brother will have been sending the email for years.",
      "verb": "sending"
    },
    {
      "sentence": "They will have been building the garden for three days by later.",
      "verb": "building"
    },
    {
      "sentence": "By later, you will have been driving to school.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, john will have been watching football for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "We will have been designing the computer all day by next month.",
      "verb": "designing"
    },
    {
      "sentence": "By tonight, sarah will have been playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, john will have been completing the task for three days.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the dog will have been playing tennis since morning.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, i will have been sending the project since morning.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the team will have been considering the trip for a week.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, the cat will have been preparing soup all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors will have been enjoying basketball all week by soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team will have been thinking about the birthday for a week by soon.",
      "verb": "thinking"
    },
    {
      "sentence": "Her sister will have been writing the report since yesterday by in two days.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors will have been preparing a snack since yesterday by next month.",
      "verb": "preparing"
    },
    {
      "sentence": "By next week, the manager will have been making lunch.",
      "verb": "making"
    },
    {
      "sentence": "By tomorrow, she will have been remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird will have been sending the assignment for years by this evening.",
      "verb": "sending"
    },
    {
      "sentence": "By tomorrow, the bird will have been repairing the furniture.",
      "verb": "repairing"
    },
    {
      "sentence": "By in two days, the cat will have been submitting the task.",
      "verb": "submitting"
    },
    {
      "sentence": "By next week, emma will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, emma will have been coming home.",
      "verb": "coming"
    },
    {
      "sentence": "The dog will have been forgetting the vacation since Monday by next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the children will have been ordering a snack for three days.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, they will have been submitting the document for a week.",
      "verb": "submitting"
    },
    {
      "sentence": "By this weekend, her sister will have been watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "By next year, i will have been getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "Sarah will have been watching a movie since morning by next month.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, sarah will have been repairing the kitchen all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By next week, the teacher will have been learning the chapter.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the children will have been writing the presentation for three days.",
      "verb": "writing"
    },
    {
      "sentence": "The manager will have been drinking juice for a month by later.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom will have been reading vocabulary since Monday by next week.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, the children will have been finishing the proposal all day.",
      "verb": "finishing"
    },
    {
      "sentence": "By in two days, the team will have been playing football.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the cat will have been painting the car.",
      "verb": "painting"
    },
    {
      "sentence": "By tonight, emma will have been contacting the boss.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the students will have been choosing groceries for years.",
      "verb": "choosing"
    },
    {
      "sentence": "By this weekend, we will have been visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog will have been drawing the room for three days by next year.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the students will have been selling the keys for three days.",
      "verb": "selling"
    },
    {
      "sentence": "The cat will have been driving to work for a week by soon.",
      "verb": "driving"
    },
    {
      "sentence": "By this evening, tom will have been drinking a snack.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the manager will have been buying a book all week.",
      "verb": "buying"
    },
    {
      "sentence": "Emma will have been understanding the chapter all day by this weekend.",
      "verb": "understanding"
    },
    {
      "sentence": "By later, sarah will have been forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tonight, my friend will have been drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "The children will have been studying grammar for two hours by tonight.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, the manager will have been cleaning the furniture all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company will have been walking downtown for a week by tomorrow.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, the bird will have been selling the keys for years.",
      "verb": "selling"
    },
    {
      "sentence": "By this evening, the team will have been completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "We will have been ordering pasta for three days by next month.",
      "verb": "ordering"
    },
    {
      "sentence": "My friend will have been remembering the situation all week by this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "By soon, our neighbors will have been running downtown.",
      "verb": "running"
    },
    {
      "sentence": "By next week, tom will have been ordering dinner.",
      "verb": "ordering"
    },
    {
      "sentence": "By soon, my brother will have been teaching vocabulary.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, my brother will have been watching a podcast for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the manager will have been calling my family for a month.",
      "verb": "calling"
    },
    {
      "sentence": "By later, the company will have been preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the company will have been visiting the manager all week.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, they will have been going home for a month.",
      "verb": "going"
    },
    {
      "sentence": "By next week, sarah will have been listening to tennis.",
      "verb": "listening"
    },
    {
      "sentence": "The manager will have been enjoying dinner since yesterday by soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, he will have been playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will have been preparing soup since Monday by this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "By this evening, my parents will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "The company will have been contacting the manager since Monday by this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, my friend will have been planning the options for a month.",
      "verb": "planning"
    },
    {
      "sentence": "Sarah will have been fixing the computer for a month by soon.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher will have been completing the report since morning by in two days.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the teacher will have been talking the manager for years.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, emma will have been visiting the neighbors since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog will have been completing the proposal for a week by tonight.",
      "verb": "completing"
    },
    {
      "sentence": "By this evening, you will have been watching music.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, the dog will have been contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will have been painting the furniture since morning by next year.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, i will have been teaching science.",
      "verb": "teaching"
    },
    {
      "sentence": "John will have been coming to school since morning by tomorrow.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, tom will have been calling the client all day.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, my brother will have been understanding English all day.",
      "verb": "understanding"
    },
    {
      "sentence": "By tomorrow, the children will have been running to the market.",
      "verb": "running"
    },
    {
      "sentence": "Next month, my brother will have been reviewing English for a week.",
      "verb": "reviewing"
    },
    {
      "sentence": "By soon, the dog will have been reading the chapter.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, she will have been leaving to the beach.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, the team will have been buying groceries for a week.",
      "verb": "buying"
    },
    {
      "sentence": "By in two days, you will have been drawing a website.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the cat will have been getting a laptop for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By next month, john will have been playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, the manager will have been drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "By this evening, tom will have been building the furniture.",
      "verb": "building"
    },
    {
      "sentence": "By next week, the company will have been selling the phone.",
      "verb": "selling"
    },
    {
      "sentence": "By tonight, the manager will have been getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "Her sister will have been making lunch for three days by this evening.",
      "verb": "making"
    },
    {
      "sentence": "By next year, john will have been listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "By soon, emma will have been contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, john will have been starting the assignment all week.",
      "verb": "starting"
    },
    {
      "sentence": "Sarah will have been cleaning a picture since morning by later.",
      "verb": "cleaning"
    },
    {
      "sentence": "She will have been getting a laptop all day by tomorrow.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, her sister will have been thinking about the birthday since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, tom will have been going to work.",
      "verb": "going"
    },
    {
      "sentence": "Sarah will have been submitting the assignment since morning by tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the teacher will have been watching the game all week.",
      "verb": "watching"
    },
    {
      "sentence": "The team will have been arriving to the park for a month by this weekend.",
      "verb": "arriving"
    },
    {
      "sentence": "By in two days, tom will have been reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "The manager will have been drinking pizza since yesterday by next month.",
      "verb": "drinking"
    },
    {
      "sentence": "By next month, emma will have been getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "My friend will have been ordering coffee all day by next year.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, tom will have been visiting the neighbors since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, john will have been repairing the car since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "He will have been playing a documentary all week by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, she will have been selling the phone since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "By tomorrow, the children will have been contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "The students will have been teaching the lesson for two hours by next month.",
      "verb": "teaching"
    },
    {
      "sentence": "By next month, my parents will have been speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, john will have been contacting my family since morning.",
      "verb": "contacting"
    },
    {
      "sentence": "My brother will have been arriving to school for a month by tonight.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, the team will have been sending the task all day.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the cat will have been selling a laptop all day.",
      "verb": "selling"
    },
    {
      "sentence": "By this evening, tom will have been drawing the garden.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the company will have been cleaning the room since yesterday.",
      "verb": "cleaning"
    },
    {
      "sentence": "He will have been walking to the airport since Monday by next week.",
      "verb": "walking"
    },
    {
      "sentence": "He will have been coming to the beach for three days by tonight.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, the bird will have been designing the garden since morning.",
      "verb": "designing"
    },
    {
      "sentence": "They will have been playing a movie since morning by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the dog will have been speaking the doctor since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, my brother will have been understanding science for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, emma will have been receiving the contract for years.",
      "verb": "receiving"
    },
    {
      "sentence": "By in two days, she will have been repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "By this evening, he will have been making a salad.",
      "verb": "making"
    },
    {
      "sentence": "Next month, the company will have been watching football for years.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, you will have been talking the teacher for a month.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, the bird will have been arriving to work since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, the teacher will have been contacting the doctor all week.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the team will have been returning to the airport all day.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, my brother will have been preparing tea for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, her sister will have been enjoying football all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will have been completing the task all day.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the manager will have been coming to the airport since Monday.",
      "verb": "coming"
    },
    {
      "sentence": "By in two days, the bird will have been repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "My brother will have been completing the email all day by soon.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, john will have been finding flowers for three days.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, my friend will have been contacting the client since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By in two days, sarah will have been teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, you will have been starting the letter all day.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, the manager will have been returning home all week.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, the children will have been playing a video since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, you will have been walking downtown.",
      "verb": "walking"
    },
    {
      "sentence": "Sarah will have been forgetting the situation for two hours by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "The manager will have been reviewing English all week by next month.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, the manager will have been visiting the teacher all day.",
      "verb": "visiting"
    },
    {
      "sentence": "By in two days, her sister will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "By this evening, the company will have been receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah will have been cleaning the house since morning by in two days.",
      "verb": "cleaning"
    },
    {
      "sentence": "The team will have been planning the meeting for a month by next year.",
      "verb": "planning"
    },
    {
      "sentence": "By soon, the children will have been reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "By soon, we will have been finding a gift.",
      "verb": "finding"
    },
    {
      "sentence": "By this evening, my friend will have been making tea.",
      "verb": "making"
    },
    {
      "sentence": "Sarah will have been remembering the trip all day by next year.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the bird will have been drinking soup for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "She will have been thinking about the birthday for a week by tonight.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, she will have been cleaning a picture for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By in two days, she will have been practicing English.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, our neighbors will have been reading French since morning.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, you will have been building the room for years.",
      "verb": "building"
    },
    {
      "sentence": "Next month, tom will have been enjoying a song since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, the teacher will have been listening to the game.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, my parents will have been giving a present for a month.",
      "verb": "giving"
    },
    {
      "sentence": "By next year, she will have been returning to the library.",
      "verb": "returning"
    },
    {
      "sentence": "By next month, the company will have been speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "By in two days, the bird will have been teaching for the exam.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, our neighbors will have been contacting the boss for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "By soon, the students will have been repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "By tonight, he will have been considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, my brother will have been selling a laptop for a week.",
      "verb": "selling"
    },
    {
      "sentence": "I will have been watching the news for years by this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "By in two days, the students will have been returning to the park.",
      "verb": "returning"
    },
    {
      "sentence": "Our neighbors will have been practicing mathematics all day by this weekend.",
      "verb": "practicing"
    },
    {
      "sentence": "By next week, we will have been learning French.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the teacher will have been remembering the future since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom will have been walking to the office for three days by later.",
      "verb": "walking"
    },
    {
      "sentence": "Our neighbors will have been flying to work all week by soon.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, you will have been considering the future since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "By soon, the children will have been designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "The bird will have been building a picture all day by this weekend.",
      "verb": "building"
    },
    {
      "sentence": "Emma will have been choosing groceries since morning by next week.",
      "verb": "choosing"
    },
    {
      "sentence": "By soon, sarah will have been cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the manager will have been understanding the lesson for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "He will have been designing the house for years by next month.",
      "verb": "designing"
    },
    {
      "sentence": "By next week, emma will have been giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "By tonight, sarah will have been repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird will have been coming to the airport since yesterday by this weekend.",
      "verb": "coming"
    },
    {
      "sentence": "By next year, they will have been speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "I will have been fixing the car for two hours by in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "By this evening, my parents will have been finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, john will have been sending the email for years.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the company will have been enjoying juice all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, he will have been practicing English for three days.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, they will have been talking the client all week.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, my friend will have been completing the task.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the bird will have been calling the team all week.",
      "verb": "calling"
    },
    {
      "sentence": "By this evening, our neighbors will have been driving to work.",
      "verb": "driving"
    },
    {
      "sentence": "By next year, my friend will have been remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the team will have been forgetting the trip all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tomorrow, she will have been building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "By next year, emma will have been speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the manager will have been watching basketball since morning.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, john will have been completing the document since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, we will have been writing the email for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "My brother will have been calling the neighbors for years by soon.",
      "verb": "calling"
    },
    {
      "sentence": "The dog will have been painting the house all day by later.",
      "verb": "painting"
    },
    {
      "sentence": "By this evening, he will have been enjoying a documentary.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, emma will have been enjoying a song for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher will have been running to the store for two hours by this evening.",
      "verb": "running"
    },
    {
      "sentence": "Next month, you will have been ordering a snack for three days.",
      "verb": "ordering"
    },
    {
      "sentence": "By soon, we will have been practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, he will have been meeting the team for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, john will have been selling groceries for a month.",
      "verb": "selling"
    },
    {
      "sentence": "The manager will have been submitting the document since Monday by this weekend.",
      "verb": "submitting"
    },
    {
      "sentence": "Her sister will have been remembering the problem for a week by later.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat will have been meeting my parents for a week by next year.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the bird will have been meeting my parents all day.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother will have been painting the car since yesterday by this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, the children will have been watching football.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, tom will have been finishing the task for three days.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, she will have been calling the neighbors for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "He will have been studying English since yesterday by next week.",
      "verb": "studying"
    },
    {
      "sentence": "By tomorrow, the dog will have been reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next year, tom will have been preparing pizza.",
      "verb": "preparing"
    },
    {
      "sentence": "By tonight, the cat will have been talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, my friend will have been playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "By next year, they will have been submitting the report.",
      "verb": "submitting"
    },
    {
      "sentence": "By soon, they will have been studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, you will have been flying home since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, our neighbors will have been speaking my parents since morning.",
      "verb": "speaking"
    },
    {
      "sentence": "You will have been going to the office for two hours by next week.",
      "verb": "going"
    },
    {
      "sentence": "By next month, the children will have been completing the email.",
      "verb": "completing"
    },
    {
      "sentence": "My brother will have been drinking tea for a week by later.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, we will have been visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "By tonight, she will have been cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the company will have been cooking juice since morning.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, she will have been building the bathroom for two hours.",
      "verb": "building"
    },
    {
      "sentence": "Next month, he will have been eating juice for three days.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, i will have been learning vocabulary for years.",
      "verb": "learning"
    },
    {
      "sentence": "The manager will have been submitting the contract all day by tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "By next month, our neighbors will have been playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, the company will have been thinking about the situation.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, my brother will have been talking the boss for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will have been enjoying music for two hours by this weekend.",
      "verb": "enjoying"
    },
    {
      "sentence": "The students will have been sending the document all week by this weekend.",
      "verb": "sending"
    },
    {
      "sentence": "Emma will have been selling a present all day by in two days.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the manager will have been running to the office since Monday.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the students will have been fixing the kitchen.",
      "verb": "fixing"
    },
    {
      "sentence": "By soon, my parents will have been drinking a snack.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the team will have been designing a picture for three days.",
      "verb": "designing"
    },
    {
      "sentence": "The bird will have been reviewing vocabulary for years by this weekend.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will have been visiting the team all day by next month.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, you will have been completing the proposal all week.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, you will have been drinking dinner for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, my friend will have been learning mathematics for years.",
      "verb": "learning"
    },
    {
      "sentence": "The cat will have been visiting my family for a month by later.",
      "verb": "visiting"
    },
    {
      "sentence": "By tonight, sarah will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "By this weekend, sarah will have been building the house.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the bird will have been running to the library for a month.",
      "verb": "running"
    },
    {
      "sentence": "By next year, i will have been considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, he will have been cooking coffee for years.",
      "verb": "cooking"
    },
    {
      "sentence": "By next week, we will have been sending the email.",
      "verb": "sending"
    },
    {
      "sentence": "The manager will have been enjoying a movie for years by next month.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher will have been watching the news for a week by next month.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the students will have been building a website for three days.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the cat will have been contacting my parents all day.",
      "verb": "contacting"
    },
    {
      "sentence": "By tomorrow, my friend will have been enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "They will have been speaking the manager since yesterday by next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the dog will have been receiving the email for three days.",
      "verb": "receiving"
    },
    {
      "sentence": "The cat will have been watching football since yesterday by later.",
      "verb": "watching"
    },
    {
      "sentence": "By next year, the manager will have been receiving the contract.",
      "verb": "receiving"
    },
    {
      "sentence": "John will have been playing basketball for years by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, tom will have been going to the library for two hours.",
      "verb": "going"
    },
    {
      "sentence": "Next month, the dog will have been teaching grammar for two hours.",
      "verb": "teaching"
    },
    {
      "sentence": "By soon, the dog will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the students will have been writing the task for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "The bird will have been calling the boss for years by later.",
      "verb": "calling"
    },
    {
      "sentence": "By soon, emma will have been considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Our neighbors will have been finishing the assignment for a week by soon.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, my friend will have been completing the presentation since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "My parents will have been playing music all week by next week.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors will have been playing TV for three days by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will have been getting the ticket all week by this evening.",
      "verb": "getting"
    },
    {
      "sentence": "You will have been painting the kitchen for a month by soon.",
      "verb": "painting"
    },
    {
      "sentence": "Sarah will have been flying to the airport since morning by next week.",
      "verb": "flying"
    },
    {
      "sentence": "John will have been cleaning a picture for years by next week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The children will have been playing basketball for years by tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, they will have been learning science.",
      "verb": "learning"
    },
    {
      "sentence": "The manager will have been selling the phone for years by tonight.",
      "verb": "selling"
    },
    {
      "sentence": "By in two days, tom will have been finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the manager will have been returning to the gym for three days.",
      "verb": "returning"
    },
    {
      "sentence": "Tom will have been returning to the gym for a week by tonight.",
      "verb": "returning"
    },
    {
      "sentence": "By next week, the children will have been eating breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "By next month, they will have been remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "The students will have been enjoying pasta for two hours by this evening.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the dog will have been enjoying juice for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, her sister will have been walking to the beach for a week.",
      "verb": "walking"
    },
    {
      "sentence": "By soon, i will have been contacting the boss.",
      "verb": "contacting"
    },
    {
      "sentence": "By later, the cat will have been forgetting the trip.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah will have been drinking tea for years by tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the team will have been enjoying juice since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "I will have been visiting my friend since Monday by this evening.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, the manager will have been finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "They will have been studying English for a month by tonight.",
      "verb": "studying"
    },
    {
      "sentence": "Our neighbors will have been choosing a laptop for two hours by later.",
      "verb": "choosing"
    },
    {
      "sentence": "By next month, i will have been running home.",
      "verb": "running"
    },
    {
      "sentence": "By this weekend, the team will have been listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "By later, you will have been learning history.",
      "verb": "learning"
    },
    {
      "sentence": "By tomorrow, she will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "By this evening, emma will have been understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, emma will have been finding flowers all day.",
      "verb": "finding"
    },
    {
      "sentence": "I will have been buying a present for two hours by tonight.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, my friend will have been understanding the chapter for three days.",
      "verb": "understanding"
    },
    {
      "sentence": "The children will have been getting a present since Monday by tomorrow.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, my friend will have been sending the contract since morning.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the students will have been fixing the furniture since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "The manager will have been drinking coffee since morning by later.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, you will have been cooking a sandwich.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, emma will have been playing a podcast all day.",
      "verb": "playing"
    },
    {
      "sentence": "The company will have been receiving the project for years by this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the children will have been driving to school since morning.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, sarah will have been ordering a snack all day.",
      "verb": "ordering"
    },
    {
      "sentence": "He will have been flying to school for years by later.",
      "verb": "flying"
    },
    {
      "sentence": "By later, emma will have been driving to the office.",
      "verb": "driving"
    },
    {
      "sentence": "By next week, sarah will have been getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "By this evening, our neighbors will have been driving to the beach.",
      "verb": "driving"
    },
    {
      "sentence": "By soon, the manager will have been drawing the car.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the company will have been forgetting the problem all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "They will have been contacting the neighbors since Monday by this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the dog will have been cleaning the bathroom all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The team will have been submitting the letter since morning by in two days.",
      "verb": "submitting"
    },
    {
      "sentence": "The students will have been completing the task for a week by in two days.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the children will have been preparing a snack for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, my parents will have been flying to school since morning.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah will have been teaching the chapter for three days by this weekend.",
      "verb": "teaching"
    },
    {
      "sentence": "By in two days, the dog will have been designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "The children will have been remembering the event since Monday by in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "The team will have been ordering dinner for a month by next week.",
      "verb": "ordering"
    },
    {
      "sentence": "My parents will have been reviewing French since yesterday by tomorrow.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, her sister will have been getting a present all week.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, we will have been starting the task since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "The children will have been considering the meeting since Monday by in two days.",
      "verb": "considering"
    },
    {
      "sentence": "The team will have been finding flowers for a month by in two days.",
      "verb": "finding"
    },
    {
      "sentence": "By later, the dog will have been talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister will have been speaking the doctor all week by this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "The students will have been forgetting the vacation since yesterday by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "John will have been finding a book since yesterday by tomorrow.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, i will have been sending the application for a week.",
      "verb": "sending"
    },
    {
      "sentence": "The cat will have been forgetting the future all week by soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "You will have been preparing dinner all week by next year.",
      "verb": "preparing"
    },
    {
      "sentence": "By in two days, my parents will have been remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "By this evening, emma will have been enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "My friend will have been submitting the letter since morning by next year.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, you will have been enjoying the game for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, john will have been eating a sandwich for a week.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the manager will have been talking the teacher for years.",
      "verb": "talking"
    },
    {
      "sentence": "They will have been playing a movie since Monday by next month.",
      "verb": "playing"
    },
    {
      "sentence": "The children will have been preparing juice since morning by soon.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog will have been sending the project for three days by next month.",
      "verb": "sending"
    },
    {
      "sentence": "By soon, tom will have been reviewing the chapter.",
      "verb": "reviewing"
    },
    {
      "sentence": "My parents will have been making pizza all day by in two days.",
      "verb": "making"
    },
    {
      "sentence": "Next month, the manager will have been learning Spanish since Monday.",
      "verb": "learning"
    },
    {
      "sentence": "By next year, they will have been repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, i will have been returning home since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, the team will have been finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "The bird will have been listening to a podcast since yesterday by tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "We will have been repairing the house since Monday by later.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, the teacher will have been thinking about the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The company will have been enjoying a podcast for two hours by next year.",
      "verb": "enjoying"
    },
    {
      "sentence": "By in two days, my parents will have been walking to the office.",
      "verb": "walking"
    },
    {
      "sentence": "By tonight, the dog will have been driving to the library.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, they will have been teaching the lesson since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "By tomorrow, john will have been speaking the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat will have been forgetting the meeting for three days by soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "By soon, my parents will have been planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "The children will have been getting the ticket since morning by soon.",
      "verb": "getting"
    },
    {
      "sentence": "The company will have been building the bathroom for a month by in two days.",
      "verb": "building"
    },
    {
      "sentence": "Next month, our neighbors will have been visiting my family for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "By this weekend, tom will have been flying to school.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah will have been contacting the doctor since yesterday by this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the bird will have been reading the lesson since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah will have been talking the teacher for a month by next month.",
      "verb": "talking"
    },
    {
      "sentence": "By in two days, he will have been learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "I will have been repairing the computer since morning by next week.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, sarah will have been cooking juice for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "By this weekend, the company will have been playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my parents will have been visiting the doctor for years.",
      "verb": "visiting"
    },
    {
      "sentence": "Emma will have been sending the report since yesterday by later.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the team will have been meeting my friend for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the team will have been practicing science all week.",
      "verb": "practicing"
    },
    {
      "sentence": "By this evening, emma will have been understanding the textbook.",
      "verb": "understanding"
    },
    {
      "sentence": "The bird will have been considering the future all week by next year.",
      "verb": "considering"
    },
    {
      "sentence": "We will have been understanding mathematics for a month by tomorrow.",
      "verb": "understanding"
    },
    {
      "sentence": "By later, the company will have been coming to the park.",
      "verb": "coming"
    },
    {
      "sentence": "By tonight, the manager will have been learning English.",
      "verb": "learning"
    },
    {
      "sentence": "The children will have been studying grammar for years by next year.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, she will have been planning the situation for a week.",
      "verb": "planning"
    },
    {
      "sentence": "By next week, he will have been building the room.",
      "verb": "building"
    },
    {
      "sentence": "By later, the company will have been designing the furniture.",
      "verb": "designing"
    },
    {
      "sentence": "By tonight, tom will have been talking my friend.",
      "verb": "talking"
    },
    {
      "sentence": "By next week, the team will have been leaving to school.",
      "verb": "leaving"
    },
    {
      "sentence": "My parents will have been cooking coffee for three days by in two days.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the company will have been making a snack since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "Tom will have been starting the assignment since yesterday by next week.",
      "verb": "starting"
    },
    {
      "sentence": "By next week, we will have been preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the company will have been making juice for three days.",
      "verb": "making"
    },
    {
      "sentence": "By tonight, sarah will have been learning Spanish.",
      "verb": "learning"
    },
    {
      "sentence": "By tomorrow, he will have been arriving to the store.",
      "verb": "arriving"
    },
    {
      "sentence": "By this evening, tom will have been speaking the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "By in two days, the students will have been speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, her sister will have been designing the furniture since Monday.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah will have been building the bathroom since Monday by next week.",
      "verb": "building"
    },
    {
      "sentence": "The company will have been thinking about the trip since yesterday by later.",
      "verb": "thinking"
    },
    {
      "sentence": "Her sister will have been meeting the boss since yesterday by soon.",
      "verb": "meeting"
    },
    {
      "sentence": "By next year, her sister will have been understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "By tomorrow, her sister will have been meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "By this evening, john will have been studying English.",
      "verb": "studying"
    },
    {
      "sentence": "Our neighbors will have been finishing the task for three days by next year.",
      "verb": "finishing"
    },
    {
      "sentence": "By next week, our neighbors will have been ordering breakfast.",
      "verb": "ordering"
    },
    {
      "sentence": "By tonight, tom will have been painting the garden.",
      "verb": "painting"
    },
    {
      "sentence": "By in two days, emma will have been walking downtown.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, my parents will have been drawing the room for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, sarah will have been speaking the teacher for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher will have been remembering the problem all week by tomorrow.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird will have been eating soup for years by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, sarah will have been visiting the teacher all day.",
      "verb": "visiting"
    },
    {
      "sentence": "We will have been talking the manager for a week by next week.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, john will have been contacting the client since morning.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, they will have been running to the office for three days.",
      "verb": "running"
    },
    {
      "sentence": "By next week, the dog will have been playing football.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, her sister will have been contacting my friend for a month.",
      "verb": "contacting"
    },
    {
      "sentence": "By tonight, sarah will have been submitting the document.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, her sister will have been choosing a laptop for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "By tomorrow, my brother will have been contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "By this evening, she will have been forgetting the birthday.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tonight, sarah will have been visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, we will have been selling a present for a month.",
      "verb": "selling"
    },
    {
      "sentence": "John will have been remembering the decision for two hours by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "Emma will have been ordering a salad all week by later.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, tom will have been calling my parents for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "By next week, they will have been giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the company will have been enjoying a snack since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, her sister will have been making a snack.",
      "verb": "making"
    },
    {
      "sentence": "Next month, the bird will have been sending the proposal all day.",
      "verb": "sending"
    },
    {
      "sentence": "By next month, the cat will have been arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "By next year, my friend will have been contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "He will have been enjoying a podcast for three days by tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will have been receiving the presentation for two hours.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah will have been learning French all week by tonight.",
      "verb": "learning"
    },
    {
      "sentence": "The teacher will have been returning to the library since yesterday by next month.",
      "verb": "returning"
    },
    {
      "sentence": "By soon, she will have been submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "John will have been listening to TV for two hours by this weekend.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the cat will have been sending the report since morning.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, our neighbors will have been talking the neighbors since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "My parents will have been calling my friend for three days by soon.",
      "verb": "calling"
    },
    {
      "sentence": "By tomorrow, her sister will have been giving a laptop.",
      "verb": "giving"
    },
    {
      "sentence": "Our neighbors will have been visiting the neighbors since morning by tomorrow.",
      "verb": "visiting"
    },
    {
      "sentence": "By next week, i will have been understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "Tom will have been completing the report all day by next month.",
      "verb": "completing"
    },
    {
      "sentence": "I will have been reviewing for the exam for three days by in two days.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this weekend, the manager will have been building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "By later, john will have been going to the office.",
      "verb": "going"
    },
    {
      "sentence": "Her sister will have been flying to the library for years by in two days.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, the team will have been writing the report.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, my parents will have been finishing the project all week.",
      "verb": "finishing"
    },
    {
      "sentence": "By tonight, we will have been speaking my friend.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, we will have been finding the phone.",
      "verb": "finding"
    },
    {
      "sentence": "My brother will have been buying a book since morning by tonight.",
      "verb": "buying"
    },
    {
      "sentence": "The cat will have been painting the house for a month by next month.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, the children will have been building the computer all day.",
      "verb": "building"
    },
    {
      "sentence": "The cat will have been designing a picture for a month by this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "Emma will have been playing a song since yesterday by next year.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the team will have been watching music for three days.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the children will have been reviewing French for two hours.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, the students will have been preparing coffee all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, they will have been planning the future since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "My parents will have been drinking pasta since yesterday by in two days.",
      "verb": "drinking"
    },
    {
      "sentence": "By later, the teacher will have been visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "By tonight, the company will have been receiving the proposal.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend will have been fixing a website for years by soon.",
      "verb": "fixing"
    },
    {
      "sentence": "She will have been eating a snack all day by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, they will have been enjoying football for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next year, the teacher will have been watching a podcast.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will have been calling the doctor for two hours by next month.",
      "verb": "calling"
    },
    {
      "sentence": "By tonight, john will have been preparing pizza.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher will have been reviewing the lesson for three days by in two days.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, he will have been forgetting the future for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the dog will have been planning the situation for a week.",
      "verb": "planning"
    },
    {
      "sentence": "Her sister will have been making soup since morning by next month.",
      "verb": "making"
    },
    {
      "sentence": "By later, her sister will have been listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, the teacher will have been drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "By tomorrow, the dog will have been arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, the manager will have been forgetting the vacation for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "You will have been returning downtown all day by next year.",
      "verb": "returning"
    },
    {
      "sentence": "By next year, we will have been choosing clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "By this evening, the teacher will have been coming downtown.",
      "verb": "coming"
    },
    {
      "sentence": "We will have been ordering juice since morning by next year.",
      "verb": "ordering"
    },
    {
      "sentence": "By later, my parents will have been enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the team will have been listening to a song since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, the children will have been building a website.",
      "verb": "building"
    },
    {
      "sentence": "The company will have been returning downtown since Monday by soon.",
      "verb": "returning"
    },
    {
      "sentence": "My brother will have been meeting my friend for three days by tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "The team will have been talking my friend all day by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, emma will have been considering the trip since morning.",
      "verb": "considering"
    },
    {
      "sentence": "The company will have been remembering the trip since Monday by tomorrow.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, my parents will have been reviewing mathematics for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, tom will have been enjoying lunch for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "We will have been studying mathematics for years by soon.",
      "verb": "studying"
    },
    {
      "sentence": "By tonight, the teacher will have been practicing for the exam.",
      "verb": "practicing"
    },
    {
      "sentence": "Our neighbors will have been starting the task all day by next week.",
      "verb": "starting"
    },
    {
      "sentence": "You will have been preparing dinner since morning by next month.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the company will have been preparing pasta since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the students will have been eating breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, emma will have been painting the room.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, the manager will have been buying flowers since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, my brother will have been finishing the email since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "Emma will have been writing the assignment for two hours by this evening.",
      "verb": "writing"
    },
    {
      "sentence": "The manager will have been cooking lunch since yesterday by this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the children will have been calling the client all week.",
      "verb": "calling"
    },
    {
      "sentence": "Sarah will have been completing the contract for years by tonight.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, my parents will have been driving to the store for a week.",
      "verb": "driving"
    },
    {
      "sentence": "The students will have been selling the phone all week by next year.",
      "verb": "selling"
    },
    {
      "sentence": "By next year, the team will have been forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, i will have been fixing the furniture for years.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister will have been returning to the airport for years by soon.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, tom will have been considering the meeting for a month.",
      "verb": "considering"
    },
    {
      "sentence": "I will have been choosing clothes for a month by this evening.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the manager will have been running to the beach for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By next month, tom will have been playing a documentary.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, tom will have been arriving to the library since morning.",
      "verb": "arriving"
    },
    {
      "sentence": "Sarah will have been driving to the library all day by this evening.",
      "verb": "driving"
    },
    {
      "sentence": "The company will have been writing the proposal for two hours by in two days.",
      "verb": "writing"
    },
    {
      "sentence": "They will have been speaking the neighbors for three days by soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the cat will have been listening to a video for a week.",
      "verb": "listening"
    },
    {
      "sentence": "My friend will have been enjoying soup for a month by next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher will have been practicing the textbook all day by soon.",
      "verb": "practicing"
    },
    {
      "sentence": "They will have been talking the client all day by tonight.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, you will have been listening to the news since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By soon, the teacher will have been learning Spanish.",
      "verb": "learning"
    },
    {
      "sentence": "The bird will have been playing music all week by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will have been drawing the car for years by in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, you will have been driving to the store since morning.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, they will have been drawing the bathroom since morning.",
      "verb": "drawing"
    },
    {
      "sentence": "By next week, the team will have been getting a gift.",
      "verb": "getting"
    },
    {
      "sentence": "By next month, the cat will have been learning the textbook.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, john will have been visiting the client all week.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors will have been running to the market for a month by in two days.",
      "verb": "running"
    },
    {
      "sentence": "Next month, john will have been getting flowers since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "By this evening, my brother will have been running to the park.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the company will have been remembering the trip since morning.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, our neighbors will have been watching a podcast all day.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the children will have been buying the ticket all day.",
      "verb": "buying"
    },
    {
      "sentence": "The children will have been playing a podcast since morning by next week.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, her sister will have been receiving the email for a month.",
      "verb": "receiving"
    },
    {
      "sentence": "By this weekend, my friend will have been building the car.",
      "verb": "building"
    },
    {
      "sentence": "By in two days, the dog will have been drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, john will have been running to the library for three days.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the manager will have been talking the doctor for a week.",
      "verb": "talking"
    },
    {
      "sentence": "The manager will have been returning to the store all day by later.",
      "verb": "returning"
    },
    {
      "sentence": "The cat will have been forgetting the situation since Monday by next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By in two days, emma will have been visiting my friend.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom will have been making a salad for three days by next week.",
      "verb": "making"
    },
    {
      "sentence": "Next month, tom will have been finding the phone all day.",
      "verb": "finding"
    },
    {
      "sentence": "By soon, sarah will have been writing the presentation.",
      "verb": "writing"
    },
    {
      "sentence": "The cat will have been listening to a video since morning by tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, the students will have been talking the neighbors.",
      "verb": "talking"
    },
    {
      "sentence": "The students will have been enjoying a sandwich for two hours by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "They will have been receiving the email for a month by soon.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, i will have been watching a podcast for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "By later, my parents will have been completing the email.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, our neighbors will have been teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "The children will have been considering the birthday since morning by this weekend.",
      "verb": "considering"
    },
    {
      "sentence": "They will have been talking the neighbors for years by next month.",
      "verb": "talking"
    },
    {
      "sentence": "By tonight, her sister will have been walking to the park.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, tom will have been flying to the gym for three days.",
      "verb": "flying"
    },
    {
      "sentence": "By later, my brother will have been running downtown.",
      "verb": "running"
    },
    {
      "sentence": "My friend will have been teaching grammar since Monday by next month.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the dog will have been cleaning a website all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "By this weekend, they will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, she will have been buying groceries for years.",
      "verb": "buying"
    },
    {
      "sentence": "John will have been selling groceries for three days by next week.",
      "verb": "selling"
    },
    {
      "sentence": "By this weekend, the manager will have been buying a new car.",
      "verb": "buying"
    },
    {
      "sentence": "John will have been calling the client for two hours by next year.",
      "verb": "calling"
    },
    {
      "sentence": "By soon, they will have been teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "Our neighbors will have been studying vocabulary for a week by next year.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my friend will have been thinking about the future for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "By soon, you will have been running to the office.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the manager will have been buying flowers for two hours.",
      "verb": "buying"
    },
    {
      "sentence": "By next year, the students will have been fixing the furniture.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, the cat will have been playing a documentary since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, they will have been enjoying a sandwich for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this evening, my parents will have been drawing the computer.",
      "verb": "drawing"
    },
    {
      "sentence": "By later, we will have been cooking lunch.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, my parents will have been listening to the news for a week.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, i will have been eating tea.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, our neighbors will have been watching a song.",
      "verb": "watching"
    },
    {
      "sentence": "I will have been learning science for three days by next year.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the dog will have been preparing breakfast since morning.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the manager will have been thinking about the decision for a week.",
      "verb": "thinking"
    },
    {
      "sentence": "The team will have been considering the vacation for a week by this evening.",
      "verb": "considering"
    },
    {
      "sentence": "By this weekend, our neighbors will have been thinking about the situation.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma will have been leaving downtown all day by this evening.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, her sister will have been flying to work since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "The manager will have been going to the park for three days by tomorrow.",
      "verb": "going"
    },
    {
      "sentence": "The manager will have been forgetting the problem for a month by in two days.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next year, her sister will have been finishing the proposal.",
      "verb": "finishing"
    },
    {
      "sentence": "By next year, my friend will have been drinking pasta.",
      "verb": "drinking"
    },
    {
      "sentence": "By next year, i will have been drinking a salad.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, john will have been forgetting the birthday all day.",
      "verb": "forgetting"
    },
    {
      "sentence": "By in two days, she will have been starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "She will have been flying to the airport since morning by soon.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, the manager will have been considering the decision for years.",
      "verb": "considering"
    },
    {
      "sentence": "By tomorrow, sarah will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, we will have been arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "By later, you will have been designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "By later, the bird will have been meeting the client.",
      "verb": "meeting"
    },
    {
      "sentence": "By later, my parents will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, john will have been enjoying a salad for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "The dog will have been remembering the vacation since morning by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "Sarah will have been thinking about the future for years by this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, her sister will have been drawing the computer for years.",
      "verb": "drawing"
    },
    {
      "sentence": "By this weekend, the teacher will have been reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next year, the cat will have been building the kitchen.",
      "verb": "building"
    },
    {
      "sentence": "By next month, they will have been cleaning the furniture.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, the team will have been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, our neighbors will have been completing the report.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, our neighbors will have been visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "She will have been walking to the office since Monday by tonight.",
      "verb": "walking"
    },
    {
      "sentence": "John will have been coming to the market for three days by next week.",
      "verb": "coming"
    },
    {
      "sentence": "The cat will have been planning the event all week by next year.",
      "verb": "planning"
    },
    {
      "sentence": "She will have been drinking a snack for years by tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the manager will have been running to work since morning.",
      "verb": "running"
    },
    {
      "sentence": "Next month, sarah will have been fixing the house since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "He will have been playing a song since Monday by next month.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my brother will have been repairing the bathroom for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, the team will have been considering the meeting all day.",
      "verb": "considering"
    },
    {
      "sentence": "The children will have been drawing the house all week by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister will have been getting a book for years by next year.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, my brother will have been enjoying a movie for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, emma will have been drawing the house.",
      "verb": "drawing"
    },
    {
      "sentence": "The children will have been studying Spanish for two hours by next year.",
      "verb": "studying"
    },
    {
      "sentence": "By later, they will have been fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, i will have been making soup since Monday.",
      "verb": "making"
    },
    {
      "sentence": "My brother will have been leaving to the park all day by this weekend.",
      "verb": "leaving"
    },
    {
      "sentence": "She will have been going to the gym for a week by next year.",
      "verb": "going"
    },
    {
      "sentence": "By this evening, the cat will have been preparing breakfast.",
      "verb": "preparing"
    },
    {
      "sentence": "Sarah will have been talking the client since morning by this weekend.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, i will have been enjoying TV for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next week, the cat will have been designing the car.",
      "verb": "designing"
    },
    {
      "sentence": "By tonight, her sister will have been planning the birthday.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, the company will have been reading French since morning.",
      "verb": "reading"
    },
    {
      "sentence": "By later, they will have been enjoying juice.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, john will have been fixing the house since morning.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, the company will have been forgetting the birthday for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tomorrow, sarah will have been playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the bird will have been playing a podcast for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been calling the team since morning by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "By in two days, she will have been speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "You will have been returning to the library since yesterday by this weekend.",
      "verb": "returning"
    },
    {
      "sentence": "The company will have been making breakfast since morning by this weekend.",
      "verb": "making"
    },
    {
      "sentence": "They will have been remembering the meeting all day by soon.",
      "verb": "remembering"
    },
    {
      "sentence": "I will have been visiting the manager for two hours by next month.",
      "verb": "visiting"
    },
    {
      "sentence": "We will have been watching the game for a month by this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, my friend will have been getting the ticket since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "Our neighbors will have been giving a new car for three days by next month.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the students will have been visiting the manager for a week.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, the students will have been getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "By next week, emma will have been getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "The teacher will have been flying to the market all week by next month.",
      "verb": "flying"
    },
    {
      "sentence": "Emma will have been painting the bathroom since Monday by tonight.",
      "verb": "painting"
    },
    {
      "sentence": "John will have been writing the document all day by next year.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will have been getting flowers since Monday by in two days.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, they will have been listening to basketball for years.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, emma will have been enjoying pizza.",
      "verb": "enjoying"
    },
    {
      "sentence": "Emma will have been considering the birthday for a week by next month.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, john will have been teaching Spanish for years.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, he will have been walking to the store since morning.",
      "verb": "walking"
    },
    {
      "sentence": "They will have been going to the park since morning by soon.",
      "verb": "going"
    },
    {
      "sentence": "By next year, the team will have been reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, my brother will have been getting the keys since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "Tom will have been contacting the neighbors for a week by this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "The bird will have been meeting the boss for a month by next year.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, emma will have been forgetting the vacation since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, they will have been studying the lesson for a week.",
      "verb": "studying"
    },
    {
      "sentence": "Emma will have been meeting the manager for a week by later.",
      "verb": "meeting"
    },
    {
      "sentence": "She will have been giving a new car for a month by later.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the dog will have been getting a present since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, my parents will have been meeting the team since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "My parents will have been finishing the contract for three days by soon.",
      "verb": "finishing"
    },
    {
      "sentence": "By tonight, tom will have been running to the store.",
      "verb": "running"
    },
    {
      "sentence": "Emma will have been cooking dinner all week by this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the bird will have been studying science for three days.",
      "verb": "studying"
    },
    {
      "sentence": "By soon, the children will have been submitting the email.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, my brother will have been cooking juice all day.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird will have been eating juice for years by next year.",
      "verb": "eating"
    },
    {
      "sentence": "She will have been practicing the chapter for two hours by later.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, her sister will have been making a snack for years.",
      "verb": "making"
    },
    {
      "sentence": "They will have been sending the application for two hours by later.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, emma will have been calling the client since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, the manager will have been enjoying coffee since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, emma will have been watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, the bird will have been meeting the boss.",
      "verb": "meeting"
    },
    {
      "sentence": "By this evening, you will have been repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, the children will have been considering the future since morning.",
      "verb": "considering"
    },
    {
      "sentence": "The dog will have been studying history all day by in two days.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, john will have been speaking my parents since morning.",
      "verb": "speaking"
    },
    {
      "sentence": "Emma will have been remembering the vacation all week by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "By in two days, john will have been preparing juice.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, our neighbors will have been calling the boss for three days.",
      "verb": "calling"
    },
    {
      "sentence": "The bird will have been going to the market for a month by in two days.",
      "verb": "going"
    },
    {
      "sentence": "Next month, the children will have been enjoying a podcast since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, tom will have been arriving to the park.",
      "verb": "arriving"
    },
    {
      "sentence": "By soon, the teacher will have been choosing a laptop.",
      "verb": "choosing"
    },
    {
      "sentence": "You will have been building the kitchen since yesterday by this evening.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the company will have been making soup for a month.",
      "verb": "making"
    },
    {
      "sentence": "By in two days, the cat will have been painting the room.",
      "verb": "painting"
    },
    {
      "sentence": "By tomorrow, the bird will have been talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, she will have been remembering the problem for two hours.",
      "verb": "remembering"
    },
    {
      "sentence": "My parents will have been drawing a picture all day by next month.",
      "verb": "drawing"
    },
    {
      "sentence": "By next year, the students will have been arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "We will have been cooking a snack all week by in two days.",
      "verb": "cooking"
    },
    {
      "sentence": "By next week, the manager will have been receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "By tonight, emma will have been understanding the chapter.",
      "verb": "understanding"
    },
    {
      "sentence": "The team will have been understanding vocabulary all day by next week.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, my parents will have been running to the market since Monday.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the children will have been repairing the furniture since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "He will have been starting the document since yesterday by later.",
      "verb": "starting"
    },
    {
      "sentence": "The children will have been learning the textbook for a month by next year.",
      "verb": "learning"
    },
    {
      "sentence": "By this evening, sarah will have been cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, the bird will have been visiting my family all week.",
      "verb": "visiting"
    },
    {
      "sentence": "He will have been thinking about the options for two hours by this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, the cat will have been cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "By next year, her sister will have been completing the assignment.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, i will have been ordering coffee since morning.",
      "verb": "ordering"
    },
    {
      "sentence": "By soon, our neighbors will have been learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the company will have been preparing juice for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "My friend will have been choosing a gift for years by later.",
      "verb": "choosing"
    },
    {
      "sentence": "My friend will have been getting a gift for a week by later.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, my friend will have been walking to the gym for a month.",
      "verb": "walking"
    },
    {
      "sentence": "Our neighbors will have been walking downtown since Monday by next month.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, the manager will have been getting the phone for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "The team will have been visiting my friend since Monday by later.",
      "verb": "visiting"
    },
    {
      "sentence": "By tomorrow, my parents will have been finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "My brother will have been reading Spanish since yesterday by tonight.",
      "verb": "reading"
    },
    {
      "sentence": "By tonight, sarah will have been receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "My brother will have been painting the computer all day by this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "My friend will have been reading French for a month by soon.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, the cat will have been ordering tea for years.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, her sister will have been fixing the computer for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister will have been finding a laptop for a month by this weekend.",
      "verb": "finding"
    },
    {
      "sentence": "The cat will have been teaching grammar for three days by in two days.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, our neighbors will have been starting the contract since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By next month, my brother will have been understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "The manager will have been studying grammar for two hours by in two days.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my friend will have been considering the birthday for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, my friend will have been submitting the proposal for a week.",
      "verb": "submitting"
    },
    {
      "sentence": "By next week, the cat will have been thinking about the vacation.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, they will have been flying to work.",
      "verb": "flying"
    },
    {
      "sentence": "By tomorrow, the company will have been understanding history.",
      "verb": "understanding"
    },
    {
      "sentence": "By soon, sarah will have been visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, john will have been considering the situation for a week.",
      "verb": "considering"
    },
    {
      "sentence": "By soon, my brother will have been receiving the proposal.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, they will have been eating coffee for a week.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the children will have been thinking about the situation for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "By tomorrow, the cat will have been arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, he will have been preparing tea for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "I will have been receiving the report for a week by next year.",
      "verb": "receiving"
    },
    {
      "sentence": "By next year, the dog will have been sending the document.",
      "verb": "sending"
    },
    {
      "sentence": "By tonight, our neighbors will have been eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "By later, the company will have been meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, they will have been selling the keys since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, emma will have been starting the proposal since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "By later, she will have been eating tea.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, emma will have been preparing soup since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By later, she will have been teaching grammar.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the team will have been running to the gym for a week.",
      "verb": "running"
    },
    {
      "sentence": "Next month, my parents will have been cooking a snack since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "By tonight, sarah will have been speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "They will have been returning to the beach since Monday by this weekend.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, the teacher will have been selling a laptop.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the students will have been giving clothes for three days.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, she will have been remembering the meeting for a week.",
      "verb": "remembering"
    },
    {
      "sentence": "The company will have been getting the keys for years by next month.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, the dog will have been talking the boss for years.",
      "verb": "talking"
    },
    {
      "sentence": "The students will have been making coffee for a week by next year.",
      "verb": "making"
    },
    {
      "sentence": "Emma will have been going to the market since Monday by tomorrow.",
      "verb": "going"
    },
    {
      "sentence": "Next month, tom will have been starting the letter since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "She will have been contacting my family for a week by this evening.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister will have been designing a picture all week by this evening.",
      "verb": "designing"
    },
    {
      "sentence": "By next year, he will have been drawing the room.",
      "verb": "drawing"
    },
    {
      "sentence": "By tonight, he will have been cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "By later, john will have been repairing the house.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, emma will have been going downtown for a week.",
      "verb": "going"
    },
    {
      "sentence": "Next month, the students will have been designing a website all day.",
      "verb": "designing"
    },
    {
      "sentence": "The bird will have been building the garden all week by next week.",
      "verb": "building"
    },
    {
      "sentence": "By this evening, the bird will have been enjoying pasta.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, she will have been reviewing grammar all day.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, sarah will have been practicing for the exam since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "By next year, my parents will have been preparing a snack.",
      "verb": "preparing"
    },
    {
      "sentence": "My friend will have been listening to TV all day by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By this weekend, the bird will have been building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "They will have been completing the project for two hours by later.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, sarah will have been eating a salad for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "By this weekend, he will have been contacting the manager.",
      "verb": "contacting"
    },
    {
      "sentence": "They will have been giving the ticket all day by next month.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, sarah will have been playing a video all day.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, tom will have been enjoying a salad.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, they will have been receiving the email.",
      "verb": "receiving"
    },
    {
      "sentence": "The bird will have been reading for the exam all week by this evening.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, the teacher will have been reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, she will have been leaving downtown for a month.",
      "verb": "leaving"
    },
    {
      "sentence": "By tomorrow, my friend will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Our neighbors will have been making breakfast for three days by next year.",
      "verb": "making"
    },
    {
      "sentence": "John will have been playing the news all week by tonight.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been painting the furniture all day by next month.",
      "verb": "painting"
    },
    {
      "sentence": "By tomorrow, the manager will have been cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "The manager will have been driving to the store for two hours by tonight.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, john will have been cooking a snack since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "The cat will have been finding a new car since Monday by this evening.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, he will have been listening to a podcast since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, the cat will have been painting the car.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, her sister will have been sending the letter for three days.",
      "verb": "sending"
    },
    {
      "sentence": "By later, i will have been listening to a movie.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, he will have been reviewing Spanish for two hours.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, john will have been practicing French since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, i will have been listening to a song since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, they will have been submitting the project for two hours.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, her sister will have been listening to basketball since morning.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will have been preparing coffee for a month by next year.",
      "verb": "preparing"
    },
    {
      "sentence": "By tomorrow, the bird will have been building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "Next month, they will have been selling clothes since morning.",
      "verb": "selling"
    },
    {
      "sentence": "By tonight, the team will have been returning home.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, the company will have been starting the document for a week.",
      "verb": "starting"
    },
    {
      "sentence": "By later, the company will have been painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "By next month, he will have been ordering pasta.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, he will have been drawing the garden since morning.",
      "verb": "drawing"
    },
    {
      "sentence": "The students will have been starting the assignment for three days by soon.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, they will have been writing the email all week.",
      "verb": "writing"
    },
    {
      "sentence": "The dog will have been forgetting the situation for years by tomorrow.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the children will have been starting the presentation for two hours.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, i will have been speaking the doctor since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "By next week, my friend will have been ordering a salad.",
      "verb": "ordering"
    },
    {
      "sentence": "My parents will have been selling the phone for a month by later.",
      "verb": "selling"
    },
    {
      "sentence": "My parents will have been repairing the computer for a month by later.",
      "verb": "repairing"
    },
    {
      "sentence": "By in two days, the company will have been arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "By in two days, the cat will have been going home.",
      "verb": "going"
    },
    {
      "sentence": "The dog will have been practicing English since yesterday by later.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, the children will have been contacting the boss since morning.",
      "verb": "contacting"
    },
    {
      "sentence": "By next week, you will have been choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors will have been building a picture since yesterday by soon.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the dog will have been enjoying basketball for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, my parents will have been cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the cat will have been enjoying the news all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tonight, i will have been thinking about the problem.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, you will have been ordering tea for years.",
      "verb": "ordering"
    },
    {
      "sentence": "By in two days, my friend will have been talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "The children will have been getting flowers since morning by later.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, her sister will have been repairing the house since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "By next year, tom will have been listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "The students will have been finishing the project since yesterday by this evening.",
      "verb": "finishing"
    },
    {
      "sentence": "She will have been driving to the park all day by soon.",
      "verb": "driving"
    },
    {
      "sentence": "I will have been visiting the team all day by next month.",
      "verb": "visiting"
    },
    {
      "sentence": "By in two days, my parents will have been calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, the manager will have been finding groceries for years.",
      "verb": "finding"
    },
    {
      "sentence": "Emma will have been submitting the proposal for a week by in two days.",
      "verb": "submitting"
    },
    {
      "sentence": "By in two days, the team will have been meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "John will have been teaching Spanish all day by this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, i will have been submitting the document since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the manager will have been understanding history for a week.",
      "verb": "understanding"
    },
    {
      "sentence": "The teacher will have been talking my family for years by tomorrow.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, they will have been thinking about the decision all day.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, our neighbors will have been talking the boss since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, sarah will have been painting a website.",
      "verb": "painting"
    },
    {
      "sentence": "The company will have been going to the store for a month by in two days.",
      "verb": "going"
    },
    {
      "sentence": "By this weekend, you will have been giving the phone.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, they will have been talking the neighbors for years.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister will have been finishing the application all week by tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "The children will have been buying a present all week by soon.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, my brother will have been writing the project for three days.",
      "verb": "writing"
    },
    {
      "sentence": "By later, our neighbors will have been completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "By next month, my parents will have been ordering lunch.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, the children will have been getting flowers since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "By this weekend, the teacher will have been studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "By tomorrow, we will have been thinking about the birthday.",
      "verb": "thinking"
    },
    {
      "sentence": "By tonight, my parents will have been practicing for the exam.",
      "verb": "practicing"
    },
    {
      "sentence": "By tomorrow, emma will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the children will have been fixing the room for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "She will have been choosing clothes since morning by next year.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird will have been returning to the market since morning by next year.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, emma will have been choosing the phone since morning.",
      "verb": "choosing"
    },
    {
      "sentence": "Sarah will have been walking to the store for three days by soon.",
      "verb": "walking"
    },
    {
      "sentence": "By soon, they will have been finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, we will have been studying Spanish since Monday.",
      "verb": "studying"
    },
    {
      "sentence": "The dog will have been watching music since Monday by tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "By this weekend, our neighbors will have been cleaning the car.",
      "verb": "cleaning"
    },
    {
      "sentence": "The bird will have been receiving the assignment for two hours by this evening.",
      "verb": "receiving"
    },
    {
      "sentence": "By tomorrow, tom will have been talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "Emma will have been returning to the office for a month by next year.",
      "verb": "returning"
    },
    {
      "sentence": "By in two days, my parents will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, you will have been talking the doctor since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By this evening, the students will have been thinking about the birthday.",
      "verb": "thinking"
    },
    {
      "sentence": "She will have been listening to the news since Monday by next year.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the children will have been listening to a video since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "The students will have been learning science all week by tomorrow.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, emma will have been painting the kitchen all day.",
      "verb": "painting"
    },
    {
      "sentence": "The manager will have been remembering the decision all week by in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "By this evening, the children will have been finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "Tom will have been making a sandwich since morning by soon.",
      "verb": "making"
    },
    {
      "sentence": "Emma will have been enjoying the game since Monday by tonight.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this evening, john will have been forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "I will have been buying a gift since Monday by next month.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, john will have been forgetting the situation for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "I will have been leaving to the airport for a month by later.",
      "verb": "leaving"
    },
    {
      "sentence": "By soon, the dog will have been preparing dinner.",
      "verb": "preparing"
    },
    {
      "sentence": "You will have been eating pizza since Monday by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, they will have been returning to the airport since morning.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, my friend will have been thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, they will have been listening to football all day.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, the teacher will have been flying to the office.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, the company will have been completing the report for years.",
      "verb": "completing"
    },
    {
      "sentence": "By this evening, he will have been finishing the email.",
      "verb": "finishing"
    },
    {
      "sentence": "By this evening, the students will have been drinking a snack.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, they will have been thinking about the decision since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "The children will have been contacting the boss since Monday by next month.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, you will have been practicing mathematics since morning.",
      "verb": "practicing"
    },
    {
      "sentence": "By next year, we will have been practicing vocabulary.",
      "verb": "practicing"
    },
    {
      "sentence": "By later, sarah will have been ordering pizza.",
      "verb": "ordering"
    },
    {
      "sentence": "The team will have been running to the gym all week by tonight.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the manager will have been drawing a picture for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat will have been drawing a website for years by this weekend.",
      "verb": "drawing"
    },
    {
      "sentence": "My friend will have been reviewing history for three days by tomorrow.",
      "verb": "reviewing"
    },
    {
      "sentence": "Sarah will have been thinking about the trip for two hours by tonight.",
      "verb": "thinking"
    },
    {
      "sentence": "My brother will have been giving flowers since yesterday by later.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, you will have been eating a snack all day.",
      "verb": "eating"
    },
    {
      "sentence": "By tonight, john will have been walking to the airport.",
      "verb": "walking"
    },
    {
      "sentence": "You will have been forgetting the meeting for a week by later.",
      "verb": "forgetting"
    },
    {
      "sentence": "By in two days, she will have been giving clothes.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, my parents will have been getting a new car all day.",
      "verb": "getting"
    },
    {
      "sentence": "By next week, we will have been contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "By in two days, my brother will have been arriving to the store.",
      "verb": "arriving"
    },
    {
      "sentence": "They will have been making a sandwich since yesterday by later.",
      "verb": "making"
    },
    {
      "sentence": "By next week, the manager will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "By tomorrow, we will have been studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "They will have been considering the decision for a month by tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "By in two days, sarah will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "By tonight, the bird will have been listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, my brother will have been meeting the neighbors for two hours.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, our neighbors will have been reviewing history for a month.",
      "verb": "reviewing"
    },
    {
      "sentence": "The manager will have been watching a song for two hours by in two days.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, emma will have been thinking about the birthday for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "The teacher will have been walking downtown for a month by next year.",
      "verb": "walking"
    },
    {
      "sentence": "By tomorrow, her sister will have been learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, he will have been painting the computer for a month.",
      "verb": "painting"
    },
    {
      "sentence": "The bird will have been speaking the doctor all week by this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "You will have been remembering the event since Monday by tonight.",
      "verb": "remembering"
    },
    {
      "sentence": "By tonight, the bird will have been meeting the team.",
      "verb": "meeting"
    },
    {
      "sentence": "You will have been practicing the lesson for three days by soon.",
      "verb": "practicing"
    },
    {
      "sentence": "The students will have been choosing a gift since yesterday by later.",
      "verb": "choosing"
    },
    {
      "sentence": "The manager will have been choosing a new car for a month by in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "By this weekend, the team will have been building the room.",
      "verb": "building"
    },
    {
      "sentence": "Next month, our neighbors will have been studying Spanish since morning.",
      "verb": "studying"
    },
    {
      "sentence": "By this weekend, the bird will have been selling a present.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, she will have been speaking the doctor for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the students will have been buying a book for years.",
      "verb": "buying"
    },
    {
      "sentence": "We will have been finding the keys since yesterday by tonight.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, the cat will have been drinking lunch since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By in two days, the company will have been cooking a sandwich.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the company will have been driving to the market since yesterday.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, i will have been selling the keys for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "We will have been cooking soup for three days by next month.",
      "verb": "cooking"
    },
    {
      "sentence": "Tom will have been playing a video for a month by later.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my parents will have been studying grammar for years.",
      "verb": "studying"
    },
    {
      "sentence": "By next year, the bird will have been drinking pasta.",
      "verb": "drinking"
    },
    {
      "sentence": "By tonight, our neighbors will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the bird will have been buying a laptop for two hours.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, the company will have been finishing the letter for a month.",
      "verb": "finishing"
    },
    {
      "sentence": "Sarah will have been finishing the task for three days by tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, my friend will have been returning to work for two hours.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, my friend will have been making pizza all day.",
      "verb": "making"
    },
    {
      "sentence": "By in two days, tom will have been arriving to the office.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, the children will have been calling the doctor since Monday.",
      "verb": "calling"
    },
    {
      "sentence": "By next week, the students will have been cleaning a website.",
      "verb": "cleaning"
    },
    {
      "sentence": "They will have been considering the problem since morning by in two days.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, the team will have been preparing juice.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, he will have been considering the situation all week.",
      "verb": "considering"
    },
    {
      "sentence": "By tomorrow, john will have been buying the phone.",
      "verb": "buying"
    },
    {
      "sentence": "Tom will have been arriving to school for years by next week.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, i will have been submitting the proposal all week.",
      "verb": "submitting"
    },
    {
      "sentence": "John will have been cooking a sandwich for three days by tomorrow.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, john will have been reviewing mathematics for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next year, tom will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "The dog will have been designing the computer all day by in two days.",
      "verb": "designing"
    },
    {
      "sentence": "The manager will have been designing a website for two hours by tonight.",
      "verb": "designing"
    },
    {
      "sentence": "The company will have been considering the meeting for years by next year.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, the bird will have been running home since Monday.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the dog will have been watching tennis all day.",
      "verb": "watching"
    },
    {
      "sentence": "John will have been building the furniture all day by this weekend.",
      "verb": "building"
    },
    {
      "sentence": "By this weekend, the manager will have been starting the letter.",
      "verb": "starting"
    },
    {
      "sentence": "The dog will have been planning the future for a week by in two days.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, the company will have been preparing breakfast for years.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the team will have been listening to the news for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By tonight, they will have been cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, you will have been reading French since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "By next week, the team will have been preparing breakfast.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher will have been coming to the gym for years by next month.",
      "verb": "coming"
    },
    {
      "sentence": "The bird will have been learning science since Monday by later.",
      "verb": "learning"
    },
    {
      "sentence": "The team will have been contacting the client since yesterday by later.",
      "verb": "contacting"
    },
    {
      "sentence": "We will have been watching a movie for two hours by later.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will have been driving to the store for three days by next year.",
      "verb": "driving"
    },
    {
      "sentence": "Her sister will have been playing the news since Monday by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "The manager will have been contacting the boss since Monday by in two days.",
      "verb": "contacting"
    },
    {
      "sentence": "The students will have been enjoying a song all day by next month.",
      "verb": "enjoying"
    },
    {
      "sentence": "They will have been starting the presentation for years by soon.",
      "verb": "starting"
    },
    {
      "sentence": "By in two days, my parents will have been drawing the car.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the children will have been calling the manager for a week.",
      "verb": "calling"
    },
    {
      "sentence": "The children will have been getting the ticket for a month by next month.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, john will have been getting a book for a month.",
      "verb": "getting"
    },
    {
      "sentence": "You will have been forgetting the decision for a month by this weekend.",
      "verb": "forgetting"
    },
    {
      "sentence": "By in two days, sarah will have been reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "The dog will have been considering the birthday all week by in two days.",
      "verb": "considering"
    },
    {
      "sentence": "My brother will have been starting the document for two hours by tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "By next year, they will have been speaking my friend.",
      "verb": "speaking"
    },
    {
      "sentence": "By tonight, we will have been designing the computer.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, sarah will have been walking to school for three days.",
      "verb": "walking"
    },
    {
      "sentence": "The cat will have been studying mathematics for three days by next month.",
      "verb": "studying"
    },
    {
      "sentence": "Emma will have been enjoying football for a month by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "The students will have been finding a laptop since morning by next month.",
      "verb": "finding"
    },
    {
      "sentence": "By this weekend, the manager will have been talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "By tomorrow, her sister will have been finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, my friend will have been visiting the client since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher will have been meeting the neighbors for years by soon.",
      "verb": "meeting"
    },
    {
      "sentence": "The company will have been writing the contract since morning by tonight.",
      "verb": "writing"
    },
    {
      "sentence": "The dog will have been going home since yesterday by tonight.",
      "verb": "going"
    },
    {
      "sentence": "The cat will have been making soup for two hours by tomorrow.",
      "verb": "making"
    },
    {
      "sentence": "By tomorrow, you will have been finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "By tomorrow, john will have been studying for the exam.",
      "verb": "studying"
    },
    {
      "sentence": "The dog will have been preparing a sandwich for three days by next month.",
      "verb": "preparing"
    },
    {
      "sentence": "You will have been giving the ticket all day by next year.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, you will have been listening to football since morning.",
      "verb": "listening"
    },
    {
      "sentence": "By soon, john will have been going to the office.",
      "verb": "going"
    },
    {
      "sentence": "By next week, sarah will have been making tea.",
      "verb": "making"
    },
    {
      "sentence": "Next month, emma will have been forgetting the options all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, we will have been ordering coffee all week.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, tom will have been leaving to the airport for two hours.",
      "verb": "leaving"
    },
    {
      "sentence": "The manager will have been drawing the computer for a month by tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "By this evening, the team will have been practicing the lesson.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, he will have been receiving the report for a week.",
      "verb": "receiving"
    },
    {
      "sentence": "The teacher will have been cooking dinner since Monday by soon.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, you will have been repairing the kitchen for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "By soon, the teacher will have been flying to the beach.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, john will have been playing a documentary since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The manager will have been preparing pizza for two hours by this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "By tomorrow, the students will have been completing the email.",
      "verb": "completing"
    },
    {
      "sentence": "They will have been planning the meeting all week by tomorrow.",
      "verb": "planning"
    },
    {
      "sentence": "By this weekend, the company will have been meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "By in two days, sarah will have been thinking about the birthday.",
      "verb": "thinking"
    },
    {
      "sentence": "By next week, our neighbors will have been flying home.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, my parents will have been driving to the gym for years.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, you will have been remembering the situation since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "By this evening, emma will have been finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, they will have been remembering the options all day.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, emma will have been visiting the neighbors for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the students will have been playing the news all week.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, she will have been learning the lesson since Monday.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, my friend will have been flying downtown for a month.",
      "verb": "flying"
    },
    {
      "sentence": "The children will have been teaching Spanish for two hours by tonight.",
      "verb": "teaching"
    },
    {
      "sentence": "By this weekend, tom will have been planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "The students will have been designing the furniture for three days by this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "By this evening, the cat will have been selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "By next week, the bird will have been speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "By later, the students will have been visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "By this weekend, our neighbors will have been preparing pizza.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, the children will have been walking to the office all day.",
      "verb": "walking"
    },
    {
      "sentence": "Tom will have been submitting the contract for two hours by later.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, tom will have been practicing French since yesterday.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, our neighbors will have been reviewing Spanish for a month.",
      "verb": "reviewing"
    },
    {
      "sentence": "By soon, my parents will have been thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the bird will have been playing a song for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my parents will have been reading for the exam since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "By soon, the company will have been enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "The cat will have been making a snack all day by tonight.",
      "verb": "making"
    },
    {
      "sentence": "By tomorrow, john will have been arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "By next month, john will have been planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "By in two days, john will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will have been painting the garden since morning by tomorrow.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, john will have been practicing the lesson for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "By in two days, the manager will have been watching football.",
      "verb": "watching"
    },
    {
      "sentence": "By later, the children will have been studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my parents will have been forgetting the options for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the dog will have been playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "He will have been running to work for three days by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "Next month, emma will have been making soup for years.",
      "verb": "making"
    },
    {
      "sentence": "By later, the manager will have been forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "By soon, we will have been remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "By next year, emma will have been reading the chapter.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, the team will have been enjoying a salad since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, they will have been building the furniture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the bird will have been planning the birthday for years.",
      "verb": "planning"
    },
    {
      "sentence": "By next month, sarah will have been sending the application.",
      "verb": "sending"
    },
    {
      "sentence": "I will have been ordering a salad for a month by this evening.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, i will have been drinking pizza since morning.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, they will have been calling my friend since morning.",
      "verb": "calling"
    },
    {
      "sentence": "The company will have been getting clothes all day by tomorrow.",
      "verb": "getting"
    },
    {
      "sentence": "By next month, the dog will have been writing the project.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, tom will have been playing a song since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, the dog will have been flying to the store.",
      "verb": "flying"
    },
    {
      "sentence": "Tom will have been preparing breakfast since yesterday by tomorrow.",
      "verb": "preparing"
    },
    {
      "sentence": "By next week, the students will have been meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, john will have been planning the situation for a month.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, i will have been making juice for years.",
      "verb": "making"
    },
    {
      "sentence": "Next month, they will have been enjoying juice for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, tom will have been drawing a picture all week.",
      "verb": "drawing"
    },
    {
      "sentence": "The team will have been completing the assignment since Monday by this weekend.",
      "verb": "completing"
    },
    {
      "sentence": "My friend will have been selling a laptop since morning by next month.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the children will have been running to work since morning.",
      "verb": "running"
    },
    {
      "sentence": "Next month, our neighbors will have been practicing the lesson since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "She will have been choosing flowers all week by tomorrow.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the team will have been meeting the boss since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "By in two days, we will have been contacting the neighbors.",
      "verb": "contacting"
    },
    {
      "sentence": "By this evening, tom will have been understanding mathematics.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, the teacher will have been designing the garden since morning.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, our neighbors will have been thinking about the options for years.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, you will have been drinking pasta for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "I will have been repairing the room since yesterday by tonight.",
      "verb": "repairing"
    },
    {
      "sentence": "John will have been sending the project for a week by this evening.",
      "verb": "sending"
    },
    {
      "sentence": "By this weekend, they will have been finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "Our neighbors will have been buying groceries all week by in two days.",
      "verb": "buying"
    },
    {
      "sentence": "Tom will have been forgetting the meeting for a month by tonight.",
      "verb": "forgetting"
    },
    {
      "sentence": "The teacher will have been talking the teacher for three days by soon.",
      "verb": "talking"
    },
    {
      "sentence": "By tomorrow, sarah will have been ordering pizza.",
      "verb": "ordering"
    },
    {
      "sentence": "By next week, the bird will have been planning the problem.",
      "verb": "planning"
    },
    {
      "sentence": "She will have been visiting the client for years by later.",
      "verb": "visiting"
    },
    {
      "sentence": "By in two days, she will have been forgetting the trip.",
      "verb": "forgetting"
    },
    {
      "sentence": "By tomorrow, my parents will have been selling a book.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, my brother will have been flying to the airport for two hours.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, my parents will have been reviewing science since morning.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next year, the students will have been enjoying music.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, john will have been choosing a book for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, sarah will have been making coffee since Monday.",
      "verb": "making"
    },
    {
      "sentence": "By later, he will have been designing the bathroom.",
      "verb": "designing"
    },
    {
      "sentence": "By next week, we will have been buying a new car.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, my brother will have been talking my friend for a week.",
      "verb": "talking"
    },
    {
      "sentence": "Tom will have been preparing juice all week by this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma will have been talking the team for a week by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "John will have been listening to the game for a week by later.",
      "verb": "listening"
    },
    {
      "sentence": "By next year, he will have been learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "By this evening, sarah will have been visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, the teacher will have been submitting the proposal since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the dog will have been cleaning a website for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, john will have been buying the ticket since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "By tonight, the company will have been completing the assignment.",
      "verb": "completing"
    },
    {
      "sentence": "By later, the bird will have been reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "By tonight, the students will have been driving to the park.",
      "verb": "driving"
    },
    {
      "sentence": "The students will have been studying the chapter all day by soon.",
      "verb": "studying"
    },
    {
      "sentence": "My friend will have been starting the contract since morning by next week.",
      "verb": "starting"
    },
    {
      "sentence": "They will have been forgetting the birthday all day by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, my friend will have been writing the contract for three days.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, the company will have been contacting my family for years.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents will have been meeting my family since morning by this evening.",
      "verb": "meeting"
    },
    {
      "sentence": "By tomorrow, our neighbors will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, you will have been enjoying music all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, my brother will have been practicing French all week.",
      "verb": "practicing"
    },
    {
      "sentence": "The bird will have been returning to the beach all week by next week.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, my friend will have been finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the students will have been remembering the birthday all day.",
      "verb": "remembering"
    },
    {
      "sentence": "My parents will have been writing the contract for a week by next month.",
      "verb": "writing"
    },
    {
      "sentence": "Next month, the manager will have been forgetting the options for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, my parents will have been completing the contract since morning.",
      "verb": "completing"
    },
    {
      "sentence": "Sarah will have been making a sandwich since Monday by tonight.",
      "verb": "making"
    },
    {
      "sentence": "By this weekend, he will have been reviewing the textbook.",
      "verb": "reviewing"
    },
    {
      "sentence": "The dog will have been cooking dinner for three days by this evening.",
      "verb": "cooking"
    },
    {
      "sentence": "By tomorrow, the manager will have been preparing dinner.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors will have been calling my friend for a week by later.",
      "verb": "calling"
    },
    {
      "sentence": "They will have been receiving the task for a week by tonight.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the dog will have been reviewing French for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, her sister will have been enjoying the news all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird will have been submitting the letter all week by tomorrow.",
      "verb": "submitting"
    },
    {
      "sentence": "We will have been enjoying breakfast since yesterday by next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, sarah will have been talking the team since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "The bird will have been enjoying the game for a week by this evening.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, her sister will have been considering the vacation for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "They will have been receiving the report for three days by this weekend.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah will have been playing basketball for two hours by next month.",
      "verb": "playing"
    },
    {
      "sentence": "I will have been fixing the house since yesterday by in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "By soon, her sister will have been talking the neighbors.",
      "verb": "talking"
    },
    {
      "sentence": "By soon, the children will have been making pizza.",
      "verb": "making"
    },
    {
      "sentence": "Next month, you will have been buying a gift all week.",
      "verb": "buying"
    },
    {
      "sentence": "Emma will have been walking to the gym all day by this evening.",
      "verb": "walking"
    },
    {
      "sentence": "By tomorrow, the manager will have been considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "They will have been playing TV since yesterday by next week.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister will have been buying clothes for three days by tonight.",
      "verb": "buying"
    },
    {
      "sentence": "Emma will have been talking the boss for a month by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "My parents will have been drawing the furniture for three days by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, tom will have been flying to the beach since Monday.",
      "verb": "flying"
    },
    {
      "sentence": "Our neighbors will have been walking to the library all day by next week.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, our neighbors will have been talking the manager for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, sarah will have been remembering the event since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "Sarah will have been talking the boss since Monday by this weekend.",
      "verb": "talking"
    },
    {
      "sentence": "By next month, my parents will have been teaching the lesson.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the team will have been calling the teacher for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "They will have been practicing science since yesterday by tonight.",
      "verb": "practicing"
    },
    {
      "sentence": "The children will have been enjoying dinner since Monday by soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "By soon, john will have been driving home.",
      "verb": "driving"
    },
    {
      "sentence": "The children will have been considering the birthday since Monday by later.",
      "verb": "considering"
    },
    {
      "sentence": "By next week, the teacher will have been choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the teacher will have been visiting my family all day.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, her sister will have been sending the document for two hours.",
      "verb": "sending"
    },
    {
      "sentence": "By soon, our neighbors will have been contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, they will have been running to the park for years.",
      "verb": "running"
    },
    {
      "sentence": "Next month, we will have been reviewing French for two hours.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next week, i will have been remembering the problem.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, tom will have been repairing the computer since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, john will have been buying the keys all day.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, emma will have been fixing the computer since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By this evening, he will have been preparing a snack.",
      "verb": "preparing"
    },
    {
      "sentence": "The team will have been remembering the decision for three days by in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "By in two days, tom will have been understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, she will have been speaking the doctor for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the cat will have been enjoying coffee since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, the team will have been fixing the furniture.",
      "verb": "fixing"
    },
    {
      "sentence": "By later, her sister will have been listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, she will have been studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "By next week, john will have been reading grammar.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, the bird will have been designing the kitchen.",
      "verb": "designing"
    },
    {
      "sentence": "By this evening, the children will have been planning the future.",
      "verb": "planning"
    },
    {
      "sentence": "By soon, my friend will have been submitting the email.",
      "verb": "submitting"
    },
    {
      "sentence": "By tonight, my brother will have been teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "The bird will have been talking the manager for three days by soon.",
      "verb": "talking"
    },
    {
      "sentence": "The manager will have been flying to work all week by this weekend.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, her sister will have been writing the email all day.",
      "verb": "writing"
    },
    {
      "sentence": "By in two days, he will have been completing the presentation.",
      "verb": "completing"
    },
    {
      "sentence": "By soon, the dog will have been leaving to school.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, i will have been learning English for two hours.",
      "verb": "learning"
    },
    {
      "sentence": "By later, her sister will have been remembering the options.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the students will have been meeting the team for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, my parents will have been cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "The manager will have been walking to the beach since Monday by soon.",
      "verb": "walking"
    },
    {
      "sentence": "By next week, the dog will have been painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, my friend will have been talking the client for a week.",
      "verb": "talking"
    },
    {
      "sentence": "Emma will have been going to the store for years by this evening.",
      "verb": "going"
    },
    {
      "sentence": "He will have been starting the letter for two hours by next week.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, the company will have been enjoying a documentary since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, you will have been giving clothes.",
      "verb": "giving"
    },
    {
      "sentence": "My brother will have been drawing the car for two hours by this weekend.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the team will have been coming to the park for a month.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, the cat will have been forgetting the future since morning.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, emma will have been drinking breakfast for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "By this weekend, my friend will have been completing the task.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, our neighbors will have been watching music for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the dog will have been playing basketball all day.",
      "verb": "playing"
    },
    {
      "sentence": "By soon, the company will have been learning Spanish.",
      "verb": "learning"
    },
    {
      "sentence": "By this evening, the manager will have been selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "By in two days, he will have been receiving the proposal.",
      "verb": "receiving"
    },
    {
      "sentence": "By tomorrow, the children will have been submitting the proposal.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, my brother will have been writing the contract for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "By later, tom will have been getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "By next year, the students will have been walking to the gym.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, they will have been starting the application all week.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, john will have been choosing a book since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "Sarah will have been making soup for years by this evening.",
      "verb": "making"
    },
    {
      "sentence": "By later, the manager will have been considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "By in two days, my brother will have been cooking tea.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the company will have been getting a new car for years.",
      "verb": "getting"
    },
    {
      "sentence": "By next year, sarah will have been reviewing English.",
      "verb": "reviewing"
    },
    {
      "sentence": "By next month, the dog will have been calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "By in two days, emma will have been returning to the library.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, our neighbors will have been enjoying a sandwich for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, john will have been preparing coffee since morning.",
      "verb": "preparing"
    },
    {
      "sentence": "By tomorrow, we will have been practicing French.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, sarah will have been calling the manager all week.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, he will have been enjoying music for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, tom will have been contacting the manager for years.",
      "verb": "contacting"
    },
    {
      "sentence": "By tonight, the manager will have been planning the birthday.",
      "verb": "planning"
    },
    {
      "sentence": "By tonight, the company will have been studying the textbook.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my brother will have been learning mathematics since Monday.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the dog will have been completing the task for years.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, john will have been visiting the neighbors for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, he will have been getting a book for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "She will have been repairing the computer all week by next year.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, the company will have been running home for a week.",
      "verb": "running"
    },
    {
      "sentence": "By this weekend, our neighbors will have been enjoying breakfast.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents will have been submitting the document since morning by tonight.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, emma will have been speaking my friend since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "By in two days, the cat will have been starting the assignment.",
      "verb": "starting"
    },
    {
      "sentence": "By next week, you will have been selling clothes.",
      "verb": "selling"
    },
    {
      "sentence": "By tonight, you will have been getting a book.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, the children will have been drinking coffee all day.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat will have been driving to the office for three days by in two days.",
      "verb": "driving"
    },
    {
      "sentence": "By tomorrow, her sister will have been sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "By in two days, her sister will have been completing the presentation.",
      "verb": "completing"
    },
    {
      "sentence": "By later, tom will have been sending the presentation.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, the team will have been planning the options since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "John will have been fixing a picture for years by next week.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, i will have been listening to a documentary since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, the manager will have been watching music.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will have been reading vocabulary all day by later.",
      "verb": "reading"
    },
    {
      "sentence": "He will have been speaking my friend all day by in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors will have been learning English for a week by next month.",
      "verb": "learning"
    },
    {
      "sentence": "Our neighbors will have been remembering the options since Monday by next week.",
      "verb": "remembering"
    },
    {
      "sentence": "By next week, emma will have been returning to the beach.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, they will have been meeting the client since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the team will have been cleaning the bathroom for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By in two days, he will have been flying home.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, you will have been forgetting the problem for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, you will have been selling a book for a week.",
      "verb": "selling"
    },
    {
      "sentence": "By tonight, tom will have been considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "By next week, the company will have been choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, john will have been ordering lunch since morning.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, the team will have been receiving the assignment all week.",
      "verb": "receiving"
    },
    {
      "sentence": "Our neighbors will have been completing the letter for years by next week.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, my brother will have been flying home all day.",
      "verb": "flying"
    },
    {
      "sentence": "By this weekend, the dog will have been starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "We will have been planning the decision since yesterday by later.",
      "verb": "planning"
    },
    {
      "sentence": "By soon, my friend will have been visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, my brother will have been ordering lunch for years.",
      "verb": "ordering"
    },
    {
      "sentence": "Next month, the manager will have been meeting the teacher for years.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the cat will have been fixing the car for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher will have been completing the assignment for years by soon.",
      "verb": "completing"
    },
    {
      "sentence": "By tonight, we will have been enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "By later, my parents will have been learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the students will have been repairing the computer since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, the children will have been building the bathroom for years.",
      "verb": "building"
    },
    {
      "sentence": "Next month, you will have been going to work for a month.",
      "verb": "going"
    },
    {
      "sentence": "Next month, my parents will have been building the garden all week.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the bird will have been meeting the neighbors since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "By this evening, tom will have been drawing the kitchen.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, he will have been planning the future since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "John will have been visiting the team for a week by soon.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, they will have been completing the application since morning.",
      "verb": "completing"
    },
    {
      "sentence": "John will have been writing the proposal all week by next month.",
      "verb": "writing"
    },
    {
      "sentence": "By next month, the company will have been flying to the gym.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher will have been contacting the teacher since morning by next week.",
      "verb": "contacting"
    },
    {
      "sentence": "By this weekend, sarah will have been meeting the teacher.",
      "verb": "meeting"
    },
    {
      "sentence": "By in two days, she will have been cooking pizza.",
      "verb": "cooking"
    },
    {
      "sentence": "I will have been completing the assignment all day by next year.",
      "verb": "completing"
    },
    {
      "sentence": "We will have been drinking a sandwich for a week by in two days.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, the bird will have been finding a new car for three days.",
      "verb": "finding"
    },
    {
      "sentence": "By this weekend, he will have been listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "The students will have been walking home for two hours by tomorrow.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, emma will have been considering the situation since Monday.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, the manager will have been completing the email for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, my parents will have been finishing the report for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By soon, they will have been receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "By next month, you will have been enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team will have been watching a song for three days by next week.",
      "verb": "watching"
    },
    {
      "sentence": "By this weekend, i will have been thinking about the options.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma will have been watching TV for a month by next month.",
      "verb": "watching"
    },
    {
      "sentence": "By next month, my parents will have been drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "By tonight, the bird will have been returning downtown.",
      "verb": "returning"
    },
    {
      "sentence": "My brother will have been going downtown since yesterday by next week.",
      "verb": "going"
    },
    {
      "sentence": "By tomorrow, john will have been building a picture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the team will have been remembering the problem for years.",
      "verb": "remembering"
    },
    {
      "sentence": "By next month, my friend will have been ordering juice.",
      "verb": "ordering"
    },
    {
      "sentence": "The cat will have been eating lunch all week by next week.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the company will have been writing the application for three days.",
      "verb": "writing"
    },
    {
      "sentence": "By this weekend, the manager will have been meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "By tomorrow, the children will have been listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, my parents will have been giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "By soon, they will have been meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "By in two days, sarah will have been eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "By tomorrow, tom will have been visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, we will have been talking the boss for a week.",
      "verb": "talking"
    },
    {
      "sentence": "Our neighbors will have been flying to the airport all week by soon.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, my brother will have been watching a video all day.",
      "verb": "watching"
    },
    {
      "sentence": "By tomorrow, the bird will have been watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, you will have been teaching science all week.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, our neighbors will have been studying grammar for years.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, they will have been building the house all week.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the dog will have been selling the keys for three days.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the bird will have been thinking about the decision since yesterday.",
      "verb": "thinking"
    },
    {
      "sentence": "By this evening, her sister will have been reviewing grammar.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tom will have been cooking soup for a month by soon.",
      "verb": "cooking"
    },
    {
      "sentence": "By this weekend, the dog will have been receiving the task.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, john will have been reading mathematics since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, emma will have been calling the neighbors for three days.",
      "verb": "calling"
    },
    {
      "sentence": "She will have been choosing a gift since Monday by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "The team will have been watching basketball all day by soon.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, she will have been making a salad for three days.",
      "verb": "making"
    },
    {
      "sentence": "Next month, her sister will have been considering the future for years.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, tom will have been forgetting the event for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, we will have been watching basketball for years.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will have been reviewing French for years by next month.",
      "verb": "reviewing"
    },
    {
      "sentence": "My friend will have been thinking about the decision for three days by this evening.",
      "verb": "thinking"
    },
    {
      "sentence": "The manager will have been ordering dinner since morning by later.",
      "verb": "ordering"
    },
    {
      "sentence": "By next week, she will have been considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "By next month, the team will have been understanding history.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, my friend will have been enjoying the game for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By this weekend, emma will have been thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat will have been buying groceries since yesterday by in two days.",
      "verb": "buying"
    },
    {
      "sentence": "Sarah will have been starting the project for years by next month.",
      "verb": "starting"
    },
    {
      "sentence": "By in two days, the manager will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, they will have been buying groceries for three days.",
      "verb": "buying"
    },
    {
      "sentence": "The team will have been submitting the project since Monday by in two days.",
      "verb": "submitting"
    },
    {
      "sentence": "By this weekend, i will have been practicing French.",
      "verb": "practicing"
    },
    {
      "sentence": "John will have been returning to school since yesterday by tonight.",
      "verb": "returning"
    },
    {
      "sentence": "By tomorrow, the company will have been thinking about the problem.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the students will have been studying history since Monday.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, my parents will have been cleaning the garden since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next month, he will have been flying to the library all day.",
      "verb": "flying"
    },
    {
      "sentence": "The cat will have been starting the report all day by tomorrow.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, the team will have been contacting the manager for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "By in two days, the company will have been giving a gift.",
      "verb": "giving"
    },
    {
      "sentence": "By tomorrow, the children will have been receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "My brother will have been planning the problem all day by later.",
      "verb": "planning"
    },
    {
      "sentence": "They will have been sending the proposal since morning by tonight.",
      "verb": "sending"
    },
    {
      "sentence": "Next month, i will have been cooking soup since morning.",
      "verb": "cooking"
    },
    {
      "sentence": "By soon, her sister will have been cleaning a picture.",
      "verb": "cleaning"
    },
    {
      "sentence": "Our neighbors will have been listening to football since yesterday by next month.",
      "verb": "listening"
    },
    {
      "sentence": "By next week, they will have been receiving the assignment.",
      "verb": "receiving"
    },
    {
      "sentence": "The teacher will have been repairing the computer all day by later.",
      "verb": "repairing"
    },
    {
      "sentence": "By later, he will have been remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, our neighbors will have been meeting the manager for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "By this evening, the cat will have been understanding grammar.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, her sister will have been visiting my friend for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, we will have been walking to school since yesterday.",
      "verb": "walking"
    },
    {
      "sentence": "Tom will have been reading the textbook since morning by soon.",
      "verb": "reading"
    },
    {
      "sentence": "You will have been considering the meeting since morning by tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, the teacher will have been finishing the report for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, we will have been reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "By this evening, the teacher will have been finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher will have been getting the keys since morning by tonight.",
      "verb": "getting"
    },
    {
      "sentence": "Her sister will have been going to the market since morning by in two days.",
      "verb": "going"
    },
    {
      "sentence": "By this weekend, emma will have been talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "By this weekend, the dog will have been building the car.",
      "verb": "building"
    },
    {
      "sentence": "By this evening, they will have been calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "By this evening, the students will have been listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "We will have been coming home for a week by this evening.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, i will have been calling the manager all week.",
      "verb": "calling"
    },
    {
      "sentence": "By later, the dog will have been eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the company will have been meeting the boss for years.",
      "verb": "meeting"
    },
    {
      "sentence": "By in two days, you will have been teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the dog will have been walking to work since yesterday.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, the children will have been repairing a website for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma will have been drawing the kitchen since yesterday by soon.",
      "verb": "drawing"
    },
    {
      "sentence": "By in two days, i will have been visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "By in two days, we will have been fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "By later, the teacher will have been finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, you will have been learning the chapter for three days.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the cat will have been watching TV all day.",
      "verb": "watching"
    },
    {
      "sentence": "My brother will have been listening to football all day by tonight.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, we will have been forgetting the event.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next week, she will have been watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "By this weekend, he will have been meeting the teacher.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, the students will have been writing the presentation since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "You will have been drawing the garden for two hours by tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, we will have been starting the proposal for a week.",
      "verb": "starting"
    },
    {
      "sentence": "Our neighbors will have been speaking my family for years by in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the children will have been speaking the neighbors since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "They will have been writing the presentation for years by in two days.",
      "verb": "writing"
    },
    {
      "sentence": "By tomorrow, the manager will have been completing the presentation.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the cat will have been making pizza for three days.",
      "verb": "making"
    },
    {
      "sentence": "John will have been playing a podcast all week by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the students will have been giving clothes all week.",
      "verb": "giving"
    },
    {
      "sentence": "By next week, he will have been playing TV.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, tom will have been sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "He will have been designing the garden since Monday by in two days.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, he will have been practicing science since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "She will have been forgetting the trip all week by next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, we will have been walking to the office.",
      "verb": "walking"
    },
    {
      "sentence": "The manager will have been finding a laptop for two hours by next month.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, the dog will have been listening to the news for a month.",
      "verb": "listening"
    },
    {
      "sentence": "I will have been choosing a gift since morning by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "He will have been eating lunch for a week by this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will have been teaching grammar since yesterday by this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, i will have been finding groceries for two hours.",
      "verb": "finding"
    },
    {
      "sentence": "Emma will have been returning to the library since Monday by soon.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, the students will have been starting the letter.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, the students will have been selling a present since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "By next year, the children will have been making coffee.",
      "verb": "making"
    },
    {
      "sentence": "The manager will have been choosing a gift for years by next week.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird will have been speaking the client since Monday by tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the children will have been making lunch for three days.",
      "verb": "making"
    },
    {
      "sentence": "Next month, tom will have been arriving to the store since morning.",
      "verb": "arriving"
    },
    {
      "sentence": "The manager will have been planning the options for a month by soon.",
      "verb": "planning"
    },
    {
      "sentence": "By next year, the company will have been leaving to the store.",
      "verb": "leaving"
    },
    {
      "sentence": "By next week, our neighbors will have been building a picture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the manager will have been learning science all week.",
      "verb": "learning"
    },
    {
      "sentence": "The team will have been coming to the library for three days by next year.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, she will have been visiting my family all day.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, they will have been walking to the beach all day.",
      "verb": "walking"
    },
    {
      "sentence": "By later, the teacher will have been reading for the exam.",
      "verb": "reading"
    },
    {
      "sentence": "By soon, sarah will have been leaving home.",
      "verb": "leaving"
    },
    {
      "sentence": "By tomorrow, my parents will have been speaking my family.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, the team will have been driving to the office.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, the dog will have been visiting the manager for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, they will have been remembering the meeting for years.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, they will have been drawing the car for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "The company will have been buying the phone for a month by this weekend.",
      "verb": "buying"
    },
    {
      "sentence": "By this evening, the cat will have been watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, our neighbors will have been listening to a video for a week.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will have been thinking about the event all day by in two days.",
      "verb": "thinking"
    },
    {
      "sentence": "Tom will have been preparing lunch since Monday by later.",
      "verb": "preparing"
    },
    {
      "sentence": "My brother will have been receiving the letter for a week by next year.",
      "verb": "receiving"
    },
    {
      "sentence": "By next year, the bird will have been studying history.",
      "verb": "studying"
    },
    {
      "sentence": "My friend will have been choosing a new car all week by tonight.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, he will have been talking the manager for a month.",
      "verb": "talking"
    },
    {
      "sentence": "By later, the students will have been submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "By tomorrow, the company will have been playing a podcast.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will have been designing the house for a month by later.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, the manager will have been selling flowers since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, emma will have been giving a book for a month.",
      "verb": "giving"
    },
    {
      "sentence": "Emma will have been studying mathematics all day by tonight.",
      "verb": "studying"
    },
    {
      "sentence": "The children will have been watching a video for a week by next week.",
      "verb": "watching"
    },
    {
      "sentence": "By this evening, the company will have been coming downtown.",
      "verb": "coming"
    },
    {
      "sentence": "We will have been visiting the neighbors all week by in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog will have been enjoying pasta for three days by this evening.",
      "verb": "enjoying"
    },
    {
      "sentence": "He will have been finding groceries for a month by next year.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, sarah will have been sending the report since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "My brother will have been giving a present for a week by next year.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher will have been selling clothes all day by next year.",
      "verb": "selling"
    },
    {
      "sentence": "We will have been playing TV since Monday by soon.",
      "verb": "playing"
    },
    {
      "sentence": "By next week, the dog will have been sending the proposal.",
      "verb": "sending"
    },
    {
      "sentence": "By this weekend, the bird will have been enjoying a song.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next week, the teacher will have been designing the garden.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, the teacher will have been buying the phone for three days.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, the bird will have been playing tennis for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will have been listening to a podcast for a month by soon.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the dog will have been making a salad all day.",
      "verb": "making"
    },
    {
      "sentence": "The manager will have been planning the problem since yesterday by tomorrow.",
      "verb": "planning"
    },
    {
      "sentence": "Tom will have been driving to the office for a month by in two days.",
      "verb": "driving"
    },
    {
      "sentence": "By next year, my friend will have been speaking my friend.",
      "verb": "speaking"
    },
    {
      "sentence": "By this evening, her sister will have been returning to the market.",
      "verb": "returning"
    },
    {
      "sentence": "Next month, we will have been repairing the bathroom all day.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher will have been arriving to work since Monday by next month.",
      "verb": "arriving"
    },
    {
      "sentence": "The children will have been reviewing English since yesterday by later.",
      "verb": "reviewing"
    },
    {
      "sentence": "By tonight, i will have been calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "By later, they will have been remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, she will have been enjoying a documentary all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the students will have been thinking about the future for two hours.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the bird will have been designing a picture since morning.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, her sister will have been getting a present for a week.",
      "verb": "getting"
    },
    {
      "sentence": "By tomorrow, the cat will have been calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "By later, the company will have been talking my family.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, we will have been building the bathroom for three days.",
      "verb": "building"
    },
    {
      "sentence": "By soon, her sister will have been preparing pizza.",
      "verb": "preparing"
    },
    {
      "sentence": "By in two days, my friend will have been walking to the beach.",
      "verb": "walking"
    },
    {
      "sentence": "The students will have been building the bathroom for two hours by later.",
      "verb": "building"
    },
    {
      "sentence": "By later, the cat will have been teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog will have been listening to a video since Monday by next year.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, she will have been cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog will have been calling the neighbors since yesterday by tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "I will have been calling the doctor since Monday by next year.",
      "verb": "calling"
    },
    {
      "sentence": "The team will have been choosing the keys since yesterday by next year.",
      "verb": "choosing"
    },
    {
      "sentence": "By this evening, they will have been learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, he will have been drawing the bathroom for a week.",
      "verb": "drawing"
    },
    {
      "sentence": "By tonight, my brother will have been leaving to the beach.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, emma will have been cooking dinner for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the company will have been submitting the assignment for two hours.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the dog will have been thinking about the situation all week.",
      "verb": "thinking"
    },
    {
      "sentence": "The dog will have been starting the proposal all day by in two days.",
      "verb": "starting"
    },
    {
      "sentence": "By soon, sarah will have been submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "She will have been finding a gift for three days by in two days.",
      "verb": "finding"
    },
    {
      "sentence": "By tomorrow, the children will have been reading grammar.",
      "verb": "reading"
    },
    {
      "sentence": "By tomorrow, you will have been leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "The manager will have been finishing the task all week by tonight.",
      "verb": "finishing"
    },
    {
      "sentence": "The bird will have been talking the boss for a month by this evening.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, the children will have been finishing the report for a week.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the children will have been studying the lesson all week.",
      "verb": "studying"
    },
    {
      "sentence": "The company will have been teaching science since Monday by this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "By tonight, he will have been getting the keys.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, the children will have been flying to the store since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "By next month, the team will have been meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, he will have been playing tennis for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The students will have been forgetting the decision for three days by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the cat will have been remembering the trip since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, my brother will have been thinking about the trip all week.",
      "verb": "thinking"
    },
    {
      "sentence": "By this weekend, he will have been walking to the store.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, sarah will have been receiving the document for years.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, sarah will have been thinking about the situation for two hours.",
      "verb": "thinking"
    },
    {
      "sentence": "By later, the children will have been eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "Emma will have been reading science all week by later.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, the dog will have been fixing the computer all week.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, i will have been enjoying dinner since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "She will have been giving groceries all week by soon.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, they will have been practicing for the exam for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat will have been learning mathematics since morning by next week.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the students will have been planning the future for three days.",
      "verb": "planning"
    },
    {
      "sentence": "Emma will have been speaking the teacher for a week by in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "By tomorrow, my brother will have been visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "The team will have been making coffee all day by soon.",
      "verb": "making"
    },
    {
      "sentence": "By in two days, my brother will have been playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "By tonight, we will have been drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will have been drawing the house for a week by this weekend.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the children will have been playing a documentary all week.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the team will have been enjoying a snack for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "By in two days, the cat will have been reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "Next month, my friend will have been learning French for a month.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the teacher will have been listening to a podcast for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, my friend will have been speaking the teacher.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the manager will have been remembering the trip since morning.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat will have been ordering breakfast for three days by next year.",
      "verb": "ordering"
    },
    {
      "sentence": "By this weekend, the team will have been practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher will have been completing the email for years by this evening.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the company will have been starting the application since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "By in two days, i will have been fixing the house.",
      "verb": "fixing"
    },
    {
      "sentence": "By in two days, emma will have been calling the teacher.",
      "verb": "calling"
    },
    {
      "sentence": "By next year, our neighbors will have been walking to the beach.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, the manager will have been flying home for a week.",
      "verb": "flying"
    },
    {
      "sentence": "By tonight, my friend will have been teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "The teacher will have been teaching history since morning by next week.",
      "verb": "teaching"
    },
    {
      "sentence": "By this evening, she will have been calling the neighbors.",
      "verb": "calling"
    },
    {
      "sentence": "The cat will have been designing the car since yesterday by soon.",
      "verb": "designing"
    },
    {
      "sentence": "By in two days, he will have been calling my family.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, he will have been understanding mathematics since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog will have been studying English since morning by next year.",
      "verb": "studying"
    },
    {
      "sentence": "By this weekend, tom will have been drinking breakfast.",
      "verb": "drinking"
    },
    {
      "sentence": "By in two days, my parents will have been eating tea.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the dog will have been preparing a snack all week.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, her sister will have been cooking coffee all week.",
      "verb": "cooking"
    },
    {
      "sentence": "By in two days, emma will have been enjoying soup.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tonight, the children will have been submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "The team will have been fixing a website all week by this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "By in two days, tom will have been forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "By later, the children will have been painting the furniture.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, our neighbors will have been playing a podcast for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By in two days, my brother will have been enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "The students will have been listening to music since yesterday by in two days.",
      "verb": "listening"
    },
    {
      "sentence": "By in two days, her sister will have been starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "By next week, the bird will have been enjoying the game.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tomorrow, the company will have been driving to the gym.",
      "verb": "driving"
    },
    {
      "sentence": "By this evening, john will have been walking to the market.",
      "verb": "walking"
    },
    {
      "sentence": "By next month, our neighbors will have been learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, the company will have been finishing the letter for years.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the students will have been visiting the client for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By tonight, sarah will have been remembering the options.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the bird will have been going to the office for a week.",
      "verb": "going"
    },
    {
      "sentence": "Next month, tom will have been playing TV for years.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, the teacher will have been playing a podcast.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the teacher will have been cleaning the garden for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "The manager will have been painting a picture all day by this evening.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, you will have been listening to tennis for years.",
      "verb": "listening"
    },
    {
      "sentence": "By this evening, my friend will have been starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, my brother will have been speaking my friend for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents will have been remembering the trip all day by tonight.",
      "verb": "remembering"
    },
    {
      "sentence": "The team will have been finding a gift since yesterday by tomorrow.",
      "verb": "finding"
    },
    {
      "sentence": "Sarah will have been coming to the library for years by next month.",
      "verb": "coming"
    },
    {
      "sentence": "Our neighbors will have been calling the client all day by this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, her sister will have been studying science since yesterday.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, her sister will have been understanding for the exam all week.",
      "verb": "understanding"
    },
    {
      "sentence": "By next week, the teacher will have been leaving to the store.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, the team will have been visiting my parents all day.",
      "verb": "visiting"
    },
    {
      "sentence": "By soon, we will have been practicing the lesson.",
      "verb": "practicing"
    },
    {
      "sentence": "By tomorrow, i will have been teaching grammar.",
      "verb": "teaching"
    },
    {
      "sentence": "He will have been enjoying a documentary since Monday by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "We will have been planning the birthday since morning by in two days.",
      "verb": "planning"
    },
    {
      "sentence": "Next month, we will have been speaking the client since morning.",
      "verb": "speaking"
    },
    {
      "sentence": "By this weekend, our neighbors will have been studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "Next month, i will have been considering the vacation for a week.",
      "verb": "considering"
    },
    {
      "sentence": "I will have been repairing the furniture since yesterday by soon.",
      "verb": "repairing"
    },
    {
      "sentence": "By next month, we will have been planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "By this evening, the bird will have been reviewing science.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, my friend will have been forgetting the future for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "You will have been submitting the contract since morning by next year.",
      "verb": "submitting"
    },
    {
      "sentence": "The children will have been drinking breakfast all day by soon.",
      "verb": "drinking"
    },
    {
      "sentence": "By soon, the dog will have been choosing clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, tom will have been preparing juice since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, you will have been running to school all week.",
      "verb": "running"
    },
    {
      "sentence": "Next month, the team will have been finishing the report since Monday.",
      "verb": "finishing"
    },
    {
      "sentence": "By tonight, the cat will have been drawing the computer.",
      "verb": "drawing"
    },
    {
      "sentence": "Next month, the students will have been fixing the car since Monday.",
      "verb": "fixing"
    },
    {
      "sentence": "Sarah will have been playing football since Monday by this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "You will have been choosing a new car since Monday by tonight.",
      "verb": "choosing"
    },
    {
      "sentence": "By next year, you will have been enjoying a snack.",
      "verb": "enjoying"
    },
    {
      "sentence": "The manager will have been building the house all day by next week.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the manager will have been drinking lunch since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "Next month, i will have been planning the trip since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "The company will have been getting a book for three days by tonight.",
      "verb": "getting"
    },
    {
      "sentence": "We will have been meeting the doctor for two hours by in two days.",
      "verb": "meeting"
    },
    {
      "sentence": "By next month, tom will have been starting the task.",
      "verb": "starting"
    },
    {
      "sentence": "By tonight, the company will have been contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents will have been listening to tennis for years by this evening.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, emma will have been contacting the doctor for years.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will have been getting the keys for three days by soon.",
      "verb": "getting"
    },
    {
      "sentence": "Next month, you will have been eating pizza all week.",
      "verb": "eating"
    },
    {
      "sentence": "By next week, she will have been leaving to the airport.",
      "verb": "leaving"
    },
    {
      "sentence": "Next month, tom will have been practicing English since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "Next month, the teacher will have been making pizza all week.",
      "verb": "making"
    },
    {
      "sentence": "By soon, the children will have been enjoying a sandwich.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will have been completing the proposal for years.",
      "verb": "completing"
    },
    {
      "sentence": "John will have been returning to the airport since morning by next month.",
      "verb": "returning"
    },
    {
      "sentence": "By this evening, they will have been arriving downtown.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, you will have been painting the furniture for a month.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, she will have been finishing the report for a month.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, the students will have been fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "By next week, my parents will have been studying the chapter.",
      "verb": "studying"
    },
    {
      "sentence": "Emma will have been drinking a salad for two hours by this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will have been completing the proposal for a month by in two days.",
      "verb": "completing"
    },
    {
      "sentence": "By soon, the dog will have been playing football.",
      "verb": "playing"
    },
    {
      "sentence": "By this weekend, they will have been repairing the garden.",
      "verb": "repairing"
    },
    {
      "sentence": "Next month, the cat will have been fixing a picture since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "The manager will have been forgetting the future for two hours by in two days.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, he will have been fixing the room for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "By next week, the teacher will have been teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "By this evening, her sister will have been selling the ticket.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, my friend will have been eating a snack for three days.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the children will have been planning the decision for a month.",
      "verb": "planning"
    },
    {
      "sentence": "My friend will have been giving a present all day by this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the teacher will have been starting the report for years.",
      "verb": "starting"
    },
    {
      "sentence": "By this evening, sarah will have been drinking lunch.",
      "verb": "drinking"
    },
    {
      "sentence": "I will have been watching a podcast for a month by this evening.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, my parents will have been contacting my parents for a month.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the children will have been receiving the report for two hours.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the students will have been studying for the exam since yesterday.",
      "verb": "studying"
    },
    {
      "sentence": "By next week, her sister will have been running to the market.",
      "verb": "running"
    },
    {
      "sentence": "By later, the team will have been enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next year, our neighbors will have been submitting the email.",
      "verb": "submitting"
    },
    {
      "sentence": "By next week, emma will have been making coffee.",
      "verb": "making"
    },
    {
      "sentence": "By in two days, she will have been understanding history.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, you will have been watching a song since morning.",
      "verb": "watching"
    },
    {
      "sentence": "They will have been driving to school since morning by tonight.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, the teacher will have been selling a new car since morning.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, the students will have been choosing a present for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the company will have been playing a video for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By tomorrow, john will have been practicing vocabulary.",
      "verb": "practicing"
    },
    {
      "sentence": "She will have been enjoying tea for three days by next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom will have been cooking juice for a week by next year.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, our neighbors will have been considering the future since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "The cat will have been receiving the letter for two hours by in two days.",
      "verb": "receiving"
    },
    {
      "sentence": "By next year, john will have been watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "By next week, he will have been studying history.",
      "verb": "studying"
    },
    {
      "sentence": "By later, emma will have been painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "The company will have been enjoying a documentary all day by later.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tonight, they will have been visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "Next month, he will have been submitting the presentation since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "By this evening, the cat will have been considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By this weekend, john will have been coming to the library.",
      "verb": "coming"
    },
    {
      "sentence": "By next year, you will have been repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "By tonight, my friend will have been learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "He will have been going to the airport for two hours by tomorrow.",
      "verb": "going"
    },
    {
      "sentence": "By tonight, the children will have been eating coffee.",
      "verb": "eating"
    },
    {
      "sentence": "He will have been forgetting the trip all week by this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, my parents will have been selling flowers all day.",
      "verb": "selling"
    },
    {
      "sentence": "The team will have been flying to school since morning by this evening.",
      "verb": "flying"
    },
    {
      "sentence": "The children will have been understanding science for two hours by tomorrow.",
      "verb": "understanding"
    },
    {
      "sentence": "By in two days, the cat will have been finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "By next week, the teacher will have been calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "They will have been arriving to the airport since morning by tonight.",
      "verb": "arriving"
    },
    {
      "sentence": "By in two days, tom will have been thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "The children will have been coming to the store for years by next year.",
      "verb": "coming"
    },
    {
      "sentence": "By soon, the cat will have been playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "By next month, you will have been receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "Next month, the children will have been returning to school for three days.",
      "verb": "returning"
    },
    {
      "sentence": "Her sister will have been meeting my family since morning by later.",
      "verb": "meeting"
    },
    {
      "sentence": "Next month, you will have been designing the bathroom for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "By this weekend, he will have been going to the gym.",
      "verb": "going"
    },
    {
      "sentence": "By next year, the teacher will have been sending the contract.",
      "verb": "sending"
    },
    {
      "sentence": "The team will have been remembering the event for a week by this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, my parents will have been reading history all week.",
      "verb": "reading"
    },
    {
      "sentence": "By in two days, the students will have been thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "The company will have been designing the furniture for a week by this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "Tom will have been learning the textbook since yesterday by in two days.",
      "verb": "learning"
    },
    {
      "sentence": "By next week, her sister will have been considering the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister will have been enjoying the news for three days by this evening.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, he will have been preparing lunch for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "By next week, john will have been buying the phone.",
      "verb": "buying"
    },
    {
      "sentence": "I will have been getting the keys since yesterday by this weekend.",
      "verb": "getting"
    },
    {
      "sentence": "John will have been driving to work since morning by next week.",
      "verb": "driving"
    },
    {
      "sentence": "By this evening, you will have been enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "By tonight, we will have been submitting the contract.",
      "verb": "submitting"
    },
    {
      "sentence": "By tonight, sarah will have been cooking coffee.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the dog will have been thinking about the trip for years.",
      "verb": "thinking"
    },
    {
      "sentence": "My friend will have been writing the proposal for two hours by tonight.",
      "verb": "writing"
    },
    {
      "sentence": "The manager will have been giving the ticket all day by later.",
      "verb": "giving"
    },
    {
      "sentence": "Tom will have been designing the garden since morning by this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "By this evening, the students will have been planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "We will have been flying to school since morning by next year.",
      "verb": "flying"
    },
    {
      "sentence": "Next month, the company will have been giving the ticket for three days.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, the children will have been arriving downtown since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "Next month, emma will have been finishing the assignment for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By next month, she will have been coming to the store.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, she will have been returning to the airport all day.",
      "verb": "returning"
    },
    {
      "sentence": "By tonight, sarah will have been building the furniture.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the company will have been completing the presentation for a week.",
      "verb": "completing"
    },
    {
      "sentence": "The bird will have been talking the manager since yesterday by tomorrow.",
      "verb": "talking"
    },
    {
      "sentence": "Sarah will have been drinking dinner for two hours by next month.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog will have been submitting the proposal since Monday by this weekend.",
      "verb": "submitting"
    },
    {
      "sentence": "By soon, sarah will have been listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "The team will have been visiting my parents for two hours by later.",
      "verb": "visiting"
    },
    {
      "sentence": "By next year, you will have been giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "By in two days, her sister will have been completing the assignment.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, sarah will have been finishing the project for a week.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, the students will have been talking the client for a month.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will have been finishing the task since yesterday by soon.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, my brother will have been writing the assignment since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "You will have been choosing the ticket all day by soon.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, my friend will have been eating lunch since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, they will have been teaching Spanish for three days.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog will have been choosing a present all week by next month.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother will have been drinking coffee since morning by next year.",
      "verb": "drinking"
    },
    {
      "sentence": "By this weekend, the bird will have been considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "The team will have been drawing the kitchen all week by tomorrow.",
      "verb": "drawing"
    },
    {
      "sentence": "By tomorrow, the bird will have been watching football.",
      "verb": "watching"
    },
    {
      "sentence": "By soon, my parents will have been flying downtown.",
      "verb": "flying"
    },
    {
      "sentence": "The cat will have been contacting the neighbors for a month by tonight.",
      "verb": "contacting"
    },
    {
      "sentence": "By later, you will have been calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "Our neighbors will have been playing tennis all week by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "She will have been getting a gift since Monday by in two days.",
      "verb": "getting"
    },
    {
      "sentence": "Her sister will have been completing the application all week by next month.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, the students will have been forgetting the situation since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "By later, he will have been finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "By this weekend, she will have been thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "By next month, the company will have been learning English.",
      "verb": "learning"
    },
    {
      "sentence": "By next month, my parents will have been reading French.",
      "verb": "reading"
    },
    {
      "sentence": "By next month, the cat will have been teaching English.",
      "verb": "teaching"
    },
    {
      "sentence": "You will have been returning to the gym for three days by this evening.",
      "verb": "returning"
    },
    {
      "sentence": "By next week, my parents will have been visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "My friend will have been enjoying a movie for a week by this weekend.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will have been walking downtown for three days.",
      "verb": "walking"
    },
    {
      "sentence": "Next month, my parents will have been getting a new car since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "By this evening, sarah will have been choosing a laptop.",
      "verb": "choosing"
    },
    {
      "sentence": "The manager will have been remembering the event all day by this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "By tonight, the cat will have been preparing coffee.",
      "verb": "preparing"
    },
    {
      "sentence": "By this weekend, the children will have been considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, they will have been enjoying the news since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By next week, tom will have been enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "The cat will have been thinking about the event for three days by in two days.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the cat will have been considering the birthday since Monday.",
      "verb": "considering"
    },
    {
      "sentence": "By this evening, our neighbors will have been visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog will have been listening to a podcast since morning by later.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will have been walking to the market for years by next year.",
      "verb": "walking"
    },
    {
      "sentence": "You will have been starting the letter since yesterday by next year.",
      "verb": "starting"
    },
    {
      "sentence": "Next month, he will have been leaving to the park all day.",
      "verb": "leaving"
    },
    {
      "sentence": "By this weekend, john will have been finishing the document.",
      "verb": "finishing"
    },
    {
      "sentence": "They will have been playing basketball for years by this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will have been sending the letter for a month by soon.",
      "verb": "sending"
    },
    {
      "sentence": "Emma will have been eating a snack for two hours by next month.",
      "verb": "eating"
    },
    {
      "sentence": "By next week, emma will have been speaking the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, john will have been making pizza since morning.",
      "verb": "making"
    },
    {
      "sentence": "Tom will have been playing basketball since Monday by in two days.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, her sister will have been talking the neighbors for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "You will have been reading the lesson for a week by this evening.",
      "verb": "reading"
    },
    {
      "sentence": "You will have been ordering juice since yesterday by this evening.",
      "verb": "ordering"
    },
    {
      "sentence": "By next year, we will have been selling a book.",
      "verb": "selling"
    },
    {
      "sentence": "By later, the children will have been preparing pasta.",
      "verb": "preparing"
    },
    {
      "sentence": "Next month, i will have been thinking about the event since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the cat will have been giving the keys since Monday.",
      "verb": "giving"
    },
    {
      "sentence": "By this evening, the children will have been coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "My friend will have been giving a gift for a month by in two days.",
      "verb": "giving"
    },
    {
      "sentence": "Tom will have been running to school for a week by tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "The dog will have been enjoying a salad for a week by tonight.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, our neighbors will have been buying groceries for three days.",
      "verb": "buying"
    },
    {
      "sentence": "They will have been running home for a month by next month.",
      "verb": "running"
    },
    {
      "sentence": "Next month, we will have been cleaning a picture for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "By in two days, sarah will have been talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "The company will have been drinking pasta for a week by tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend will have been writing the document all day by next year.",
      "verb": "writing"
    },
    {
      "sentence": "Emma will have been receiving the proposal for years by next week.",
      "verb": "receiving"
    },
    {
      "sentence": "By this evening, emma will have been submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, the team will have been thinking about the options since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, the cat will have been preparing pizza for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister will have been teaching science for a month by tomorrow.",
      "verb": "teaching"
    },
    {
      "sentence": "The students will have been remembering the vacation for a week by this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the cat will have been learning science for years.",
      "verb": "learning"
    },
    {
      "sentence": "The cat will have been drinking tea for years by this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents will have been learning vocabulary for years by tonight.",
      "verb": "learning"
    },
    {
      "sentence": "Sarah will have been calling the doctor for two hours by in two days.",
      "verb": "calling"
    },
    {
      "sentence": "By tonight, the cat will have been remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the cat will have been thinking about the meeting since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "My parents will have been forgetting the vacation for a week by tomorrow.",
      "verb": "forgetting"
    },
    {
      "sentence": "By next month, the children will have been completing the application.",
      "verb": "completing"
    },
    {
      "sentence": "Next month, they will have been repairing a picture all day.",
      "verb": "repairing"
    },
    {
      "sentence": "The children will have been driving to the gym for a month by this evening.",
      "verb": "driving"
    },
    {
      "sentence": "He will have been practicing grammar all week by this evening.",
      "verb": "practicing"
    },
    {
      "sentence": "The students will have been planning the trip for a month by next month.",
      "verb": "planning"
    },
    {
      "sentence": "By next week, the children will have been preparing dinner.",
      "verb": "preparing"
    }
  ]
}