{
  "tense": "Future Continuous",
  "description": "Used for actions that will be in progress at a specific time in the future",
  "examples": [
    {
      "sentence": "At this time tomorrow, the dog will be visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time next month, my parents will be reviewing mathematics.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next week, she will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom will be visiting the boss in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "Soon, her sister will be watching music.",
      "verb": "watching"
    },
    {
      "sentence": "The team will be enjoying a video next month.",
      "verb": "enjoying"
    },
    {
      "sentence": "My friend will be eating a sandwich next month.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next year, i will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "At this time soon, my brother will be completing the assignment.",
      "verb": "completing"
    },
    {
      "sentence": "Tomorrow, the bird will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "My parents will be remembering the meeting this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "Tomorrow, the manager will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "This weekend, emma will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors will be choosing flowers next year.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors will be building the garden next week.",
      "verb": "building"
    },
    {
      "sentence": "At this time this evening, the team will be building the house.",
      "verb": "building"
    },
    {
      "sentence": "The teacher will be speaking the boss next month.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, they will be repairing the furniture.",
      "verb": "repairing"
    },
    {
      "sentence": "This evening, tom will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "We will be writing the assignment soon.",
      "verb": "writing"
    },
    {
      "sentence": "The teacher will be returning to the park soon.",
      "verb": "returning"
    },
    {
      "sentence": "Soon, you will be finishing the task.",
      "verb": "finishing"
    },
    {
      "sentence": "The teacher will be cleaning a website in two days.",
      "verb": "cleaning"
    },
    {
      "sentence": "I will be talking my family this evening.",
      "verb": "talking"
    },
    {
      "sentence": "At this time next week, the teacher will be finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "Tomorrow, the company will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, her sister will be going to the gym.",
      "verb": "going"
    },
    {
      "sentence": "At this time this evening, the cat will be practicing mathematics.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tonight, she will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "At this time later, my parents will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "The company will be returning to work soon.",
      "verb": "returning"
    },
    {
      "sentence": "At this time next year, the children will be preparing tea.",
      "verb": "preparing"
    },
    {
      "sentence": "This weekend, he will be choosing the phone.",
      "verb": "choosing"
    },
    {
      "sentence": "We will be remembering the meeting next week.",
      "verb": "remembering"
    },
    {
      "sentence": "This weekend, the students will be finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "Tomorrow, my friend will be listening to TV.",
      "verb": "listening"
    },
    {
      "sentence": "Later, our neighbors will be studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next week, you will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "At this time soon, the children will be buying groceries.",
      "verb": "buying"
    },
    {
      "sentence": "The company will be understanding French next month.",
      "verb": "understanding"
    },
    {
      "sentence": "This weekend, you will be speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "This weekend, the cat will be giving flowers.",
      "verb": "giving"
    },
    {
      "sentence": "My parents will be listening to TV this evening.",
      "verb": "listening"
    },
    {
      "sentence": "This weekend, sarah will be meeting the team.",
      "verb": "meeting"
    },
    {
      "sentence": "Tonight, john will be playing a documentary.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the manager will be teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time tomorrow, emma will be playing football.",
      "verb": "playing"
    },
    {
      "sentence": "Soon, emma will be enjoying a salad.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tonight, my friend will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tonight, i will be reviewing history.",
      "verb": "reviewing"
    },
    {
      "sentence": "John will be drinking tea later.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, she will be receiving the application.",
      "verb": "receiving"
    },
    {
      "sentence": "You will be preparing a salad this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "We will be watching music next year.",
      "verb": "watching"
    },
    {
      "sentence": "Next year, the children will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "This evening, her sister will be finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "Sarah will be drawing the room soon.",
      "verb": "drawing"
    },
    {
      "sentence": "Emma will be starting the project later.",
      "verb": "starting"
    },
    {
      "sentence": "Tonight, i will be designing the computer.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tomorrow, they will be studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "At this time in two days, he will be running to work.",
      "verb": "running"
    },
    {
      "sentence": "At this time in two days, my friend will be planning the vacation.",
      "verb": "planning"
    },
    {
      "sentence": "At this time tomorrow, the cat will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother will be buying clothes in two days.",
      "verb": "buying"
    },
    {
      "sentence": "She will be watching music this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, sarah will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "Tomorrow, the manager will be meeting my parents.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog will be buying the phone this weekend.",
      "verb": "buying"
    },
    {
      "sentence": "The company will be cleaning a picture in two days.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time in two days, sarah will be sending the report.",
      "verb": "sending"
    },
    {
      "sentence": "The children will be reviewing history tomorrow.",
      "verb": "reviewing"
    },
    {
      "sentence": "My friend will be playing a documentary tonight.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, i will be fixing the kitchen.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time next week, the team will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "Soon, emma will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "This evening, the children will be enjoying tea.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next week, you will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, i will be talking the manager.",
      "verb": "talking"
    },
    {
      "sentence": "He will be practicing mathematics later.",
      "verb": "practicing"
    },
    {
      "sentence": "Next year, the children will be ordering breakfast.",
      "verb": "ordering"
    },
    {
      "sentence": "Next week, the teacher will be submitting the report.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time tonight, you will be making a snack.",
      "verb": "making"
    },
    {
      "sentence": "She will be completing the document tomorrow.",
      "verb": "completing"
    },
    {
      "sentence": "Soon, the team will be finding the keys.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, the children will be sending the project.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next year, emma will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "In two days, the teacher will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "At this time next year, the dog will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next year, her sister will be understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "Our neighbors will be visiting my parents in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors will be ordering a salad next year.",
      "verb": "ordering"
    },
    {
      "sentence": "My brother will be remembering the birthday tomorrow.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, the children will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, her sister will be enjoying music.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time later, you will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be remembering the meeting in two days.",
      "verb": "remembering"
    },
    {
      "sentence": "He will be buying the keys this evening.",
      "verb": "buying"
    },
    {
      "sentence": "Soon, the teacher will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "Next month, the cat will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "The cat will be writing the presentation next month.",
      "verb": "writing"
    },
    {
      "sentence": "This weekend, the team will be playing music.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, sarah will be flying to the library.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next year, the teacher will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next week, i will be learning English.",
      "verb": "learning"
    },
    {
      "sentence": "Next week, my friend will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "Emma will be flying to the gym soon.",
      "verb": "flying"
    },
    {
      "sentence": "My brother will be talking the doctor this weekend.",
      "verb": "talking"
    },
    {
      "sentence": "At this time next month, tom will be remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, my parents will be speaking the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, john will be choosing the phone.",
      "verb": "choosing"
    },
    {
      "sentence": "Sarah will be selling a gift this evening.",
      "verb": "selling"
    },
    {
      "sentence": "Next month, emma will be speaking the team.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tomorrow, the teacher will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "At this time in two days, the bird will be learning for the exam.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next year, her sister will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "Soon, sarah will be learning history.",
      "verb": "learning"
    },
    {
      "sentence": "At this time tomorrow, the dog will be forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "She will be considering the options tomorrow.",
      "verb": "considering"
    },
    {
      "sentence": "Tonight, the children will be considering the problem.",
      "verb": "considering"
    },
    {
      "sentence": "The manager will be remembering the problem tonight.",
      "verb": "remembering"
    },
    {
      "sentence": "Her sister will be returning to the office soon.",
      "verb": "returning"
    },
    {
      "sentence": "You will be sending the document later.",
      "verb": "sending"
    },
    {
      "sentence": "At this time soon, the children will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "You will be forgetting the problem in two days.",
      "verb": "forgetting"
    },
    {
      "sentence": "Soon, my friend will be learning French.",
      "verb": "learning"
    },
    {
      "sentence": "The team will be listening to a video tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, our neighbors will be studying science.",
      "verb": "studying"
    },
    {
      "sentence": "Tonight, you will be cleaning the computer.",
      "verb": "cleaning"
    },
    {
      "sentence": "Tom will be considering the trip tonight.",
      "verb": "considering"
    },
    {
      "sentence": "The teacher will be reviewing the textbook next week.",
      "verb": "reviewing"
    },
    {
      "sentence": "This evening, the children will be repairing a website.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time later, our neighbors will be enjoying a snack.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, the students will be teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time tonight, the manager will be writing the project.",
      "verb": "writing"
    },
    {
      "sentence": "Later, my brother will be practicing the lesson.",
      "verb": "practicing"
    },
    {
      "sentence": "This weekend, the cat will be sending the contract.",
      "verb": "sending"
    },
    {
      "sentence": "Tom will be contacting the doctor next week.",
      "verb": "contacting"
    },
    {
      "sentence": "The children will be cooking lunch later.",
      "verb": "cooking"
    },
    {
      "sentence": "Later, emma will be submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "Our neighbors will be completing the presentation in two days.",
      "verb": "completing"
    },
    {
      "sentence": "The cat will be speaking my parents soon.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time soon, you will be returning to work.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tomorrow, her sister will be getting the phone.",
      "verb": "getting"
    },
    {
      "sentence": "Tom will be sending the task this evening.",
      "verb": "sending"
    },
    {
      "sentence": "The children will be starting the document next week.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this weekend, emma will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next month, emma will be teaching the textbook.",
      "verb": "teaching"
    },
    {
      "sentence": "In two days, tom will be calling the manager.",
      "verb": "calling"
    },
    {
      "sentence": "Tonight, my brother will be repairing a website.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time in two days, john will be driving home.",
      "verb": "driving"
    },
    {
      "sentence": "At this time tonight, the team will be coming to the store.",
      "verb": "coming"
    },
    {
      "sentence": "At this time soon, john will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "At this time in two days, tom will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "Soon, her sister will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, we will be coming to the beach.",
      "verb": "coming"
    },
    {
      "sentence": "This weekend, the bird will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "The children will be reviewing Spanish tonight.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, the team will be speaking the client.",
      "verb": "speaking"
    },
    {
      "sentence": "Next week, the teacher will be returning to the store.",
      "verb": "returning"
    },
    {
      "sentence": "In two days, the cat will be coming to the gym.",
      "verb": "coming"
    },
    {
      "sentence": "They will be reading the chapter tomorrow.",
      "verb": "reading"
    },
    {
      "sentence": "At this time next week, we will be speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "This evening, my brother will be reading history.",
      "verb": "reading"
    },
    {
      "sentence": "At this time this weekend, the teacher will be cooking juice.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time tomorrow, i will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this weekend, the dog will be reading grammar.",
      "verb": "reading"
    },
    {
      "sentence": "At this time later, the team will be fixing the garden.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, they will be flying to the airport.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next month, our neighbors will be buying groceries.",
      "verb": "buying"
    },
    {
      "sentence": "This evening, sarah will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "Our neighbors will be finishing the presentation tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time next month, my parents will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this weekend, he will be submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time this weekend, my friend will be finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "Our neighbors will be painting the house this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "Next week, they will be listening to the game.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will be listening to a movie next week.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be studying French in two days.",
      "verb": "studying"
    },
    {
      "sentence": "This evening, the manager will be sending the presentation.",
      "verb": "sending"
    },
    {
      "sentence": "At this time this weekend, my brother will be talking the team.",
      "verb": "talking"
    },
    {
      "sentence": "Tomorrow, the team will be making a sandwich.",
      "verb": "making"
    },
    {
      "sentence": "Tomorrow, my parents will be planning the options.",
      "verb": "planning"
    },
    {
      "sentence": "At this time soon, our neighbors will be returning downtown.",
      "verb": "returning"
    },
    {
      "sentence": "You will be thinking about the situation later.",
      "verb": "thinking"
    },
    {
      "sentence": "Tomorrow, the teacher will be visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time next week, my friend will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "The children will be submitting the project soon.",
      "verb": "submitting"
    },
    {
      "sentence": "Next week, we will be visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "Next week, sarah will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "Soon, tom will be visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "Soon, the manager will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, you will be reading for the exam.",
      "verb": "reading"
    },
    {
      "sentence": "This weekend, she will be contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the company will be flying to the park.",
      "verb": "flying"
    },
    {
      "sentence": "At this time next month, we will be starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "The students will be forgetting the trip next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time this weekend, emma will be giving a laptop.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, they will be finding a laptop.",
      "verb": "finding"
    },
    {
      "sentence": "My parents will be enjoying a documentary next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time later, my friend will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "Tomorrow, the manager will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "Later, the cat will be going downtown.",
      "verb": "going"
    },
    {
      "sentence": "They will be getting a gift tonight.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, she will be completing the document.",
      "verb": "completing"
    },
    {
      "sentence": "At this time this weekend, they will be enjoying a video.",
      "verb": "enjoying"
    },
    {
      "sentence": "She will be flying to school next month.",
      "verb": "flying"
    },
    {
      "sentence": "Tonight, she will be talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "John will be calling the client next week.",
      "verb": "calling"
    },
    {
      "sentence": "This evening, my parents will be visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "I will be walking to work next year.",
      "verb": "walking"
    },
    {
      "sentence": "She will be teaching mathematics tonight.",
      "verb": "teaching"
    },
    {
      "sentence": "Next week, we will be practicing science.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time tonight, her sister will be talking the client.",
      "verb": "talking"
    },
    {
      "sentence": "Tonight, we will be cleaning a website.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next year, the teacher will be submitting the report.",
      "verb": "submitting"
    },
    {
      "sentence": "He will be enjoying TV this weekend.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next week, the manager will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next year, the students will be calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "Soon, the bird will be talking my friend.",
      "verb": "talking"
    },
    {
      "sentence": "The children will be receiving the task next month.",
      "verb": "receiving"
    },
    {
      "sentence": "You will be completing the document tonight.",
      "verb": "completing"
    },
    {
      "sentence": "At this time tonight, the cat will be contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "Soon, my brother will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat will be considering the situation next week.",
      "verb": "considering"
    },
    {
      "sentence": "The manager will be receiving the document next month.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next year, the children will be preparing a sandwich.",
      "verb": "preparing"
    },
    {
      "sentence": "Next week, our neighbors will be flying to the market.",
      "verb": "flying"
    },
    {
      "sentence": "In two days, john will be studying vocabulary.",
      "verb": "studying"
    },
    {
      "sentence": "This evening, we will be going to the park.",
      "verb": "going"
    },
    {
      "sentence": "At this time this evening, they will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "They will be watching a documentary later.",
      "verb": "watching"
    },
    {
      "sentence": "Tomorrow, sarah will be cleaning the furniture.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog will be painting the bathroom soon.",
      "verb": "painting"
    },
    {
      "sentence": "At this time in two days, you will be ordering juice.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, the teacher will be building the computer.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, my friend will be talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "This evening, the cat will be running home.",
      "verb": "running"
    },
    {
      "sentence": "This evening, my brother will be playing the game.",
      "verb": "playing"
    },
    {
      "sentence": "John will be choosing a present soon.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time in two days, he will be driving to the beach.",
      "verb": "driving"
    },
    {
      "sentence": "Sarah will be getting a new car soon.",
      "verb": "getting"
    },
    {
      "sentence": "Later, her sister will be reading Spanish.",
      "verb": "reading"
    },
    {
      "sentence": "Next week, her sister will be fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "This evening, the bird will be making dinner.",
      "verb": "making"
    },
    {
      "sentence": "Tonight, he will be visiting the doctor.",
      "verb": "visiting"
    },
    {
      "sentence": "This evening, the team will be ordering a snack.",
      "verb": "ordering"
    },
    {
      "sentence": "You will be practicing science tonight.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this evening, emma will be fixing the house.",
      "verb": "fixing"
    },
    {
      "sentence": "Emma will be receiving the contract later.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time this evening, sarah will be building the room.",
      "verb": "building"
    },
    {
      "sentence": "At this time this weekend, the teacher will be driving to the park.",
      "verb": "driving"
    },
    {
      "sentence": "At this time later, the dog will be repairing a website.",
      "verb": "repairing"
    },
    {
      "sentence": "Next week, the team will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "Next week, the company will be considering the vacation.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next week, tom will be ordering a salad.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time next week, the cat will be fixing the bathroom.",
      "verb": "fixing"
    },
    {
      "sentence": "Soon, we will be finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, you will be calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "You will be learning Spanish soon.",
      "verb": "learning"
    },
    {
      "sentence": "The teacher will be speaking my family next week.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, my parents will be enjoying basketball.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tomorrow, the dog will be painting the kitchen.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, the team will be eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be painting the furniture later.",
      "verb": "painting"
    },
    {
      "sentence": "This weekend, tom will be reviewing vocabulary.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, they will be enjoying dinner.",
      "verb": "enjoying"
    },
    {
      "sentence": "They will be learning English soon.",
      "verb": "learning"
    },
    {
      "sentence": "Next year, they will be thinking about the event.",
      "verb": "thinking"
    },
    {
      "sentence": "Soon, the dog will be repairing the bathroom.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this weekend, the company will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time this evening, the team will be visiting the neighbors.",
      "verb": "visiting"
    },
    {
      "sentence": "This evening, he will be enjoying a song.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, emma will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this weekend, tom will be giving the keys.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next month, he will be getting a new car.",
      "verb": "getting"
    },
    {
      "sentence": "In two days, the team will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "Later, you will be considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "My brother will be enjoying tea later.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, my parents will be submitting the proposal.",
      "verb": "submitting"
    },
    {
      "sentence": "Soon, he will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next month, she will be reading vocabulary.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tomorrow, the company will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "This evening, i will be fixing a website.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time this weekend, you will be visiting the team.",
      "verb": "visiting"
    },
    {
      "sentence": "My brother will be ordering a sandwich next week.",
      "verb": "ordering"
    },
    {
      "sentence": "The cat will be cleaning a picture tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "Later, john will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the students will be practicing English.",
      "verb": "practicing"
    },
    {
      "sentence": "Our neighbors will be remembering the situation this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next week, the students will be starting the contract.",
      "verb": "starting"
    },
    {
      "sentence": "Tom will be listening to tennis this evening.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next month, our neighbors will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, the manager will be returning to the park.",
      "verb": "returning"
    },
    {
      "sentence": "My parents will be coming to the gym next year.",
      "verb": "coming"
    },
    {
      "sentence": "At this time later, the teacher will be ordering a sandwich.",
      "verb": "ordering"
    },
    {
      "sentence": "Later, i will be contacting my parents.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time in two days, she will be teaching science.",
      "verb": "teaching"
    },
    {
      "sentence": "Later, my brother will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "Tomorrow, i will be enjoying TV.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next month, the manager will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "The manager will be speaking my friend this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next month, john will be fixing the house.",
      "verb": "fixing"
    },
    {
      "sentence": "They will be enjoying TV next week.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time in two days, john will be cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time this evening, sarah will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "Her sister will be completing the letter tonight.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next week, john will be cleaning the furniture.",
      "verb": "cleaning"
    },
    {
      "sentence": "She will be calling the doctor tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "At this time tonight, john will be selling a gift.",
      "verb": "selling"
    },
    {
      "sentence": "You will be teaching science soon.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time this evening, the students will be planning the decision.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next month, you will be contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time tonight, the dog will be enjoying a podcast.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next year, we will be remembering the problem.",
      "verb": "remembering"
    },
    {
      "sentence": "In two days, we will be selling the ticket.",
      "verb": "selling"
    },
    {
      "sentence": "Soon, the company will be reading mathematics.",
      "verb": "reading"
    },
    {
      "sentence": "John will be going to the airport soon.",
      "verb": "going"
    },
    {
      "sentence": "I will be meeting the teacher next month.",
      "verb": "meeting"
    },
    {
      "sentence": "I will be considering the future next month.",
      "verb": "considering"
    },
    {
      "sentence": "In two days, the cat will be enjoying a movie.",
      "verb": "enjoying"
    },
    {
      "sentence": "The manager will be speaking the boss next week.",
      "verb": "speaking"
    },
    {
      "sentence": "This weekend, john will be arriving to the market.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time next month, they will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "This evening, the dog will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time tomorrow, we will be considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "Later, sarah will be considering the trip.",
      "verb": "considering"
    },
    {
      "sentence": "I will be eating lunch this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "This evening, her sister will be thinking about the situation.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next week, the dog will be walking to the park.",
      "verb": "walking"
    },
    {
      "sentence": "Next week, my brother will be thinking about the decision.",
      "verb": "thinking"
    },
    {
      "sentence": "Next month, they will be ordering a salad.",
      "verb": "ordering"
    },
    {
      "sentence": "At this time tonight, the teacher will be teaching history.",
      "verb": "teaching"
    },
    {
      "sentence": "The children will be considering the meeting this weekend.",
      "verb": "considering"
    },
    {
      "sentence": "Next month, my brother will be completing the letter.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next year, the team will be getting a book.",
      "verb": "getting"
    },
    {
      "sentence": "Our neighbors will be walking to the store next week.",
      "verb": "walking"
    },
    {
      "sentence": "At this time next week, she will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time tomorrow, you will be repairing the bathroom.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next year, the students will be cleaning the kitchen.",
      "verb": "cleaning"
    },
    {
      "sentence": "The team will be preparing lunch this evening.",
      "verb": "preparing"
    },
    {
      "sentence": "In two days, they will be going to the beach.",
      "verb": "going"
    },
    {
      "sentence": "This weekend, the students will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "My parents will be selling clothes later.",
      "verb": "selling"
    },
    {
      "sentence": "Next year, the manager will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, he will be building a picture.",
      "verb": "building"
    },
    {
      "sentence": "Emma will be speaking the neighbors next week.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, my parents will be receiving the email.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time soon, my parents will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time tomorrow, the manager will be teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time tomorrow, the cat will be painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this weekend, john will be forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time in two days, our neighbors will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "Tonight, the teacher will be learning the lesson.",
      "verb": "learning"
    },
    {
      "sentence": "Next month, john will be considering the problem.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this evening, tom will be remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "My parents will be completing the document this evening.",
      "verb": "completing"
    },
    {
      "sentence": "At this time later, my friend will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "You will be calling the client next year.",
      "verb": "calling"
    },
    {
      "sentence": "At this time soon, the company will be painting the house.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this weekend, the manager will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "This weekend, my parents will be visiting the team.",
      "verb": "visiting"
    },
    {
      "sentence": "In two days, my parents will be cooking pizza.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time next month, the teacher will be speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird will be cleaning the house soon.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time tomorrow, the bird will be enjoying lunch.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tomorrow, she will be calling the manager.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, john will be talking my parents.",
      "verb": "talking"
    },
    {
      "sentence": "At this time in two days, our neighbors will be painting a website.",
      "verb": "painting"
    },
    {
      "sentence": "The manager will be teaching the lesson next month.",
      "verb": "teaching"
    },
    {
      "sentence": "Tomorrow, the team will be remembering the birthday.",
      "verb": "remembering"
    },
    {
      "sentence": "Later, the bird will be flying to school.",
      "verb": "flying"
    },
    {
      "sentence": "This weekend, the team will be talking the client.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister will be enjoying tennis tomorrow.",
      "verb": "enjoying"
    },
    {
      "sentence": "In two days, my parents will be playing a video.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the dog will be talking the client.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, tom will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "My friend will be watching football in two days.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, he will be understanding Spanish.",
      "verb": "understanding"
    },
    {
      "sentence": "They will be ordering coffee next year.",
      "verb": "ordering"
    },
    {
      "sentence": "My brother will be eating soup this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, my parents will be studying French.",
      "verb": "studying"
    },
    {
      "sentence": "I will be finishing the project next year.",
      "verb": "finishing"
    },
    {
      "sentence": "Next month, he will be building the bathroom.",
      "verb": "building"
    },
    {
      "sentence": "We will be learning the textbook soon.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, the manager will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "The team will be making lunch next week.",
      "verb": "making"
    },
    {
      "sentence": "At this time later, they will be giving the keys.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next year, they will be speaking the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "Soon, her sister will be getting the ticket.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next year, my parents will be finding a book.",
      "verb": "finding"
    },
    {
      "sentence": "The bird will be giving the ticket this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next week, the dog will be painting the bathroom.",
      "verb": "painting"
    },
    {
      "sentence": "The company will be fixing the car later.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time this weekend, her sister will be watching basketball.",
      "verb": "watching"
    },
    {
      "sentence": "John will be contacting my parents later.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, john will be contacting the boss.",
      "verb": "contacting"
    },
    {
      "sentence": "This weekend, the manager will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "At this time tonight, my brother will be learning for the exam.",
      "verb": "learning"
    },
    {
      "sentence": "I will be watching the game tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "Later, emma will be calling my parents.",
      "verb": "calling"
    },
    {
      "sentence": "Soon, the company will be learning mathematics.",
      "verb": "learning"
    },
    {
      "sentence": "Sarah will be calling the manager next week.",
      "verb": "calling"
    },
    {
      "sentence": "The team will be painting a picture next month.",
      "verb": "painting"
    },
    {
      "sentence": "My friend will be eating a sandwich this evening.",
      "verb": "eating"
    },
    {
      "sentence": "She will be painting the garden tonight.",
      "verb": "painting"
    },
    {
      "sentence": "She will be driving to the library tonight.",
      "verb": "driving"
    },
    {
      "sentence": "Later, our neighbors will be studying French.",
      "verb": "studying"
    },
    {
      "sentence": "At this time soon, you will be listening to a documentary.",
      "verb": "listening"
    },
    {
      "sentence": "I will be repairing the house next week.",
      "verb": "repairing"
    },
    {
      "sentence": "The team will be practicing the lesson tomorrow.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next year, they will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tomorrow, she will be finding a gift.",
      "verb": "finding"
    },
    {
      "sentence": "Tom will be walking to the market soon.",
      "verb": "walking"
    },
    {
      "sentence": "Next week, we will be forgetting the decision.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time in two days, the teacher will be finishing the letter.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time tonight, the students will be cleaning the garden.",
      "verb": "cleaning"
    },
    {
      "sentence": "Tonight, the team will be enjoying pizza.",
      "verb": "enjoying"
    },
    {
      "sentence": "Later, the bird will be enjoying breakfast.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time next month, my friend will be playing TV.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, my friend will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time in two days, you will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "Next year, emma will be submitting the presentation.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, the dog will be cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next week, tom will be studying for the exam.",
      "verb": "studying"
    },
    {
      "sentence": "Tonight, the dog will be reading history.",
      "verb": "reading"
    },
    {
      "sentence": "This evening, the cat will be visiting my family.",
      "verb": "visiting"
    },
    {
      "sentence": "I will be buying clothes next week.",
      "verb": "buying"
    },
    {
      "sentence": "Her sister will be giving groceries this weekend.",
      "verb": "giving"
    },
    {
      "sentence": "The students will be calling my friend this evening.",
      "verb": "calling"
    },
    {
      "sentence": "At this time tomorrow, he will be finding clothes.",
      "verb": "finding"
    },
    {
      "sentence": "At this time tonight, he will be learning the textbook.",
      "verb": "learning"
    },
    {
      "sentence": "In two days, emma will be speaking my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "This weekend, she will be cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "Soon, the students will be contacting the neighbors.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time next month, the bird will be enjoying football.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time tonight, the company will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next week, they will be listening to tennis.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will be driving to the airport tomorrow.",
      "verb": "driving"
    },
    {
      "sentence": "Next month, the company will be talking my family.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, my parents will be remembering the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The team will be buying flowers next year.",
      "verb": "buying"
    },
    {
      "sentence": "At this time soon, we will be painting the room.",
      "verb": "painting"
    },
    {
      "sentence": "Her sister will be practicing science next year.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time in two days, the dog will be talking the boss.",
      "verb": "talking"
    },
    {
      "sentence": "In two days, the bird will be considering the birthday.",
      "verb": "considering"
    },
    {
      "sentence": "Next week, you will be repairing the kitchen.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend will be finishing the proposal this evening.",
      "verb": "finishing"
    },
    {
      "sentence": "My friend will be contacting my friend next week.",
      "verb": "contacting"
    },
    {
      "sentence": "Next month, the dog will be getting clothes.",
      "verb": "getting"
    },
    {
      "sentence": "Later, the teacher will be reading the lesson.",
      "verb": "reading"
    },
    {
      "sentence": "At this time tonight, the dog will be playing the news.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, john will be enjoying the game.",
      "verb": "enjoying"
    },
    {
      "sentence": "At this time this weekend, he will be considering the problem.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, my friend will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "Soon, they will be cooking pizza.",
      "verb": "cooking"
    },
    {
      "sentence": "They will be eating a sandwich tonight.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, we will be designing the bathroom.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tonight, i will be calling the neighbors.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher will be starting the email soon.",
      "verb": "starting"
    },
    {
      "sentence": "Soon, sarah will be going to the library.",
      "verb": "going"
    },
    {
      "sentence": "They will be walking to the park next week.",
      "verb": "walking"
    },
    {
      "sentence": "My friend will be starting the application this evening.",
      "verb": "starting"
    },
    {
      "sentence": "At this time next month, the cat will be returning to the library.",
      "verb": "returning"
    },
    {
      "sentence": "My friend will be finishing the document later.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time soon, they will be preparing coffee.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time next week, emma will be talking my family.",
      "verb": "talking"
    },
    {
      "sentence": "Later, my brother will be coming to the market.",
      "verb": "coming"
    },
    {
      "sentence": "They will be arriving to the gym this evening.",
      "verb": "arriving"
    },
    {
      "sentence": "Tomorrow, i will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next month, the children will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "I will be calling the boss in two days.",
      "verb": "calling"
    },
    {
      "sentence": "Next week, tom will be going to the store.",
      "verb": "going"
    },
    {
      "sentence": "Tom will be watching a movie next month.",
      "verb": "watching"
    },
    {
      "sentence": "Later, the manager will be finding groceries.",
      "verb": "finding"
    },
    {
      "sentence": "You will be writing the project tonight.",
      "verb": "writing"
    },
    {
      "sentence": "Tomorrow, you will be calling the manager.",
      "verb": "calling"
    },
    {
      "sentence": "The children will be finding a gift next month.",
      "verb": "finding"
    },
    {
      "sentence": "Next week, the teacher will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "At this time tomorrow, the manager will be remembering the trip.",
      "verb": "remembering"
    },
    {
      "sentence": "Tomorrow, they will be finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "The team will be remembering the meeting soon.",
      "verb": "remembering"
    },
    {
      "sentence": "The students will be drawing a website this evening.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tonight, the cat will be visiting the boss.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time next year, sarah will be playing a song.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister will be drawing the room later.",
      "verb": "drawing"
    },
    {
      "sentence": "This evening, the company will be playing a podcast.",
      "verb": "playing"
    },
    {
      "sentence": "The children will be finishing the task tonight.",
      "verb": "finishing"
    },
    {
      "sentence": "Later, the manager will be speaking the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "Next week, my friend will be drinking lunch.",
      "verb": "drinking"
    },
    {
      "sentence": "In two days, the dog will be reviewing English.",
      "verb": "reviewing"
    },
    {
      "sentence": "We will be enjoying pasta soon.",
      "verb": "enjoying"
    },
    {
      "sentence": "We will be studying the lesson tonight.",
      "verb": "studying"
    },
    {
      "sentence": "At this time in two days, the students will be painting the kitchen.",
      "verb": "painting"
    },
    {
      "sentence": "My brother will be reading vocabulary next month.",
      "verb": "reading"
    },
    {
      "sentence": "The students will be forgetting the meeting next month.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next week, the team will be drawing the bathroom.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tomorrow, i will be drinking a sandwich.",
      "verb": "drinking"
    },
    {
      "sentence": "Next year, my parents will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, my friend will be eating tea.",
      "verb": "eating"
    },
    {
      "sentence": "Tom will be drinking a sandwich later.",
      "verb": "drinking"
    }
  ]
}