{
  "tense": "Future Perfect",
  "description": "Used for actions that will be completed before a specific future time",
  "examples": [
    {
      "sentence": "By next week, i will have planned the meeting.",
      "verb": "planned"
    },
    {
      "sentence": "By this weekend, they will have driven to the market.",
      "verb": "driven"
    },
    {
      "sentence": "Emma will have received the letter by then.",
      "verb": "received"
    },
    {
      "sentence": "The manager will have finished the task by tomorrow.",
      "verb": "finished"
    },
    {
      "sentence": "You will have called my friend by next week.",
      "verb": "called"
    },
    {
      "sentence": "Tom will have chosen the ticket by next year.",
      "verb": "chosen"
    },
    {
      "sentence": "He will have found a book by then.",
      "verb": "found"
    },
    {
      "sentence": "My brother will have studied grammar by tonight.",
      "verb": "studied"
    },
    {
      "sentence": "Sarah will have repaired the car by tomorrow.",
      "verb": "repaired"
    },
    {
      "sentence": "Sarah will have fixed the kitchen by in two days.",
      "verb": "fixed"
    },
    {
      "sentence": "The team will have left to the park by tonight.",
      "verb": "left"
    },
    {
      "sentence": "I will have received the report by this weekend.",
      "verb": "received"
    },
    {
      "sentence": "The dog will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "My parents will have completed the assignment by tomorrow.",
      "verb": "completed"
    },
    {
      "sentence": "My friend will have bought a laptop by then.",
      "verb": "bought"
    },
    {
      "sentence": "By in two days, the teacher will have thought about the vacation.",
      "verb": "thought"
    },
    {
      "sentence": "The teacher will have thought about the event by then.",
      "verb": "thought"
    },
    {
      "sentence": "The team will have sold groceries by then.",
      "verb": "sold"
    },
    {
      "sentence": "Emma will have completed the letter by later.",
      "verb": "completed"
    },
    {
      "sentence": "You will have ordered a sandwich by then.",
      "verb": "ordered"
    },
    {
      "sentence": "The children will have given clothes by then.",
      "verb": "given"
    },
    {
      "sentence": "Sarah will have walked to the market by then.",
      "verb": "walked"
    },
    {
      "sentence": "By tonight, the cat will have enjoyed a documentary.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The dog will have started the document by later.",
      "verb": "started"
    },
    {
      "sentence": "He will have repaired the garden by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The bird will have prepared pizza by then.",
      "verb": "prepared"
    },
    {
      "sentence": "We will have played a documentary by then.",
      "verb": "played"
    },
    {
      "sentence": "The company will have watched basketball by tonight.",
      "verb": "watched"
    },
    {
      "sentence": "He will have enjoyed a movie by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The dog will have forgotten the event by next month.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this weekend, my friend will have visited my friend.",
      "verb": "visited"
    },
    {
      "sentence": "Tom will have remembered the options by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By next month, emma will have walked to the beach.",
      "verb": "walked"
    },
    {
      "sentence": "The teacher will have contacted the boss by next week.",
      "verb": "contacted"
    },
    {
      "sentence": "By next month, the cat will have played music.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, he will have forgotten the trip.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tonight, sarah will have come to the beach.",
      "verb": "come"
    },
    {
      "sentence": "By next month, the dog will have considered the decision.",
      "verb": "considered"
    },
    {
      "sentence": "My friend will have ordered pizza by this weekend.",
      "verb": "ordered"
    },
    {
      "sentence": "My brother will have sent the project by then.",
      "verb": "sent"
    },
    {
      "sentence": "By next week, they will have come to the park.",
      "verb": "come"
    },
    {
      "sentence": "John will have listened to a video by then.",
      "verb": "listened"
    },
    {
      "sentence": "The manager will have talked my family by then.",
      "verb": "talked"
    },
    {
      "sentence": "The students will have forgotten the birthday by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "We will have prepared juice by later.",
      "verb": "prepared"
    },
    {
      "sentence": "By soon, my brother will have come home.",
      "verb": "come"
    },
    {
      "sentence": "My parents will have flown to the beach by then.",
      "verb": "flown"
    },
    {
      "sentence": "The students will have considered the trip by then.",
      "verb": "considered"
    },
    {
      "sentence": "By next month, john will have built the computer.",
      "verb": "built"
    },
    {
      "sentence": "She will have made pasta by then.",
      "verb": "made"
    },
    {
      "sentence": "He will have sold groceries by then.",
      "verb": "sold"
    },
    {
      "sentence": "By tomorrow, her sister will have returned to the store.",
      "verb": "returned"
    },
    {
      "sentence": "The team will have thought about the meeting by in two days.",
      "verb": "thought"
    },
    {
      "sentence": "Emma will have drunk lunch by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "The manager will have prepared a snack by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By tomorrow, tom will have practiced French.",
      "verb": "practiced"
    },
    {
      "sentence": "She will have completed the assignment by then.",
      "verb": "completed"
    },
    {
      "sentence": "By next year, we will have spoken the team.",
      "verb": "spoken"
    },
    {
      "sentence": "By soon, the company will have practiced mathematics.",
      "verb": "practiced"
    },
    {
      "sentence": "The teacher will have started the document by then.",
      "verb": "started"
    },
    {
      "sentence": "John will have listened to a video by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "The dog will have remembered the event by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "John will have cooked coffee by then.",
      "verb": "cooked"
    },
    {
      "sentence": "The bird will have remembered the situation by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By later, the dog will have visited my parents.",
      "verb": "visited"
    },
    {
      "sentence": "The cat will have learned the chapter by then.",
      "verb": "learned"
    },
    {
      "sentence": "You will have bought a present by tomorrow.",
      "verb": "bought"
    },
    {
      "sentence": "Sarah will have driven to the market by then.",
      "verb": "driven"
    },
    {
      "sentence": "He will have enjoyed basketball by in two days.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The students will have started the application by then.",
      "verb": "started"
    },
    {
      "sentence": "Our neighbors will have flown downtown by next year.",
      "verb": "flown"
    },
    {
      "sentence": "Emma will have planned the event by then.",
      "verb": "planned"
    },
    {
      "sentence": "John will have designed the car by then.",
      "verb": "designed"
    },
    {
      "sentence": "By next year, tom will have practiced for the exam.",
      "verb": "practiced"
    },
    {
      "sentence": "The children will have sold a present by then.",
      "verb": "sold"
    },
    {
      "sentence": "By tonight, tom will have thought about the birthday.",
      "verb": "thought"
    },
    {
      "sentence": "My brother will have reviewed French by next week.",
      "verb": "reviewed"
    },
    {
      "sentence": "The company will have called my parents by then.",
      "verb": "called"
    },
    {
      "sentence": "The company will have finished the presentation by tomorrow.",
      "verb": "finished"
    },
    {
      "sentence": "By in two days, sarah will have flown to the store.",
      "verb": "flown"
    },
    {
      "sentence": "By next year, they will have met my family.",
      "verb": "met"
    },
    {
      "sentence": "The team will have made soup by then.",
      "verb": "made"
    },
    {
      "sentence": "Her sister will have enjoyed dinner by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The team will have eaten a salad by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, the bird will have taught French.",
      "verb": "taught"
    },
    {
      "sentence": "The company will have thought about the vacation by tonight.",
      "verb": "thought"
    },
    {
      "sentence": "Our neighbors will have taught mathematics by tonight.",
      "verb": "taught"
    },
    {
      "sentence": "By tomorrow, her sister will have cooked a salad.",
      "verb": "cooked"
    },
    {
      "sentence": "By soon, emma will have chosen the ticket.",
      "verb": "chosen"
    },
    {
      "sentence": "By soon, the students will have walked to the gym.",
      "verb": "walked"
    },
    {
      "sentence": "You will have practiced English by then.",
      "verb": "practiced"
    },
    {
      "sentence": "I will have watched music by then.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, the team will have contacted my friend.",
      "verb": "contacted"
    },
    {
      "sentence": "The bird will have enjoyed pizza by next month.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My brother will have remembered the vacation by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "She will have given the phone by next week.",
      "verb": "given"
    },
    {
      "sentence": "The company will have made a salad by then.",
      "verb": "made"
    },
    {
      "sentence": "The team will have walked home by in two days.",
      "verb": "walked"
    },
    {
      "sentence": "We will have played a song by tomorrow.",
      "verb": "played"
    },
    {
      "sentence": "By next month, they will have received the proposal.",
      "verb": "received"
    },
    {
      "sentence": "My friend will have contacted my parents by next week.",
      "verb": "contacted"
    },
    {
      "sentence": "By next year, my friend will have played tennis.",
      "verb": "played"
    },
    {
      "sentence": "I will have fixed the garden by next year.",
      "verb": "fixed"
    },
    {
      "sentence": "By in two days, my friend will have planned the birthday.",
      "verb": "planned"
    },
    {
      "sentence": "Sarah will have finished the assignment by soon.",
      "verb": "finished"
    },
    {
      "sentence": "The students will have enjoyed a song by soon.",
      "verb": "enjoyed"
    },
    {
      "sentence": "We will have forgotten the options by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By next year, the cat will have spoken my parents.",
      "verb": "spoken"
    },
    {
      "sentence": "By in two days, emma will have visited the boss.",
      "verb": "visited"
    },
    {
      "sentence": "You will have understood for the exam by tonight.",
      "verb": "understood"
    },
    {
      "sentence": "By next week, emma will have prepared soup.",
      "verb": "prepared"
    },
    {
      "sentence": "By in two days, she will have completed the application.",
      "verb": "completed"
    },
    {
      "sentence": "By this weekend, sarah will have painted a picture.",
      "verb": "painted"
    },
    {
      "sentence": "By next year, the teacher will have called the neighbors.",
      "verb": "called"
    },
    {
      "sentence": "Her sister will have cleaned the car by next week.",
      "verb": "cleaned"
    },
    {
      "sentence": "The students will have sent the assignment by next week.",
      "verb": "sent"
    },
    {
      "sentence": "They will have finished the application by soon.",
      "verb": "finished"
    },
    {
      "sentence": "The company will have met the neighbors by then.",
      "verb": "met"
    },
    {
      "sentence": "The dog will have taught the textbook by then.",
      "verb": "taught"
    },
    {
      "sentence": "They will have practiced English by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The team will have studied vocabulary by this evening.",
      "verb": "studied"
    },
    {
      "sentence": "Sarah will have walked to school by next year.",
      "verb": "walked"
    },
    {
      "sentence": "The children will have started the project by in two days.",
      "verb": "started"
    },
    {
      "sentence": "Emma will have sent the task by then.",
      "verb": "sent"
    },
    {
      "sentence": "The manager will have listened to TV by then.",
      "verb": "listened"
    },
    {
      "sentence": "By later, the cat will have flown to the office.",
      "verb": "flown"
    },
    {
      "sentence": "The cat will have gotten clothes by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The children will have forgotten the situation by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "Our neighbors will have watched a podcast by then.",
      "verb": "watched"
    },
    {
      "sentence": "By this weekend, he will have found a laptop.",
      "verb": "found"
    },
    {
      "sentence": "By next week, you will have spoken my family.",
      "verb": "spoken"
    },
    {
      "sentence": "The students will have visited the manager by then.",
      "verb": "visited"
    },
    {
      "sentence": "My brother will have chosen flowers by later.",
      "verb": "chosen"
    },
    {
      "sentence": "You will have bought groceries by then.",
      "verb": "bought"
    },
    {
      "sentence": "The company will have played a podcast by then.",
      "verb": "played"
    },
    {
      "sentence": "By next year, the teacher will have come to work.",
      "verb": "come"
    },
    {
      "sentence": "We will have met the doctor by then.",
      "verb": "met"
    },
    {
      "sentence": "The manager will have drunk breakfast by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The manager will have started the report by later.",
      "verb": "started"
    },
    {
      "sentence": "By soon, my brother will have met the team.",
      "verb": "met"
    },
    {
      "sentence": "By next month, my parents will have remembered the situation.",
      "verb": "remembered"
    },
    {
      "sentence": "We will have cleaned the bathroom by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "You will have written the report by tomorrow.",
      "verb": "written"
    },
    {
      "sentence": "The children will have flown to the market by then.",
      "verb": "flown"
    },
    {
      "sentence": "The manager will have played tennis by then.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, the bird will have made lunch.",
      "verb": "made"
    },
    {
      "sentence": "He will have remembered the event by this weekend.",
      "verb": "remembered"
    },
    {
      "sentence": "I will have met the manager by then.",
      "verb": "met"
    },
    {
      "sentence": "Our neighbors will have spoken the manager by this weekend.",
      "verb": "spoken"
    },
    {
      "sentence": "By this evening, my friend will have found a new car.",
      "verb": "found"
    },
    {
      "sentence": "Tom will have drawn the house by this evening.",
      "verb": "drawn"
    },
    {
      "sentence": "By tonight, they will have completed the report.",
      "verb": "completed"
    },
    {
      "sentence": "By later, our neighbors will have remembered the trip.",
      "verb": "remembered"
    },
    {
      "sentence": "By next month, he will have thought about the vacation.",
      "verb": "thought"
    },
    {
      "sentence": "Her sister will have met the teacher by soon.",
      "verb": "met"
    },
    {
      "sentence": "By soon, the students will have repaired the garden.",
      "verb": "repaired"
    },
    {
      "sentence": "Emma will have built the bathroom by soon.",
      "verb": "built"
    },
    {
      "sentence": "By next year, the dog will have sold a new car.",
      "verb": "sold"
    },
    {
      "sentence": "By next week, sarah will have gotten a laptop.",
      "verb": "gotten"
    },
    {
      "sentence": "You will have listened to the game by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "They will have sent the letter by then.",
      "verb": "sent"
    },
    {
      "sentence": "The bird will have talked the team by then.",
      "verb": "talked"
    },
    {
      "sentence": "You will have spoken the client by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The students will have gone to the market by then.",
      "verb": "gone"
    },
    {
      "sentence": "By soon, my brother will have walked to the office.",
      "verb": "walked"
    },
    {
      "sentence": "Emma will have submitted the letter by then.",
      "verb": "submitted"
    },
    {
      "sentence": "By later, our neighbors will have ordered pizza.",
      "verb": "ordered"
    },
    {
      "sentence": "She will have run to the store by this evening.",
      "verb": "run"
    },
    {
      "sentence": "The dog will have walked to the airport by tonight.",
      "verb": "walked"
    },
    {
      "sentence": "The manager will have returned to the park by later.",
      "verb": "returned"
    },
    {
      "sentence": "By next month, emma will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "Tom will have fixed the room by next month.",
      "verb": "fixed"
    },
    {
      "sentence": "The cat will have spoken the teacher by next week.",
      "verb": "spoken"
    },
    {
      "sentence": "She will have repaired a website by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The company will have contacted the boss by this evening.",
      "verb": "contacted"
    },
    {
      "sentence": "She will have watched football by this weekend.",
      "verb": "watched"
    },
    {
      "sentence": "The students will have planned the event by then.",
      "verb": "planned"
    },
    {
      "sentence": "By this evening, my parents will have cooked coffee.",
      "verb": "cooked"
    },
    {
      "sentence": "By soon, the company will have driven to work.",
      "verb": "driven"
    },
    {
      "sentence": "By next year, the children will have enjoyed coffee.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next year, the teacher will have considered the vacation.",
      "verb": "considered"
    },
    {
      "sentence": "By this evening, the dog will have called the neighbors.",
      "verb": "called"
    },
    {
      "sentence": "She will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My friend will have thought about the problem by then.",
      "verb": "thought"
    },
    {
      "sentence": "The company will have studied science by then.",
      "verb": "studied"
    },
    {
      "sentence": "By this evening, our neighbors will have prepared a snack.",
      "verb": "prepared"
    },
    {
      "sentence": "By this weekend, the students will have listened to a video.",
      "verb": "listened"
    },
    {
      "sentence": "By soon, you will have read history.",
      "verb": "read"
    },
    {
      "sentence": "Emma will have called the team by tomorrow.",
      "verb": "called"
    },
    {
      "sentence": "The company will have bought a new car by then.",
      "verb": "bought"
    },
    {
      "sentence": "By this evening, the dog will have thought about the future.",
      "verb": "thought"
    },
    {
      "sentence": "By this evening, the teacher will have given a laptop.",
      "verb": "given"
    },
    {
      "sentence": "By tomorrow, the dog will have considered the options.",
      "verb": "considered"
    },
    {
      "sentence": "My brother will have visited my friend by this weekend.",
      "verb": "visited"
    },
    {
      "sentence": "Tom will have planned the decision by then.",
      "verb": "planned"
    },
    {
      "sentence": "You will have spoken the client by this weekend.",
      "verb": "spoken"
    },
    {
      "sentence": "My parents will have ordered breakfast by this evening.",
      "verb": "ordered"
    },
    {
      "sentence": "She will have reviewed grammar by next week.",
      "verb": "reviewed"
    },
    {
      "sentence": "The students will have left to the beach by then.",
      "verb": "left"
    },
    {
      "sentence": "The teacher will have gone to the library by next year.",
      "verb": "gone"
    },
    {
      "sentence": "My parents will have remembered the event by then.",
      "verb": "remembered"
    },
    {
      "sentence": "Her sister will have returned to the gym by then.",
      "verb": "returned"
    },
    {
      "sentence": "The team will have written the project by then.",
      "verb": "written"
    },
    {
      "sentence": "John will have gotten groceries by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By next year, we will have built the bathroom.",
      "verb": "built"
    },
    {
      "sentence": "The children will have eaten pasta by then.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have visited the manager by then.",
      "verb": "visited"
    },
    {
      "sentence": "The children will have cleaned a website by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "By tomorrow, the children will have gotten a book.",
      "verb": "gotten"
    },
    {
      "sentence": "By next month, he will have returned to the airport.",
      "verb": "returned"
    },
    {
      "sentence": "The manager will have considered the decision by this weekend.",
      "verb": "considered"
    },
    {
      "sentence": "We will have cooked dinner by then.",
      "verb": "cooked"
    },
    {
      "sentence": "My friend will have written the task by then.",
      "verb": "written"
    },
    {
      "sentence": "My friend will have sold a gift by tonight.",
      "verb": "sold"
    },
    {
      "sentence": "By later, my friend will have planned the birthday.",
      "verb": "planned"
    },
    {
      "sentence": "My brother will have forgotten the future by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "Her sister will have watched music by then.",
      "verb": "watched"
    },
    {
      "sentence": "By later, the team will have read mathematics.",
      "verb": "read"
    },
    {
      "sentence": "They will have listened to a movie by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "I will have played a documentary by this evening.",
      "verb": "played"
    },
    {
      "sentence": "By next month, john will have reviewed English.",
      "verb": "reviewed"
    },
    {
      "sentence": "By next week, you will have sent the document.",
      "verb": "sent"
    },
    {
      "sentence": "By next month, they will have met the teacher.",
      "verb": "met"
    },
    {
      "sentence": "By this weekend, the team will have taught the textbook.",
      "verb": "taught"
    },
    {
      "sentence": "She will have sent the report by then.",
      "verb": "sent"
    },
    {
      "sentence": "We will have designed a website by next year.",
      "verb": "designed"
    },
    {
      "sentence": "By in two days, the teacher will have bought a present.",
      "verb": "bought"
    },
    {
      "sentence": "By in two days, my friend will have walked home.",
      "verb": "walked"
    },
    {
      "sentence": "The team will have walked to work by then.",
      "verb": "walked"
    },
    {
      "sentence": "They will have thought about the decision by tonight.",
      "verb": "thought"
    },
    {
      "sentence": "He will have remembered the birthday by tonight.",
      "verb": "remembered"
    },
    {
      "sentence": "By tomorrow, emma will have spoken my parents.",
      "verb": "spoken"
    },
    {
      "sentence": "I will have given the phone by then.",
      "verb": "given"
    },
    {
      "sentence": "The manager will have learned science by then.",
      "verb": "learned"
    },
    {
      "sentence": "By later, he will have cooked pizza.",
      "verb": "cooked"
    },
    {
      "sentence": "Tom will have found the keys by later.",
      "verb": "found"
    },
    {
      "sentence": "Her sister will have played TV by next month.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, my friend will have taught grammar.",
      "verb": "taught"
    },
    {
      "sentence": "My friend will have forgotten the event by next month.",
      "verb": "forgotten"
    },
    {
      "sentence": "My friend will have planned the problem by tomorrow.",
      "verb": "planned"
    },
    {
      "sentence": "The students will have gone to the store by then.",
      "verb": "gone"
    },
    {
      "sentence": "I will have designed the room by then.",
      "verb": "designed"
    },
    {
      "sentence": "The children will have called my family by then.",
      "verb": "called"
    },
    {
      "sentence": "We will have thought about the birthday by next year.",
      "verb": "thought"
    },
    {
      "sentence": "My brother will have prepared tea by next year.",
      "verb": "prepared"
    },
    {
      "sentence": "By next year, we will have drunk breakfast.",
      "verb": "drunk"
    },
    {
      "sentence": "By this weekend, the manager will have bought a gift.",
      "verb": "bought"
    },
    {
      "sentence": "The bird will have called the teacher by this weekend.",
      "verb": "called"
    },
    {
      "sentence": "We will have left to the beach by next year.",
      "verb": "left"
    },
    {
      "sentence": "The team will have given the ticket by tonight.",
      "verb": "given"
    },
    {
      "sentence": "The team will have given groceries by then.",
      "verb": "given"
    },
    {
      "sentence": "By tomorrow, my brother will have chosen clothes.",
      "verb": "chosen"
    },
    {
      "sentence": "By this weekend, we will have studied English.",
      "verb": "studied"
    },
    {
      "sentence": "The children will have gotten a book by soon.",
      "verb": "gotten"
    },
    {
      "sentence": "By next week, her sister will have sold clothes.",
      "verb": "sold"
    },
    {
      "sentence": "By next year, emma will have left downtown.",
      "verb": "left"
    },
    {
      "sentence": "The cat will have repaired the computer by next month.",
      "verb": "repaired"
    },
    {
      "sentence": "The company will have contacted my friend by tonight.",
      "verb": "contacted"
    },
    {
      "sentence": "We will have gone to the beach by tonight.",
      "verb": "gone"
    },
    {
      "sentence": "The students will have called the teacher by then.",
      "verb": "called"
    },
    {
      "sentence": "The children will have considered the event by then.",
      "verb": "considered"
    },
    {
      "sentence": "My friend will have fixed the kitchen by then.",
      "verb": "fixed"
    },
    {
      "sentence": "He will have forgotten the situation by next year.",
      "verb": "forgotten"
    },
    {
      "sentence": "Tom will have learned the chapter by then.",
      "verb": "learned"
    },
    {
      "sentence": "The teacher will have talked the teacher by then.",
      "verb": "talked"
    },
    {
      "sentence": "The company will have finished the task by next week.",
      "verb": "finished"
    },
    {
      "sentence": "My friend will have designed a website by next year.",
      "verb": "designed"
    },
    {
      "sentence": "The children will have enjoyed a song by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The teacher will have listened to TV by then.",
      "verb": "listened"
    },
    {
      "sentence": "The teacher will have completed the proposal by tonight.",
      "verb": "completed"
    },
    {
      "sentence": "By later, they will have thought about the decision.",
      "verb": "thought"
    },
    {
      "sentence": "My parents will have called the neighbors by then.",
      "verb": "called"
    },
    {
      "sentence": "The company will have written the document by next year.",
      "verb": "written"
    },
    {
      "sentence": "I will have sold a book by tomorrow.",
      "verb": "sold"
    },
    {
      "sentence": "By next year, you will have remembered the meeting.",
      "verb": "remembered"
    },
    {
      "sentence": "John will have submitted the report by then.",
      "verb": "submitted"
    },
    {
      "sentence": "They will have watched a song by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "By soon, we will have made soup.",
      "verb": "made"
    },
    {
      "sentence": "They will have remembered the meeting by then.",
      "verb": "remembered"
    },
    {
      "sentence": "He will have drawn the bathroom by in two days.",
      "verb": "drawn"
    },
    {
      "sentence": "By later, john will have understood English.",
      "verb": "understood"
    },
    {
      "sentence": "The students will have visited my parents by soon.",
      "verb": "visited"
    },
    {
      "sentence": "The students will have written the report by then.",
      "verb": "written"
    },
    {
      "sentence": "Emma will have painted the bathroom by then.",
      "verb": "painted"
    },
    {
      "sentence": "By next month, my brother will have called my parents.",
      "verb": "called"
    },
    {
      "sentence": "Emma will have received the assignment by tomorrow.",
      "verb": "received"
    },
    {
      "sentence": "The dog will have submitted the contract by later.",
      "verb": "submitted"
    },
    {
      "sentence": "The cat will have watched a video by tomorrow.",
      "verb": "watched"
    },
    {
      "sentence": "They will have cleaned the car by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "The bird will have remembered the event by next month.",
      "verb": "remembered"
    },
    {
      "sentence": "Our neighbors will have ordered a snack by then.",
      "verb": "ordered"
    },
    {
      "sentence": "John will have thought about the event by later.",
      "verb": "thought"
    },
    {
      "sentence": "Emma will have drunk soup by tomorrow.",
      "verb": "drunk"
    },
    {
      "sentence": "By tonight, they will have planned the vacation.",
      "verb": "planned"
    },
    {
      "sentence": "You will have arrived to the park by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The cat will have built the room by soon.",
      "verb": "built"
    },
    {
      "sentence": "The students will have remembered the event by then.",
      "verb": "remembered"
    },
    {
      "sentence": "My brother will have bought a gift by then.",
      "verb": "bought"
    },
    {
      "sentence": "Her sister will have understood for the exam by soon.",
      "verb": "understood"
    },
    {
      "sentence": "Emma will have walked to the store by tonight.",
      "verb": "walked"
    },
    {
      "sentence": "By tomorrow, my friend will have given the ticket.",
      "verb": "given"
    },
    {
      "sentence": "John will have read grammar by this weekend.",
      "verb": "read"
    },
    {
      "sentence": "Our neighbors will have forgotten the decision by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "The teacher will have remembered the future by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "Tom will have understood science by next month.",
      "verb": "understood"
    },
    {
      "sentence": "The children will have considered the decision by this weekend.",
      "verb": "considered"
    },
    {
      "sentence": "The bird will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, john will have gotten the ticket.",
      "verb": "gotten"
    },
    {
      "sentence": "He will have spoken my parents by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The students will have listened to the game by then.",
      "verb": "listened"
    },
    {
      "sentence": "By tomorrow, the bird will have gone to work.",
      "verb": "gone"
    },
    {
      "sentence": "The teacher will have remembered the future by later.",
      "verb": "remembered"
    },
    {
      "sentence": "The team will have gone to the gym by tonight.",
      "verb": "gone"
    },
    {
      "sentence": "John will have completed the task by next week.",
      "verb": "completed"
    },
    {
      "sentence": "My brother will have sent the report by then.",
      "verb": "sent"
    },
    {
      "sentence": "The dog will have understood English by next week.",
      "verb": "understood"
    },
    {
      "sentence": "Emma will have met my friend by next month.",
      "verb": "met"
    },
    {
      "sentence": "John will have walked to the park by then.",
      "verb": "walked"
    },
    {
      "sentence": "My friend will have visited my parents by later.",
      "verb": "visited"
    },
    {
      "sentence": "John will have given the phone by then.",
      "verb": "given"
    },
    {
      "sentence": "By tomorrow, you will have considered the event.",
      "verb": "considered"
    },
    {
      "sentence": "By next week, the teacher will have visited the manager.",
      "verb": "visited"
    },
    {
      "sentence": "Her sister will have gone to the beach by then.",
      "verb": "gone"
    },
    {
      "sentence": "They will have cooked a snack by next month.",
      "verb": "cooked"
    },
    {
      "sentence": "By next month, our neighbors will have cooked pasta.",
      "verb": "cooked"
    },
    {
      "sentence": "By this weekend, john will have found a present.",
      "verb": "found"
    },
    {
      "sentence": "Her sister will have drunk soup by then.",
      "verb": "drunk"
    },
    {
      "sentence": "We will have arrived to the beach by in two days.",
      "verb": "arrived"
    },
    {
      "sentence": "By next week, emma will have cleaned the house.",
      "verb": "cleaned"
    },
    {
      "sentence": "Our neighbors will have eaten pasta by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "They will have learned Spanish by then.",
      "verb": "learned"
    },
    {
      "sentence": "Emma will have taught grammar by soon.",
      "verb": "taught"
    },
    {
      "sentence": "By this weekend, she will have cooked breakfast.",
      "verb": "cooked"
    },
    {
      "sentence": "My parents will have run to the store by then.",
      "verb": "run"
    },
    {
      "sentence": "You will have taught English by then.",
      "verb": "taught"
    },
    {
      "sentence": "We will have chosen flowers by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By next year, the bird will have driven to the store.",
      "verb": "driven"
    },
    {
      "sentence": "By next year, i will have submitted the presentation.",
      "verb": "submitted"
    },
    {
      "sentence": "The cat will have remembered the situation by then.",
      "verb": "remembered"
    },
    {
      "sentence": "My friend will have come to the gym by in two days.",
      "verb": "come"
    },
    {
      "sentence": "The team will have received the contract by then.",
      "verb": "received"
    },
    {
      "sentence": "We will have found the ticket by tomorrow.",
      "verb": "found"
    },
    {
      "sentence": "My brother will have taught mathematics by this weekend.",
      "verb": "taught"
    },
    {
      "sentence": "By next year, he will have considered the meeting.",
      "verb": "considered"
    },
    {
      "sentence": "By next year, her sister will have called the boss.",
      "verb": "called"
    },
    {
      "sentence": "The children will have started the letter by then.",
      "verb": "started"
    },
    {
      "sentence": "By in two days, the company will have remembered the vacation.",
      "verb": "remembered"
    },
    {
      "sentence": "Emma will have built a website by then.",
      "verb": "built"
    },
    {
      "sentence": "Sarah will have planned the options by soon.",
      "verb": "planned"
    },
    {
      "sentence": "John will have sent the contract by next year.",
      "verb": "sent"
    },
    {
      "sentence": "By next month, he will have made pizza.",
      "verb": "made"
    },
    {
      "sentence": "The bird will have finished the contract by this weekend.",
      "verb": "finished"
    },
    {
      "sentence": "We will have forgotten the birthday by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "We will have gone to the market by then.",
      "verb": "gone"
    },
    {
      "sentence": "Her sister will have designed the furniture by next year.",
      "verb": "designed"
    },
    {
      "sentence": "The team will have met my friend by later.",
      "verb": "met"
    },
    {
      "sentence": "By tomorrow, he will have received the letter.",
      "verb": "received"
    },
    {
      "sentence": "By this weekend, tom will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "The company will have walked to the office by then.",
      "verb": "walked"
    },
    {
      "sentence": "By this evening, he will have made pasta.",
      "verb": "made"
    },
    {
      "sentence": "My brother will have prepared juice by tonight.",
      "verb": "prepared"
    },
    {
      "sentence": "By this evening, the children will have watched TV.",
      "verb": "watched"
    },
    {
      "sentence": "My parents will have planned the problem by then.",
      "verb": "planned"
    },
    {
      "sentence": "By next year, i will have drawn the garden.",
      "verb": "drawn"
    },
    {
      "sentence": "By tomorrow, she will have fixed the kitchen.",
      "verb": "fixed"
    },
    {
      "sentence": "The manager will have visited my family by then.",
      "verb": "visited"
    },
    {
      "sentence": "By in two days, we will have made juice.",
      "verb": "made"
    },
    {
      "sentence": "The students will have drawn the car by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By tonight, they will have bought a gift.",
      "verb": "bought"
    },
    {
      "sentence": "Sarah will have played a documentary by next year.",
      "verb": "played"
    },
    {
      "sentence": "The children will have contacted my friend by then.",
      "verb": "contacted"
    },
    {
      "sentence": "The cat will have talked my friend by then.",
      "verb": "talked"
    },
    {
      "sentence": "My brother will have watched a song by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next week, the cat will have eaten a salad.",
      "verb": "eaten"
    },
    {
      "sentence": "By soon, you will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "By this evening, the manager will have made breakfast.",
      "verb": "made"
    },
    {
      "sentence": "Sarah will have arrived downtown by this evening.",
      "verb": "arrived"
    },
    {
      "sentence": "The cat will have given a gift by this evening.",
      "verb": "given"
    },
    {
      "sentence": "John will have repaired the bathroom by tonight.",
      "verb": "repaired"
    },
    {
      "sentence": "I will have eaten juice by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "The cat will have walked to the library by soon.",
      "verb": "walked"
    },
    {
      "sentence": "By later, the manager will have found the keys.",
      "verb": "found"
    },
    {
      "sentence": "By next week, her sister will have watched the game.",
      "verb": "watched"
    },
    {
      "sentence": "The team will have sent the assignment by then.",
      "verb": "sent"
    },
    {
      "sentence": "The students will have planned the problem by then.",
      "verb": "planned"
    },
    {
      "sentence": "By in two days, john will have played the game.",
      "verb": "played"
    },
    {
      "sentence": "By next week, she will have reviewed science.",
      "verb": "reviewed"
    },
    {
      "sentence": "The manager will have remembered the options by then.",
      "verb": "remembered"
    },
    {
      "sentence": "The team will have submitted the project by then.",
      "verb": "submitted"
    },
    {
      "sentence": "The dog will have read Spanish by then.",
      "verb": "read"
    },
    {
      "sentence": "The cat will have studied the lesson by this evening.",
      "verb": "studied"
    },
    {
      "sentence": "By tonight, he will have bought the phone.",
      "verb": "bought"
    },
    {
      "sentence": "By next month, the team will have played the news.",
      "verb": "played"
    },
    {
      "sentence": "Her sister will have considered the future by then.",
      "verb": "considered"
    },
    {
      "sentence": "My brother will have walked to the market by then.",
      "verb": "walked"
    },
    {
      "sentence": "By in two days, the company will have talked the teacher.",
      "verb": "talked"
    },
    {
      "sentence": "Our neighbors will have eaten pasta by next month.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have designed the computer by then.",
      "verb": "designed"
    },
    {
      "sentence": "Our neighbors will have taught Spanish by then.",
      "verb": "taught"
    },
    {
      "sentence": "The cat will have gone to the store by then.",
      "verb": "gone"
    },
    {
      "sentence": "By tonight, her sister will have forgotten the options.",
      "verb": "forgotten"
    },
    {
      "sentence": "She will have thought about the trip by in two days.",
      "verb": "thought"
    },
    {
      "sentence": "The dog will have contacted the teacher by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By in two days, the teacher will have contacted the client.",
      "verb": "contacted"
    },
    {
      "sentence": "The children will have planned the birthday by then.",
      "verb": "planned"
    },
    {
      "sentence": "By later, my parents will have forgotten the options.",
      "verb": "forgotten"
    },
    {
      "sentence": "The dog will have drawn a website by then.",
      "verb": "drawn"
    },
    {
      "sentence": "My brother will have considered the problem by then.",
      "verb": "considered"
    },
    {
      "sentence": "The team will have reviewed for the exam by this weekend.",
      "verb": "reviewed"
    },
    {
      "sentence": "By this evening, you will have drunk a snack.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have eaten soup by later.",
      "verb": "eaten"
    },
    {
      "sentence": "By tomorrow, he will have designed the car.",
      "verb": "designed"
    },
    {
      "sentence": "He will have watched a song by then.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, the students will have eaten tea.",
      "verb": "eaten"
    },
    {
      "sentence": "The dog will have visited my family by then.",
      "verb": "visited"
    },
    {
      "sentence": "My parents will have watched a video by then.",
      "verb": "watched"
    },
    {
      "sentence": "By soon, i will have drunk tea.",
      "verb": "drunk"
    },
    {
      "sentence": "By next year, my parents will have understood for the exam.",
      "verb": "understood"
    },
    {
      "sentence": "By this weekend, my parents will have gone to school.",
      "verb": "gone"
    },
    {
      "sentence": "By later, she will have sold flowers.",
      "verb": "sold"
    },
    {
      "sentence": "By later, the bird will have enjoyed a movie.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next year, you will have considered the future.",
      "verb": "considered"
    },
    {
      "sentence": "By next month, i will have sold a book.",
      "verb": "sold"
    },
    {
      "sentence": "By tonight, sarah will have visited the client.",
      "verb": "visited"
    },
    {
      "sentence": "My parents will have completed the presentation by next week.",
      "verb": "completed"
    },
    {
      "sentence": "The children will have taught French by tonight.",
      "verb": "taught"
    },
    {
      "sentence": "The bird will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have started the presentation by tonight.",
      "verb": "started"
    },
    {
      "sentence": "The cat will have left to the store by then.",
      "verb": "left"
    },
    {
      "sentence": "You will have enjoyed a song by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, the manager will have planned the future.",
      "verb": "planned"
    },
    {
      "sentence": "Sarah will have played a song by then.",
      "verb": "played"
    },
    {
      "sentence": "By later, we will have learned history.",
      "verb": "learned"
    },
    {
      "sentence": "By next year, our neighbors will have played football.",
      "verb": "played"
    },
    {
      "sentence": "I will have chosen the keys by next week.",
      "verb": "chosen"
    },
    {
      "sentence": "The company will have listened to the game by next week.",
      "verb": "listened"
    },
    {
      "sentence": "The students will have played TV by then.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have planned the vacation by this evening.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, the team will have painted the room.",
      "verb": "painted"
    },
    {
      "sentence": "They will have completed the proposal by next year.",
      "verb": "completed"
    },
    {
      "sentence": "By this evening, sarah will have enjoyed TV.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, you will have visited the team.",
      "verb": "visited"
    },
    {
      "sentence": "He will have played a movie by then.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, the bird will have ordered dinner.",
      "verb": "ordered"
    },
    {
      "sentence": "By tomorrow, our neighbors will have forgotten the meeting.",
      "verb": "forgotten"
    },
    {
      "sentence": "The company will have planned the event by next year.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, you will have studied Spanish.",
      "verb": "studied"
    },
    {
      "sentence": "By this weekend, you will have drunk a snack.",
      "verb": "drunk"
    },
    {
      "sentence": "The children will have remembered the vacation by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "Emma will have forgotten the situation by next month.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tonight, the teacher will have played a video.",
      "verb": "played"
    },
    {
      "sentence": "The team will have forgotten the future by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "She will have made tea by then.",
      "verb": "made"
    },
    {
      "sentence": "By this weekend, they will have repaired the house.",
      "verb": "repaired"
    },
    {
      "sentence": "John will have built the garden by next year.",
      "verb": "built"
    },
    {
      "sentence": "We will have enjoyed music by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, tom will have designed the kitchen.",
      "verb": "designed"
    },
    {
      "sentence": "Our neighbors will have arrived to work by then.",
      "verb": "arrived"
    },
    {
      "sentence": "My parents will have sent the proposal by soon.",
      "verb": "sent"
    },
    {
      "sentence": "Tom will have come home by then.",
      "verb": "come"
    },
    {
      "sentence": "The dog will have painted the house by later.",
      "verb": "painted"
    },
    {
      "sentence": "By later, my parents will have remembered the problem.",
      "verb": "remembered"
    },
    {
      "sentence": "By next month, my friend will have practiced the chapter.",
      "verb": "practiced"
    },
    {
      "sentence": "You will have received the presentation by then.",
      "verb": "received"
    },
    {
      "sentence": "My parents will have chosen the phone by then.",
      "verb": "chosen"
    },
    {
      "sentence": "The dog will have repaired the garden by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, he will have ordered tea.",
      "verb": "ordered"
    },
    {
      "sentence": "He will have visited my parents by this weekend.",
      "verb": "visited"
    },
    {
      "sentence": "The cat will have made lunch by then.",
      "verb": "made"
    },
    {
      "sentence": "By this evening, the children will have given groceries.",
      "verb": "given"
    },
    {
      "sentence": "By later, he will have cooked breakfast.",
      "verb": "cooked"
    },
    {
      "sentence": "My friend will have planned the decision by then.",
      "verb": "planned"
    },
    {
      "sentence": "The cat will have practiced vocabulary by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The team will have eaten tea by then.",
      "verb": "eaten"
    },
    {
      "sentence": "She will have watched basketball by then.",
      "verb": "watched"
    },
    {
      "sentence": "The manager will have finished the email by later.",
      "verb": "finished"
    },
    {
      "sentence": "By next month, john will have ordered coffee.",
      "verb": "ordered"
    },
    {
      "sentence": "By tomorrow, emma will have practiced history.",
      "verb": "practiced"
    },
    {
      "sentence": "The children will have fixed the bathroom by next week.",
      "verb": "fixed"
    },
    {
      "sentence": "By in two days, i will have eaten pasta.",
      "verb": "eaten"
    },
    {
      "sentence": "The teacher will have sold a book by next month.",
      "verb": "sold"
    },
    {
      "sentence": "The bird will have bought a book by then.",
      "verb": "bought"
    },
    {
      "sentence": "I will have enjoyed basketball by next year.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The team will have drawn a picture by next week.",
      "verb": "drawn"
    },
    {
      "sentence": "By soon, emma will have enjoyed tea.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My parents will have driven downtown by then.",
      "verb": "driven"
    },
    {
      "sentence": "John will have sold clothes by in two days.",
      "verb": "sold"
    },
    {
      "sentence": "I will have learned mathematics by then.",
      "verb": "learned"
    },
    {
      "sentence": "By next year, the children will have gotten the ticket.",
      "verb": "gotten"
    },
    {
      "sentence": "Sarah will have called the boss by then.",
      "verb": "called"
    },
    {
      "sentence": "My friend will have given clothes by next month.",
      "verb": "given"
    },
    {
      "sentence": "We will have contacted my family by then.",
      "verb": "contacted"
    },
    {
      "sentence": "My friend will have repaired a website by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "My parents will have spoken the neighbors by next week.",
      "verb": "spoken"
    },
    {
      "sentence": "Her sister will have studied mathematics by this evening.",
      "verb": "studied"
    },
    {
      "sentence": "My brother will have written the contract by tonight.",
      "verb": "written"
    },
    {
      "sentence": "By soon, i will have driven to the park.",
      "verb": "driven"
    },
    {
      "sentence": "The children will have enjoyed soup by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Our neighbors will have arrived to the library by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The teacher will have enjoyed music by soon.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The manager will have watched football by then.",
      "verb": "watched"
    },
    {
      "sentence": "You will have painted the furniture by then.",
      "verb": "painted"
    },
    {
      "sentence": "John will have found clothes by next week.",
      "verb": "found"
    },
    {
      "sentence": "Sarah will have returned to the beach by then.",
      "verb": "returned"
    },
    {
      "sentence": "By this weekend, the bird will have talked my friend.",
      "verb": "talked"
    },
    {
      "sentence": "She will have designed the furniture by then.",
      "verb": "designed"
    },
    {
      "sentence": "John will have considered the future by this weekend.",
      "verb": "considered"
    },
    {
      "sentence": "By this evening, my parents will have designed the room.",
      "verb": "designed"
    },
    {
      "sentence": "Sarah will have cleaned the furniture by next year.",
      "verb": "cleaned"
    },
    {
      "sentence": "They will have submitted the contract by then.",
      "verb": "submitted"
    },
    {
      "sentence": "You will have watched a song by then.",
      "verb": "watched"
    },
    {
      "sentence": "Emma will have enjoyed tennis by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next week, the teacher will have received the letter.",
      "verb": "received"
    },
    {
      "sentence": "The bird will have understood the textbook by in two days.",
      "verb": "understood"
    },
    {
      "sentence": "Our neighbors will have submitted the presentation by then.",
      "verb": "submitted"
    },
    {
      "sentence": "She will have practiced Spanish by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The company will have reviewed the chapter by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "By next month, emma will have gotten a book.",
      "verb": "gotten"
    },
    {
      "sentence": "We will have returned to the beach by then.",
      "verb": "returned"
    },
    {
      "sentence": "By next year, the teacher will have bought flowers.",
      "verb": "bought"
    },
    {
      "sentence": "By next week, my parents will have sent the email.",
      "verb": "sent"
    },
    {
      "sentence": "By soon, my parents will have practiced the textbook.",
      "verb": "practiced"
    },
    {
      "sentence": "By later, the manager will have thought about the decision.",
      "verb": "thought"
    },
    {
      "sentence": "Tom will have thought about the decision by later.",
      "verb": "thought"
    },
    {
      "sentence": "We will have learned French by then.",
      "verb": "learned"
    },
    {
      "sentence": "By this evening, they will have fixed the car.",
      "verb": "fixed"
    },
    {
      "sentence": "My friend will have come to the library by this weekend.",
      "verb": "come"
    },
    {
      "sentence": "He will have designed the computer by then.",
      "verb": "designed"
    },
    {
      "sentence": "By next week, the company will have cooked breakfast.",
      "verb": "cooked"
    },
    {
      "sentence": "By this evening, the company will have visited the teacher.",
      "verb": "visited"
    },
    {
      "sentence": "By later, they will have practiced Spanish.",
      "verb": "practiced"
    },
    {
      "sentence": "You will have prepared pizza by in two days.",
      "verb": "prepared"
    },
    {
      "sentence": "They will have remembered the problem by tonight.",
      "verb": "remembered"
    },
    {
      "sentence": "By soon, we will have taught grammar.",
      "verb": "taught"
    },
    {
      "sentence": "She will have cooked dinner by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By next year, my brother will have left home.",
      "verb": "left"
    },
    {
      "sentence": "The students will have contacted the client by then.",
      "verb": "contacted"
    },
    {
      "sentence": "You will have eaten dinner by tonight.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have cleaned the room by this evening.",
      "verb": "cleaned"
    },
    {
      "sentence": "We will have enjoyed the news by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, the children will have visited the teacher.",
      "verb": "visited"
    },
    {
      "sentence": "Sarah will have played music by next month.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, the manager will have learned English.",
      "verb": "learned"
    },
    {
      "sentence": "The team will have arrived to school by then.",
      "verb": "arrived"
    },
    {
      "sentence": "She will have designed the computer by then.",
      "verb": "designed"
    },
    {
      "sentence": "By in two days, the manager will have written the document.",
      "verb": "written"
    },
    {
      "sentence": "The cat will have played music by then.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have built the room by tomorrow.",
      "verb": "built"
    },
    {
      "sentence": "My friend will have understood history by this weekend.",
      "verb": "understood"
    },
    {
      "sentence": "By next week, i will have taught French.",
      "verb": "taught"
    },
    {
      "sentence": "By tomorrow, the cat will have reviewed history.",
      "verb": "reviewed"
    },
    {
      "sentence": "Our neighbors will have practiced vocabulary by then.",
      "verb": "practiced"
    },
    {
      "sentence": "By this evening, my brother will have driven to the market.",
      "verb": "driven"
    },
    {
      "sentence": "You will have sent the letter by then.",
      "verb": "sent"
    },
    {
      "sentence": "Emma will have practiced the lesson by next month.",
      "verb": "practiced"
    },
    {
      "sentence": "My friend will have eaten a sandwich by then.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have forgotten the event by tonight.",
      "verb": "forgotten"
    },
    {
      "sentence": "We will have repaired a website by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By soon, they will have eaten a snack.",
      "verb": "eaten"
    },
    {
      "sentence": "My friend will have forgotten the situation by in two days.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tomorrow, i will have forgotten the options.",
      "verb": "forgotten"
    },
    {
      "sentence": "Emma will have fixed the kitchen by then.",
      "verb": "fixed"
    },
    {
      "sentence": "My parents will have enjoyed dinner by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "They will have enjoyed coffee by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, my brother will have gone to school.",
      "verb": "gone"
    },
    {
      "sentence": "The company will have written the document by then.",
      "verb": "written"
    },
    {
      "sentence": "By later, they will have arrived downtown.",
      "verb": "arrived"
    },
    {
      "sentence": "My parents will have fixed the bathroom by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By this weekend, he will have fixed the car.",
      "verb": "fixed"
    },
    {
      "sentence": "By next month, tom will have watched tennis.",
      "verb": "watched"
    },
    {
      "sentence": "We will have thought about the meeting by in two days.",
      "verb": "thought"
    },
    {
      "sentence": "Her sister will have taught vocabulary by tonight.",
      "verb": "taught"
    },
    {
      "sentence": "The team will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "The cat will have understood for the exam by then.",
      "verb": "understood"
    },
    {
      "sentence": "They will have enjoyed pasta by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "John will have given groceries by in two days.",
      "verb": "given"
    },
    {
      "sentence": "By next year, the children will have arrived to school.",
      "verb": "arrived"
    },
    {
      "sentence": "My friend will have spoken my parents by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The students will have watched TV by next year.",
      "verb": "watched"
    },
    {
      "sentence": "The children will have contacted the client by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By next year, we will have reviewed Spanish.",
      "verb": "reviewed"
    },
    {
      "sentence": "Tom will have sent the task by this weekend.",
      "verb": "sent"
    },
    {
      "sentence": "The manager will have bought the keys by later.",
      "verb": "bought"
    },
    {
      "sentence": "By tonight, he will have talked the teacher.",
      "verb": "talked"
    },
    {
      "sentence": "Tom will have driven to the store by later.",
      "verb": "driven"
    },
    {
      "sentence": "John will have thought about the vacation by then.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, i will have thought about the future.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, the team will have made dinner.",
      "verb": "made"
    },
    {
      "sentence": "The manager will have run home by in two days.",
      "verb": "run"
    },
    {
      "sentence": "My brother will have ordered a snack by tonight.",
      "verb": "ordered"
    },
    {
      "sentence": "The bird will have spoken the doctor by tonight.",
      "verb": "spoken"
    },
    {
      "sentence": "By later, our neighbors will have remembered the meeting.",
      "verb": "remembered"
    },
    {
      "sentence": "The company will have talked my parents by then.",
      "verb": "talked"
    },
    {
      "sentence": "Her sister will have enjoyed a video by soon.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The children will have cleaned the computer by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "By tonight, emma will have bought flowers.",
      "verb": "bought"
    },
    {
      "sentence": "Her sister will have completed the document by then.",
      "verb": "completed"
    },
    {
      "sentence": "John will have thought about the problem by then.",
      "verb": "thought"
    },
    {
      "sentence": "The dog will have repaired the bathroom by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The bird will have drunk soup by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By this evening, he will have driven to the beach.",
      "verb": "driven"
    },
    {
      "sentence": "By tonight, the bird will have received the contract.",
      "verb": "received"
    },
    {
      "sentence": "They will have talked the neighbors by then.",
      "verb": "talked"
    },
    {
      "sentence": "John will have fixed a picture by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The children will have run to the market by then.",
      "verb": "run"
    },
    {
      "sentence": "John will have forgotten the birthday by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By soon, the students will have sold clothes.",
      "verb": "sold"
    },
    {
      "sentence": "Sarah will have enjoyed a song by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The team will have studied the chapter by next year.",
      "verb": "studied"
    },
    {
      "sentence": "Tom will have practiced English by then.",
      "verb": "practiced"
    },
    {
      "sentence": "By next week, the cat will have sold flowers.",
      "verb": "sold"
    },
    {
      "sentence": "Tom will have repaired the house by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, emma will have taught vocabulary.",
      "verb": "taught"
    },
    {
      "sentence": "They will have practiced Spanish by next month.",
      "verb": "practiced"
    },
    {
      "sentence": "By next week, the team will have considered the decision.",
      "verb": "considered"
    },
    {
      "sentence": "We will have played a song by next year.",
      "verb": "played"
    },
    {
      "sentence": "You will have contacted the doctor by next year.",
      "verb": "contacted"
    },
    {
      "sentence": "By next month, my parents will have drawn the bathroom.",
      "verb": "drawn"
    },
    {
      "sentence": "By in two days, john will have remembered the problem.",
      "verb": "remembered"
    },
    {
      "sentence": "The dog will have talked the boss by next month.",
      "verb": "talked"
    },
    {
      "sentence": "He will have run to the park by then.",
      "verb": "run"
    },
    {
      "sentence": "They will have left to work by then.",
      "verb": "left"
    },
    {
      "sentence": "By next week, tom will have talked my parents.",
      "verb": "talked"
    },
    {
      "sentence": "The students will have left to the library by then.",
      "verb": "left"
    },
    {
      "sentence": "The manager will have received the proposal by later.",
      "verb": "received"
    },
    {
      "sentence": "The team will have cooked pasta by tonight.",
      "verb": "cooked"
    },
    {
      "sentence": "The teacher will have ordered soup by then.",
      "verb": "ordered"
    },
    {
      "sentence": "You will have bought a present by later.",
      "verb": "bought"
    },
    {
      "sentence": "We will have listened to a video by this weekend.",
      "verb": "listened"
    },
    {
      "sentence": "Emma will have met the boss by later.",
      "verb": "met"
    },
    {
      "sentence": "I will have prepared dinner by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The manager will have cooked pasta by this evening.",
      "verb": "cooked"
    },
    {
      "sentence": "He will have come downtown by then.",
      "verb": "come"
    },
    {
      "sentence": "You will have learned English by then.",
      "verb": "learned"
    },
    {
      "sentence": "My brother will have repaired the kitchen by next week.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, john will have completed the presentation.",
      "verb": "completed"
    },
    {
      "sentence": "John will have talked the doctor by then.",
      "verb": "talked"
    },
    {
      "sentence": "The cat will have started the report by tomorrow.",
      "verb": "started"
    },
    {
      "sentence": "The team will have listened to tennis by later.",
      "verb": "listened"
    },
    {
      "sentence": "Emma will have contacted the teacher by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By this evening, the teacher will have met the boss.",
      "verb": "met"
    },
    {
      "sentence": "Emma will have built the furniture by next month.",
      "verb": "built"
    },
    {
      "sentence": "By this weekend, the manager will have remembered the future.",
      "verb": "remembered"
    },
    {
      "sentence": "My friend will have ordered dinner by then.",
      "verb": "ordered"
    },
    {
      "sentence": "My parents will have learned French by later.",
      "verb": "learned"
    },
    {
      "sentence": "My parents will have watched tennis by soon.",
      "verb": "watched"
    },
    {
      "sentence": "Sarah will have reviewed the lesson by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "Her sister will have submitted the presentation by in two days.",
      "verb": "submitted"
    },
    {
      "sentence": "The dog will have drunk a salad by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Emma will have finished the project by this evening.",
      "verb": "finished"
    },
    {
      "sentence": "John will have cleaned the car by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "By next month, the students will have come to the airport.",
      "verb": "come"
    },
    {
      "sentence": "The dog will have run to work by this weekend.",
      "verb": "run"
    },
    {
      "sentence": "I will have cooked tea by then.",
      "verb": "cooked"
    },
    {
      "sentence": "The children will have built the house by then.",
      "verb": "built"
    },
    {
      "sentence": "The teacher will have bought groceries by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "Sarah will have remembered the situation by then.",
      "verb": "remembered"
    },
    {
      "sentence": "My friend will have gone to the office by then.",
      "verb": "gone"
    },
    {
      "sentence": "The students will have sent the assignment by then.",
      "verb": "sent"
    },
    {
      "sentence": "The children will have ordered juice by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By next year, tom will have found clothes.",
      "verb": "found"
    },
    {
      "sentence": "Our neighbors will have written the project by this weekend.",
      "verb": "written"
    },
    {
      "sentence": "By this evening, the teacher will have spoken the teacher.",
      "verb": "spoken"
    },
    {
      "sentence": "Emma will have learned English by this weekend.",
      "verb": "learned"
    },
    {
      "sentence": "The company will have met the neighbors by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "By tomorrow, sarah will have cleaned the house.",
      "verb": "cleaned"
    },
    {
      "sentence": "I will have remembered the problem by next year.",
      "verb": "remembered"
    },
    {
      "sentence": "By next year, the dog will have finished the report.",
      "verb": "finished"
    },
    {
      "sentence": "By soon, they will have drunk pizza.",
      "verb": "drunk"
    },
    {
      "sentence": "Emma will have enjoyed a video by later.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, the company will have enjoyed a movie.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, emma will have gotten the phone.",
      "verb": "gotten"
    },
    {
      "sentence": "You will have talked the team by then.",
      "verb": "talked"
    },
    {
      "sentence": "By tomorrow, you will have enjoyed the news.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The bird will have walked to the market by next month.",
      "verb": "walked"
    },
    {
      "sentence": "John will have eaten lunch by then.",
      "verb": "eaten"
    },
    {
      "sentence": "My brother will have started the report by then.",
      "verb": "started"
    },
    {
      "sentence": "My parents will have played tennis by next year.",
      "verb": "played"
    },
    {
      "sentence": "Her sister will have gotten a present by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The cat will have fixed a website by then.",
      "verb": "fixed"
    },
    {
      "sentence": "Her sister will have bought flowers by this weekend.",
      "verb": "bought"
    },
    {
      "sentence": "My parents will have thought about the decision by then.",
      "verb": "thought"
    },
    {
      "sentence": "By next week, we will have spoken the doctor.",
      "verb": "spoken"
    },
    {
      "sentence": "The children will have reviewed the chapter by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "They will have left downtown by then.",
      "verb": "left"
    },
    {
      "sentence": "The team will have studied the textbook by next year.",
      "verb": "studied"
    },
    {
      "sentence": "The company will have cooked coffee by then.",
      "verb": "cooked"
    },
    {
      "sentence": "The company will have spoken the teacher by then.",
      "verb": "spoken"
    },
    {
      "sentence": "My friend will have given the keys by soon.",
      "verb": "given"
    },
    {
      "sentence": "By in two days, my brother will have learned history.",
      "verb": "learned"
    },
    {
      "sentence": "The company will have fixed the garden by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By in two days, the teacher will have sold the phone.",
      "verb": "sold"
    },
    {
      "sentence": "The bird will have repaired the car by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The children will have played music by then.",
      "verb": "played"
    },
    {
      "sentence": "By tonight, my friend will have played a song.",
      "verb": "played"
    },
    {
      "sentence": "They will have fixed a picture by then.",
      "verb": "fixed"
    },
    {
      "sentence": "My parents will have drunk soup by then.",
      "verb": "drunk"
    },
    {
      "sentence": "We will have planned the birthday by then.",
      "verb": "planned"
    },
    {
      "sentence": "By this evening, you will have practiced the chapter.",
      "verb": "practiced"
    },
    {
      "sentence": "The teacher will have enjoyed coffee by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, they will have written the project.",
      "verb": "written"
    },
    {
      "sentence": "The dog will have left to the airport by then.",
      "verb": "left"
    },
    {
      "sentence": "Her sister will have sold the ticket by then.",
      "verb": "sold"
    },
    {
      "sentence": "By soon, the students will have designed the house.",
      "verb": "designed"
    },
    {
      "sentence": "The manager will have completed the proposal by then.",
      "verb": "completed"
    },
    {
      "sentence": "The company will have remembered the trip by later.",
      "verb": "remembered"
    },
    {
      "sentence": "By tonight, my brother will have chosen flowers.",
      "verb": "chosen"
    },
    {
      "sentence": "The team will have gotten a gift by tomorrow.",
      "verb": "gotten"
    },
    {
      "sentence": "Her sister will have gotten a book by tomorrow.",
      "verb": "gotten"
    },
    {
      "sentence": "The teacher will have watched music by then.",
      "verb": "watched"
    },
    {
      "sentence": "By later, you will have arrived to the airport.",
      "verb": "arrived"
    },
    {
      "sentence": "The children will have given a book by then.",
      "verb": "given"
    },
    {
      "sentence": "My parents will have arrived to the store by then.",
      "verb": "arrived"
    },
    {
      "sentence": "You will have spoken the teacher by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The team will have enjoyed basketball by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this evening, the manager will have chosen clothes.",
      "verb": "chosen"
    },
    {
      "sentence": "I will have run downtown by then.",
      "verb": "run"
    },
    {
      "sentence": "Our neighbors will have submitted the email by tomorrow.",
      "verb": "submitted"
    },
    {
      "sentence": "By tomorrow, tom will have prepared dinner.",
      "verb": "prepared"
    },
    {
      "sentence": "The company will have submitted the email by then.",
      "verb": "submitted"
    },
    {
      "sentence": "He will have thought about the birthday by tonight.",
      "verb": "thought"
    },
    {
      "sentence": "By tonight, the manager will have arrived downtown.",
      "verb": "arrived"
    },
    {
      "sentence": "By this weekend, the teacher will have given a gift.",
      "verb": "given"
    },
    {
      "sentence": "The manager will have considered the vacation by then.",
      "verb": "considered"
    },
    {
      "sentence": "She will have drawn a picture by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By this evening, the children will have talked the neighbors.",
      "verb": "talked"
    },
    {
      "sentence": "He will have played a movie by this weekend.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have painted the kitchen by then.",
      "verb": "painted"
    },
    {
      "sentence": "John will have listened to a song by later.",
      "verb": "listened"
    },
    {
      "sentence": "By in two days, the dog will have driven to work.",
      "verb": "driven"
    },
    {
      "sentence": "She will have cleaned the kitchen by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "By this weekend, my friend will have prepared breakfast.",
      "verb": "prepared"
    },
    {
      "sentence": "My friend will have arrived to the park by next week.",
      "verb": "arrived"
    },
    {
      "sentence": "Her sister will have built the garden by soon.",
      "verb": "built"
    },
    {
      "sentence": "My brother will have forgotten the trip by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By next year, the students will have built the house.",
      "verb": "built"
    },
    {
      "sentence": "John will have called my family by then.",
      "verb": "called"
    },
    {
      "sentence": "By tomorrow, i will have returned to the library.",
      "verb": "returned"
    },
    {
      "sentence": "By next month, my friend will have received the report.",
      "verb": "received"
    },
    {
      "sentence": "The dog will have bought the ticket by then.",
      "verb": "bought"
    },
    {
      "sentence": "The students will have bought a laptop by then.",
      "verb": "bought"
    },
    {
      "sentence": "The students will have cleaned the car by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "My brother will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, my friend will have visited my family.",
      "verb": "visited"
    },
    {
      "sentence": "The students will have made pasta by later.",
      "verb": "made"
    },
    {
      "sentence": "By next week, john will have drunk a snack.",
      "verb": "drunk"
    },
    {
      "sentence": "My brother will have gone to the park by then.",
      "verb": "gone"
    },
    {
      "sentence": "We will have played a movie by in two days.",
      "verb": "played"
    },
    {
      "sentence": "You will have enjoyed a podcast by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "John will have bought a book by next week.",
      "verb": "bought"
    },
    {
      "sentence": "The teacher will have flown to the market by then.",
      "verb": "flown"
    },
    {
      "sentence": "They will have learned French by this evening.",
      "verb": "learned"
    },
    {
      "sentence": "By this evening, she will have fixed the bathroom.",
      "verb": "fixed"
    },
    {
      "sentence": "Emma will have made a sandwich by then.",
      "verb": "made"
    },
    {
      "sentence": "By next year, our neighbors will have understood Spanish.",
      "verb": "understood"
    },
    {
      "sentence": "The children will have found the keys by next month.",
      "verb": "found"
    },
    {
      "sentence": "Her sister will have designed the room by then.",
      "verb": "designed"
    },
    {
      "sentence": "My friend will have completed the email by then.",
      "verb": "completed"
    },
    {
      "sentence": "John will have chosen a new car by then.",
      "verb": "chosen"
    },
    {
      "sentence": "We will have thought about the vacation by then.",
      "verb": "thought"
    },
    {
      "sentence": "John will have enjoyed pasta by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By tomorrow, you will have forgotten the options.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this weekend, the children will have ordered breakfast.",
      "verb": "ordered"
    },
    {
      "sentence": "My brother will have talked the manager by in two days.",
      "verb": "talked"
    },
    {
      "sentence": "He will have returned to the store by later.",
      "verb": "returned"
    },
    {
      "sentence": "By next month, they will have played the game.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, the dog will have painted a picture.",
      "verb": "painted"
    },
    {
      "sentence": "The cat will have completed the report by then.",
      "verb": "completed"
    },
    {
      "sentence": "The company will have sent the project by then.",
      "verb": "sent"
    },
    {
      "sentence": "By later, my friend will have taught science.",
      "verb": "taught"
    },
    {
      "sentence": "We will have talked the client by this evening.",
      "verb": "talked"
    },
    {
      "sentence": "He will have submitted the report by in two days.",
      "verb": "submitted"
    },
    {
      "sentence": "By this weekend, the cat will have found groceries.",
      "verb": "found"
    },
    {
      "sentence": "The company will have fixed the house by then.",
      "verb": "fixed"
    },
    {
      "sentence": "Sarah will have met my parents by later.",
      "verb": "met"
    },
    {
      "sentence": "By tonight, the manager will have contacted the neighbors.",
      "verb": "contacted"
    },
    {
      "sentence": "By tonight, she will have forgotten the decision.",
      "verb": "forgotten"
    },
    {
      "sentence": "By next year, she will have drawn the car.",
      "verb": "drawn"
    },
    {
      "sentence": "By soon, john will have sent the presentation.",
      "verb": "sent"
    },
    {
      "sentence": "Tom will have thought about the options by next year.",
      "verb": "thought"
    },
    {
      "sentence": "They will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The children will have talked my friend by then.",
      "verb": "talked"
    },
    {
      "sentence": "By this evening, the children will have painted a website.",
      "verb": "painted"
    },
    {
      "sentence": "We will have gotten the ticket by then.",
      "verb": "gotten"
    },
    {
      "sentence": "He will have repaired the house by this weekend.",
      "verb": "repaired"
    },
    {
      "sentence": "By next week, the manager will have gone to the park.",
      "verb": "gone"
    },
    {
      "sentence": "By tonight, sarah will have contacted the teacher.",
      "verb": "contacted"
    },
    {
      "sentence": "By next week, the company will have thought about the options.",
      "verb": "thought"
    },
    {
      "sentence": "She will have sent the document by then.",
      "verb": "sent"
    },
    {
      "sentence": "The team will have played a documentary by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The students will have remembered the meeting by then.",
      "verb": "remembered"
    },
    {
      "sentence": "She will have reviewed science by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "By tomorrow, my parents will have eaten a sandwich.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, john will have bought a book.",
      "verb": "bought"
    },
    {
      "sentence": "My parents will have arrived to the office by then.",
      "verb": "arrived"
    },
    {
      "sentence": "She will have forgotten the future by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "My brother will have understood history by next week.",
      "verb": "understood"
    },
    {
      "sentence": "They will have driven home by tomorrow.",
      "verb": "driven"
    },
    {
      "sentence": "By this weekend, he will have received the application.",
      "verb": "received"
    },
    {
      "sentence": "By tomorrow, the team will have returned to the store.",
      "verb": "returned"
    },
    {
      "sentence": "John will have written the letter by then.",
      "verb": "written"
    },
    {
      "sentence": "My brother will have planned the event by this evening.",
      "verb": "planned"
    },
    {
      "sentence": "Tom will have visited the neighbors by then.",
      "verb": "visited"
    },
    {
      "sentence": "The team will have learned the textbook by next month.",
      "verb": "learned"
    },
    {
      "sentence": "Her sister will have fixed a website by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The students will have sold the phone by then.",
      "verb": "sold"
    },
    {
      "sentence": "By next month, he will have given a present.",
      "verb": "given"
    },
    {
      "sentence": "The students will have called my parents by soon.",
      "verb": "called"
    },
    {
      "sentence": "The dog will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "Her sister will have bought the keys by later.",
      "verb": "bought"
    },
    {
      "sentence": "My brother will have ordered a salad by then.",
      "verb": "ordered"
    },
    {
      "sentence": "He will have eaten juice by soon.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, my friend will have come to school.",
      "verb": "come"
    },
    {
      "sentence": "Her sister will have arrived to work by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By this weekend, i will have enjoyed a documentary.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Emma will have come to work by next week.",
      "verb": "come"
    },
    {
      "sentence": "The bird will have walked to the office by this weekend.",
      "verb": "walked"
    },
    {
      "sentence": "You will have sent the application by next week.",
      "verb": "sent"
    },
    {
      "sentence": "Tom will have built a website by tonight.",
      "verb": "built"
    },
    {
      "sentence": "Sarah will have taught Spanish by later.",
      "verb": "taught"
    },
    {
      "sentence": "You will have drawn the furniture by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By soon, our neighbors will have flown to the airport.",
      "verb": "flown"
    },
    {
      "sentence": "Emma will have read the textbook by soon.",
      "verb": "read"
    },
    {
      "sentence": "By later, the team will have played a podcast.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have sold groceries by this evening.",
      "verb": "sold"
    },
    {
      "sentence": "Our neighbors will have remembered the problem by later.",
      "verb": "remembered"
    },
    {
      "sentence": "The teacher will have walked to work by next week.",
      "verb": "walked"
    },
    {
      "sentence": "By tonight, the students will have planned the event.",
      "verb": "planned"
    },
    {
      "sentence": "The cat will have flown to the gym by then.",
      "verb": "flown"
    },
    {
      "sentence": "They will have practiced the lesson by then.",
      "verb": "practiced"
    },
    {
      "sentence": "Our neighbors will have returned downtown by this weekend.",
      "verb": "returned"
    },
    {
      "sentence": "By later, her sister will have given the keys.",
      "verb": "given"
    },
    {
      "sentence": "The team will have received the application by tonight.",
      "verb": "received"
    },
    {
      "sentence": "The children will have contacted the neighbors by then.",
      "verb": "contacted"
    },
    {
      "sentence": "The manager will have listened to basketball by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "The company will have met the doctor by tomorrow.",
      "verb": "met"
    },
    {
      "sentence": "By next month, her sister will have finished the assignment.",
      "verb": "finished"
    },
    {
      "sentence": "The students will have called my friend by then.",
      "verb": "called"
    },
    {
      "sentence": "He will have called the boss by next week.",
      "verb": "called"
    },
    {
      "sentence": "By next month, i will have built a picture.",
      "verb": "built"
    },
    {
      "sentence": "I will have gotten the ticket by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By next month, i will have eaten coffee.",
      "verb": "eaten"
    },
    {
      "sentence": "You will have bought a present by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "He will have played basketball by next year.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, my friend will have enjoyed juice.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, the company will have sent the application.",
      "verb": "sent"
    },
    {
      "sentence": "Emma will have learned mathematics by this evening.",
      "verb": "learned"
    },
    {
      "sentence": "By tonight, they will have listened to a song.",
      "verb": "listened"
    },
    {
      "sentence": "My friend will have arrived to work by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By in two days, my parents will have planned the decision.",
      "verb": "planned"
    },
    {
      "sentence": "The dog will have left to the office by tomorrow.",
      "verb": "left"
    },
    {
      "sentence": "The team will have given a new car by soon.",
      "verb": "given"
    },
    {
      "sentence": "By next year, the children will have designed a picture.",
      "verb": "designed"
    },
    {
      "sentence": "You will have left home by next year.",
      "verb": "left"
    },
    {
      "sentence": "My brother will have enjoyed the game by later.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Tom will have played a video by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The children will have repaired the kitchen by then.",
      "verb": "repaired"
    },
    {
      "sentence": "Her sister will have submitted the assignment by then.",
      "verb": "submitted"
    },
    {
      "sentence": "Sarah will have met the boss by then.",
      "verb": "met"
    },
    {
      "sentence": "The bird will have ordered soup by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By in two days, our neighbors will have contacted the doctor.",
      "verb": "contacted"
    },
    {
      "sentence": "We will have called my parents by soon.",
      "verb": "called"
    },
    {
      "sentence": "By soon, sarah will have planned the problem.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, she will have found the keys.",
      "verb": "found"
    },
    {
      "sentence": "The company will have enjoyed pizza by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My parents will have cooked pasta by next year.",
      "verb": "cooked"
    },
    {
      "sentence": "By this evening, our neighbors will have enjoyed dinner.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, tom will have met the neighbors.",
      "verb": "met"
    },
    {
      "sentence": "The bird will have completed the presentation by then.",
      "verb": "completed"
    },
    {
      "sentence": "Emma will have called the teacher by then.",
      "verb": "called"
    },
    {
      "sentence": "We will have met the team by then.",
      "verb": "met"
    },
    {
      "sentence": "The students will have completed the application by then.",
      "verb": "completed"
    },
    {
      "sentence": "By this evening, the students will have practiced the textbook.",
      "verb": "practiced"
    },
    {
      "sentence": "The dog will have planned the problem by in two days.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, the bird will have learned vocabulary.",
      "verb": "learned"
    },
    {
      "sentence": "The children will have given a laptop by then.",
      "verb": "given"
    },
    {
      "sentence": "He will have listened to a movie by then.",
      "verb": "listened"
    },
    {
      "sentence": "The manager will have considered the event by next month.",
      "verb": "considered"
    },
    {
      "sentence": "By tonight, tom will have chosen a book.",
      "verb": "chosen"
    },
    {
      "sentence": "The team will have drunk pizza by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Emma will have written the letter by then.",
      "verb": "written"
    },
    {
      "sentence": "Our neighbors will have painted the bathroom by next year.",
      "verb": "painted"
    },
    {
      "sentence": "Tom will have played music by later.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have written the document by soon.",
      "verb": "written"
    },
    {
      "sentence": "By tomorrow, my parents will have learned for the exam.",
      "verb": "learned"
    },
    {
      "sentence": "By tonight, my friend will have found a present.",
      "verb": "found"
    },
    {
      "sentence": "The company will have made tea by then.",
      "verb": "made"
    },
    {
      "sentence": "By soon, the team will have studied Spanish.",
      "verb": "studied"
    },
    {
      "sentence": "John will have come downtown by tonight.",
      "verb": "come"
    },
    {
      "sentence": "By next month, they will have practiced French.",
      "verb": "practiced"
    },
    {
      "sentence": "The team will have enjoyed TV by next year.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The teacher will have left to the beach by this weekend.",
      "verb": "left"
    },
    {
      "sentence": "The company will have prepared lunch by tonight.",
      "verb": "prepared"
    },
    {
      "sentence": "John will have sold the ticket by next month.",
      "verb": "sold"
    },
    {
      "sentence": "Tom will have built the car by then.",
      "verb": "built"
    },
    {
      "sentence": "By tomorrow, the cat will have designed the room.",
      "verb": "designed"
    },
    {
      "sentence": "Emma will have met my friend by this weekend.",
      "verb": "met"
    },
    {
      "sentence": "My parents will have contacted my family by this weekend.",
      "verb": "contacted"
    },
    {
      "sentence": "The manager will have left to the library by then.",
      "verb": "left"
    },
    {
      "sentence": "By tomorrow, my parents will have forgotten the meeting.",
      "verb": "forgotten"
    },
    {
      "sentence": "Tom will have returned downtown by then.",
      "verb": "returned"
    },
    {
      "sentence": "By next year, tom will have listened to the game.",
      "verb": "listened"
    },
    {
      "sentence": "By next week, the dog will have prepared a snack.",
      "verb": "prepared"
    },
    {
      "sentence": "The manager will have enjoyed TV by tonight.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By tomorrow, our neighbors will have chosen groceries.",
      "verb": "chosen"
    },
    {
      "sentence": "You will have submitted the presentation by this weekend.",
      "verb": "submitted"
    },
    {
      "sentence": "Her sister will have enjoyed coffee by next year.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The dog will have played a song by in two days.",
      "verb": "played"
    },
    {
      "sentence": "He will have listened to basketball by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have chosen the ticket by then.",
      "verb": "chosen"
    },
    {
      "sentence": "You will have painted the kitchen by in two days.",
      "verb": "painted"
    },
    {
      "sentence": "They will have remembered the situation by tomorrow.",
      "verb": "remembered"
    },
    {
      "sentence": "I will have drawn the car by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The manager will have met the doctor by then.",
      "verb": "met"
    },
    {
      "sentence": "By later, the teacher will have read mathematics.",
      "verb": "read"
    },
    {
      "sentence": "By this evening, i will have listened to a movie.",
      "verb": "listened"
    },
    {
      "sentence": "Our neighbors will have painted a website by then.",
      "verb": "painted"
    },
    {
      "sentence": "By later, the manager will have fixed a picture.",
      "verb": "fixed"
    },
    {
      "sentence": "By next year, john will have designed the car.",
      "verb": "designed"
    },
    {
      "sentence": "You will have come to the park by next year.",
      "verb": "come"
    },
    {
      "sentence": "The students will have sold a laptop by next week.",
      "verb": "sold"
    },
    {
      "sentence": "By tonight, we will have flown to work.",
      "verb": "flown"
    },
    {
      "sentence": "By tonight, my friend will have gone to the airport.",
      "verb": "gone"
    },
    {
      "sentence": "They will have forgotten the meeting by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this weekend, we will have run home.",
      "verb": "run"
    },
    {
      "sentence": "You will have eaten a sandwich by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By soon, her sister will have painted the furniture.",
      "verb": "painted"
    },
    {
      "sentence": "My friend will have fixed the house by then.",
      "verb": "fixed"
    },
    {
      "sentence": "They will have gotten a gift by this weekend.",
      "verb": "gotten"
    },
    {
      "sentence": "He will have given groceries by next week.",
      "verb": "given"
    },
    {
      "sentence": "The cat will have remembered the meeting by in two days.",
      "verb": "remembered"
    },
    {
      "sentence": "The teacher will have built the room by then.",
      "verb": "built"
    },
    {
      "sentence": "Tom will have written the contract by then.",
      "verb": "written"
    },
    {
      "sentence": "She will have chosen a gift by next month.",
      "verb": "chosen"
    },
    {
      "sentence": "By in two days, the teacher will have sold a present.",
      "verb": "sold"
    },
    {
      "sentence": "He will have painted the garden by tomorrow.",
      "verb": "painted"
    },
    {
      "sentence": "We will have completed the letter by this evening.",
      "verb": "completed"
    },
    {
      "sentence": "We will have listened to TV by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "The students will have gone home by tomorrow.",
      "verb": "gone"
    },
    {
      "sentence": "He will have played music by then.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, the bird will have forgotten the future.",
      "verb": "forgotten"
    },
    {
      "sentence": "The manager will have made a salad by then.",
      "verb": "made"
    },
    {
      "sentence": "By next year, they will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "The team will have drawn a picture by next month.",
      "verb": "drawn"
    },
    {
      "sentence": "She will have visited the teacher by next month.",
      "verb": "visited"
    },
    {
      "sentence": "She will have taught history by tomorrow.",
      "verb": "taught"
    },
    {
      "sentence": "He will have cooked a snack by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By in two days, my brother will have sold a new car.",
      "verb": "sold"
    },
    {
      "sentence": "The company will have watched the game by this weekend.",
      "verb": "watched"
    },
    {
      "sentence": "By this weekend, the teacher will have finished the project.",
      "verb": "finished"
    },
    {
      "sentence": "By next week, i will have completed the contract.",
      "verb": "completed"
    },
    {
      "sentence": "The team will have spoken my parents by soon.",
      "verb": "spoken"
    },
    {
      "sentence": "We will have fixed the computer by then.",
      "verb": "fixed"
    },
    {
      "sentence": "My brother will have reviewed vocabulary by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "John will have studied English by tomorrow.",
      "verb": "studied"
    },
    {
      "sentence": "My parents will have thought about the vacation by this weekend.",
      "verb": "thought"
    },
    {
      "sentence": "Our neighbors will have prepared pasta by then.",
      "verb": "prepared"
    },
    {
      "sentence": "My parents will have completed the task by this weekend.",
      "verb": "completed"
    },
    {
      "sentence": "You will have played a video by then.",
      "verb": "played"
    },
    {
      "sentence": "By later, my friend will have practiced French.",
      "verb": "practiced"
    },
    {
      "sentence": "My parents will have built the computer by next week.",
      "verb": "built"
    },
    {
      "sentence": "Sarah will have walked to the office by this evening.",
      "verb": "walked"
    },
    {
      "sentence": "The dog will have watched a podcast by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "John will have enjoyed the game by this weekend.",
      "verb": "enjoyed"
    },
    {
      "sentence": "He will have thought about the situation by then.",
      "verb": "thought"
    },
    {
      "sentence": "By next week, he will have planned the vacation.",
      "verb": "planned"
    },
    {
      "sentence": "By this evening, tom will have ordered a salad.",
      "verb": "ordered"
    },
    {
      "sentence": "She will have started the presentation by then.",
      "verb": "started"
    },
    {
      "sentence": "We will have remembered the options by in two days.",
      "verb": "remembered"
    },
    {
      "sentence": "By soon, the company will have gone to the park.",
      "verb": "gone"
    },
    {
      "sentence": "I will have written the letter by then.",
      "verb": "written"
    },
    {
      "sentence": "The company will have sold a gift by in two days.",
      "verb": "sold"
    },
    {
      "sentence": "By soon, i will have found flowers.",
      "verb": "found"
    },
    {
      "sentence": "By next year, the dog will have understood the chapter.",
      "verb": "understood"
    },
    {
      "sentence": "Emma will have gotten a book by then.",
      "verb": "gotten"
    },
    {
      "sentence": "My friend will have eaten tea by tomorrow.",
      "verb": "eaten"
    },
    {
      "sentence": "The cat will have finished the document by tonight.",
      "verb": "finished"
    },
    {
      "sentence": "By this weekend, the dog will have prepared a sandwich.",
      "verb": "prepared"
    },
    {
      "sentence": "They will have remembered the situation by then.",
      "verb": "remembered"
    },
    {
      "sentence": "The company will have sent the project by next year.",
      "verb": "sent"
    },
    {
      "sentence": "She will have contacted the neighbors by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By soon, the dog will have cooked juice.",
      "verb": "cooked"
    },
    {
      "sentence": "By tonight, her sister will have practiced Spanish.",
      "verb": "practiced"
    },
    {
      "sentence": "By next week, he will have played tennis.",
      "verb": "played"
    },
    {
      "sentence": "The company will have remembered the birthday by tomorrow.",
      "verb": "remembered"
    },
    {
      "sentence": "By next month, my friend will have walked to the park.",
      "verb": "walked"
    },
    {
      "sentence": "By tonight, sarah will have talked the team.",
      "verb": "talked"
    },
    {
      "sentence": "My brother will have started the presentation by next year.",
      "verb": "started"
    },
    {
      "sentence": "The company will have cooked a salad by then.",
      "verb": "cooked"
    },
    {
      "sentence": "The bird will have flown to the library by tonight.",
      "verb": "flown"
    },
    {
      "sentence": "We will have gone to school by soon.",
      "verb": "gone"
    },
    {
      "sentence": "My parents will have received the letter by then.",
      "verb": "received"
    },
    {
      "sentence": "The cat will have written the application by then.",
      "verb": "written"
    },
    {
      "sentence": "By tonight, you will have written the contract.",
      "verb": "written"
    },
    {
      "sentence": "Her sister will have forgotten the situation by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "By this weekend, the company will have submitted the report.",
      "verb": "submitted"
    },
    {
      "sentence": "By tomorrow, i will have painted the car.",
      "verb": "painted"
    },
    {
      "sentence": "By next month, the company will have considered the trip.",
      "verb": "considered"
    },
    {
      "sentence": "The students will have ordered coffee by later.",
      "verb": "ordered"
    },
    {
      "sentence": "By tonight, our neighbors will have enjoyed a video.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, the children will have thought about the problem.",
      "verb": "thought"
    },
    {
      "sentence": "The dog will have bought a gift by then.",
      "verb": "bought"
    },
    {
      "sentence": "You will have listened to music by tonight.",
      "verb": "listened"
    },
    {
      "sentence": "By tomorrow, you will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "By in two days, we will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "Tom will have found the ticket by in two days.",
      "verb": "found"
    },
    {
      "sentence": "I will have ordered breakfast by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By this weekend, the manager will have thought about the future.",
      "verb": "thought"
    },
    {
      "sentence": "Our neighbors will have drunk juice by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Emma will have called the manager by this weekend.",
      "verb": "called"
    },
    {
      "sentence": "By tomorrow, she will have fixed the house.",
      "verb": "fixed"
    },
    {
      "sentence": "By tonight, the dog will have flown to the library.",
      "verb": "flown"
    },
    {
      "sentence": "The company will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Sarah will have sold the keys by then.",
      "verb": "sold"
    },
    {
      "sentence": "Emma will have prepared a snack by then.",
      "verb": "prepared"
    },
    {
      "sentence": "John will have contacted the team by this evening.",
      "verb": "contacted"
    },
    {
      "sentence": "Our neighbors will have given a laptop by then.",
      "verb": "given"
    },
    {
      "sentence": "Our neighbors will have enjoyed the game by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next week, the dog will have enjoyed pasta.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, our neighbors will have left to school.",
      "verb": "left"
    },
    {
      "sentence": "The company will have started the report by then.",
      "verb": "started"
    },
    {
      "sentence": "By tonight, i will have fixed the car.",
      "verb": "fixed"
    },
    {
      "sentence": "Emma will have written the document by tonight.",
      "verb": "written"
    },
    {
      "sentence": "Sarah will have considered the meeting by tonight.",
      "verb": "considered"
    },
    {
      "sentence": "By in two days, my brother will have bought groceries.",
      "verb": "bought"
    },
    {
      "sentence": "By this weekend, the students will have called my friend.",
      "verb": "called"
    },
    {
      "sentence": "By next week, i will have listened to a movie.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have gotten the phone by then.",
      "verb": "gotten"
    },
    {
      "sentence": "My brother will have run to the gym by then.",
      "verb": "run"
    },
    {
      "sentence": "The students will have eaten pasta by next week.",
      "verb": "eaten"
    },
    {
      "sentence": "By next month, her sister will have drunk juice.",
      "verb": "drunk"
    },
    {
      "sentence": "She will have eaten pizza by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By tomorrow, our neighbors will have met the manager.",
      "verb": "met"
    },
    {
      "sentence": "Her sister will have submitted the presentation by then.",
      "verb": "submitted"
    },
    {
      "sentence": "Our neighbors will have gotten groceries by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The students will have watched the news by soon.",
      "verb": "watched"
    },
    {
      "sentence": "By tomorrow, they will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "The team will have given clothes by next week.",
      "verb": "given"
    },
    {
      "sentence": "By next week, we will have prepared dinner.",
      "verb": "prepared"
    },
    {
      "sentence": "He will have prepared a snack by then.",
      "verb": "prepared"
    },
    {
      "sentence": "The teacher will have practiced English by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The team will have gone to the gym by then.",
      "verb": "gone"
    },
    {
      "sentence": "By next month, you will have played the news.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have contacted my family by this evening.",
      "verb": "contacted"
    },
    {
      "sentence": "Tom will have found a present by tonight.",
      "verb": "found"
    },
    {
      "sentence": "The students will have flown to the airport by then.",
      "verb": "flown"
    },
    {
      "sentence": "By next month, she will have returned downtown.",
      "verb": "returned"
    },
    {
      "sentence": "The students will have sent the presentation by in two days.",
      "verb": "sent"
    },
    {
      "sentence": "My parents will have gotten a book by next week.",
      "verb": "gotten"
    },
    {
      "sentence": "By tonight, she will have talked the client.",
      "verb": "talked"
    },
    {
      "sentence": "By soon, the children will have forgotten the problem.",
      "verb": "forgotten"
    },
    {
      "sentence": "She will have considered the event by then.",
      "verb": "considered"
    },
    {
      "sentence": "Tom will have left to school by then.",
      "verb": "left"
    },
    {
      "sentence": "The teacher will have enjoyed basketball by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The team will have chosen a new car by tomorrow.",
      "verb": "chosen"
    },
    {
      "sentence": "He will have received the presentation by later.",
      "verb": "received"
    },
    {
      "sentence": "The dog will have gotten the phone by then.",
      "verb": "gotten"
    },
    {
      "sentence": "John will have received the project by then.",
      "verb": "received"
    },
    {
      "sentence": "By this weekend, sarah will have reviewed vocabulary.",
      "verb": "reviewed"
    },
    {
      "sentence": "The bird will have made dinner by then.",
      "verb": "made"
    },
    {
      "sentence": "The dog will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, the company will have taught science.",
      "verb": "taught"
    },
    {
      "sentence": "The cat will have come to the park by tomorrow.",
      "verb": "come"
    },
    {
      "sentence": "The bird will have designed the house by next week.",
      "verb": "designed"
    },
    {
      "sentence": "By this evening, my parents will have repaired a picture.",
      "verb": "repaired"
    },
    {
      "sentence": "Our neighbors will have remembered the decision by then.",
      "verb": "remembered"
    },
    {
      "sentence": "Emma will have built the garden by then.",
      "verb": "built"
    },
    {
      "sentence": "By in two days, my friend will have watched a movie.",
      "verb": "watched"
    },
    {
      "sentence": "The team will have listened to a movie by then.",
      "verb": "listened"
    },
    {
      "sentence": "By next month, emma will have eaten breakfast.",
      "verb": "eaten"
    },
    {
      "sentence": "By this weekend, emma will have flown to the library.",
      "verb": "flown"
    },
    {
      "sentence": "Tom will have visited the doctor by tomorrow.",
      "verb": "visited"
    },
    {
      "sentence": "By soon, the company will have remembered the event.",
      "verb": "remembered"
    },
    {
      "sentence": "By this evening, the bird will have studied French.",
      "verb": "studied"
    },
    {
      "sentence": "By next year, the bird will have drunk pasta.",
      "verb": "drunk"
    },
    {
      "sentence": "The dog will have written the project by next week.",
      "verb": "written"
    },
    {
      "sentence": "By this evening, we will have met the manager.",
      "verb": "met"
    },
    {
      "sentence": "Our neighbors will have come home by this evening.",
      "verb": "come"
    },
    {
      "sentence": "We will have sold the keys by next year.",
      "verb": "sold"
    },
    {
      "sentence": "By soon, my friend will have drawn the house.",
      "verb": "drawn"
    },
    {
      "sentence": "My parents will have drunk breakfast by next week.",
      "verb": "drunk"
    },
    {
      "sentence": "The children will have painted the furniture by next month.",
      "verb": "painted"
    },
    {
      "sentence": "The students will have finished the report by then.",
      "verb": "finished"
    },
    {
      "sentence": "I will have called the team by then.",
      "verb": "called"
    },
    {
      "sentence": "The bird will have gone to the beach by next week.",
      "verb": "gone"
    },
    {
      "sentence": "She will have eaten dinner by tomorrow.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have contacted the client by then.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, the cat will have remembered the situation.",
      "verb": "remembered"
    },
    {
      "sentence": "The children will have walked to school by next week.",
      "verb": "walked"
    },
    {
      "sentence": "The cat will have contacted my family by then.",
      "verb": "contacted"
    },
    {
      "sentence": "The team will have made a snack by then.",
      "verb": "made"
    },
    {
      "sentence": "My brother will have started the contract by then.",
      "verb": "started"
    },
    {
      "sentence": "We will have designed the furniture by then.",
      "verb": "designed"
    },
    {
      "sentence": "By next week, the bird will have arrived downtown.",
      "verb": "arrived"
    },
    {
      "sentence": "The cat will have left to the beach by next week.",
      "verb": "left"
    },
    {
      "sentence": "The children will have reviewed vocabulary by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "By next month, the team will have drunk a salad.",
      "verb": "drunk"
    },
    {
      "sentence": "By next year, tom will have called my parents.",
      "verb": "called"
    },
    {
      "sentence": "By next month, he will have drunk pasta.",
      "verb": "drunk"
    },
    {
      "sentence": "You will have reviewed for the exam by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "They will have played tennis by then.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, they will have reviewed vocabulary.",
      "verb": "reviewed"
    },
    {
      "sentence": "The cat will have found a laptop by then.",
      "verb": "found"
    },
    {
      "sentence": "You will have remembered the meeting by next week.",
      "verb": "remembered"
    },
    {
      "sentence": "My brother will have given the ticket by then.",
      "verb": "given"
    },
    {
      "sentence": "The cat will have learned English by next year.",
      "verb": "learned"
    },
    {
      "sentence": "By soon, the teacher will have reviewed science.",
      "verb": "reviewed"
    },
    {
      "sentence": "By next year, you will have bought a laptop.",
      "verb": "bought"
    },
    {
      "sentence": "By tonight, the students will have listened to a video.",
      "verb": "listened"
    },
    {
      "sentence": "We will have watched a video by then.",
      "verb": "watched"
    },
    {
      "sentence": "They will have fixed a website by then.",
      "verb": "fixed"
    },
    {
      "sentence": "My parents will have completed the letter by then.",
      "verb": "completed"
    },
    {
      "sentence": "The team will have gotten the phone by next week.",
      "verb": "gotten"
    },
    {
      "sentence": "My parents will have played basketball by in two days.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, the manager will have written the assignment.",
      "verb": "written"
    },
    {
      "sentence": "By this evening, tom will have enjoyed a salad.",
      "verb": "enjoyed"
    },
    {
      "sentence": "John will have planned the event by then.",
      "verb": "planned"
    },
    {
      "sentence": "They will have understood English by tonight.",
      "verb": "understood"
    },
    {
      "sentence": "My parents will have practiced Spanish by tonight.",
      "verb": "practiced"
    },
    {
      "sentence": "The dog will have watched tennis by then.",
      "verb": "watched"
    },
    {
      "sentence": "The manager will have learned history by tomorrow.",
      "verb": "learned"
    },
    {
      "sentence": "You will have chosen flowers by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By tonight, emma will have flown to the market.",
      "verb": "flown"
    },
    {
      "sentence": "By next week, our neighbors will have thought about the future.",
      "verb": "thought"
    },
    {
      "sentence": "The cat will have repaired the house by tomorrow.",
      "verb": "repaired"
    },
    {
      "sentence": "By tomorrow, the company will have completed the contract.",
      "verb": "completed"
    },
    {
      "sentence": "Her sister will have sold the ticket by in two days.",
      "verb": "sold"
    },
    {
      "sentence": "The bird will have contacted the teacher by next week.",
      "verb": "contacted"
    },
    {
      "sentence": "She will have thought about the vacation by next year.",
      "verb": "thought"
    },
    {
      "sentence": "My parents will have played a video by in two days.",
      "verb": "played"
    },
    {
      "sentence": "Tom will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "Sarah will have found a gift by then.",
      "verb": "found"
    },
    {
      "sentence": "By in two days, emma will have gone downtown.",
      "verb": "gone"
    },
    {
      "sentence": "Our neighbors will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By soon, sarah will have repaired the kitchen.",
      "verb": "repaired"
    },
    {
      "sentence": "The cat will have drawn a website by this weekend.",
      "verb": "drawn"
    },
    {
      "sentence": "The children will have come to the airport by then.",
      "verb": "come"
    },
    {
      "sentence": "By this evening, they will have considered the event.",
      "verb": "considered"
    },
    {
      "sentence": "The students will have played the game by later.",
      "verb": "played"
    },
    {
      "sentence": "They will have thought about the vacation by then.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, they will have contacted my parents.",
      "verb": "contacted"
    },
    {
      "sentence": "The manager will have contacted my parents by tonight.",
      "verb": "contacted"
    },
    {
      "sentence": "Our neighbors will have gotten flowers by soon.",
      "verb": "gotten"
    },
    {
      "sentence": "The children will have enjoyed music by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, her sister will have remembered the birthday.",
      "verb": "remembered"
    },
    {
      "sentence": "John will have considered the event by then.",
      "verb": "considered"
    },
    {
      "sentence": "They will have eaten a salad by this evening.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have arrived to school by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The manager will have thought about the vacation by next month.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, john will have cooked a snack.",
      "verb": "cooked"
    },
    {
      "sentence": "You will have eaten dinner by then.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have enjoyed music by next year.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, we will have visited my parents.",
      "verb": "visited"
    },
    {
      "sentence": "The children will have finished the presentation by then.",
      "verb": "finished"
    },
    {
      "sentence": "Our neighbors will have visited the doctor by tomorrow.",
      "verb": "visited"
    },
    {
      "sentence": "We will have called my friend by then.",
      "verb": "called"
    },
    {
      "sentence": "By later, sarah will have taught mathematics.",
      "verb": "taught"
    },
    {
      "sentence": "By next year, our neighbors will have received the application.",
      "verb": "received"
    },
    {
      "sentence": "By next month, the students will have talked my family.",
      "verb": "talked"
    },
    {
      "sentence": "The dog will have played a song by tonight.",
      "verb": "played"
    },
    {
      "sentence": "They will have finished the contract by in two days.",
      "verb": "finished"
    },
    {
      "sentence": "She will have walked to the airport by next month.",
      "verb": "walked"
    },
    {
      "sentence": "The manager will have talked my parents by then.",
      "verb": "talked"
    },
    {
      "sentence": "She will have spoken the teacher by next week.",
      "verb": "spoken"
    },
    {
      "sentence": "They will have studied Spanish by tonight.",
      "verb": "studied"
    },
    {
      "sentence": "By in two days, we will have cleaned the car.",
      "verb": "cleaned"
    },
    {
      "sentence": "The dog will have understood grammar by later.",
      "verb": "understood"
    },
    {
      "sentence": "By this weekend, sarah will have understood grammar.",
      "verb": "understood"
    },
    {
      "sentence": "She will have made pizza by next week.",
      "verb": "made"
    },
    {
      "sentence": "By tomorrow, the team will have finished the email.",
      "verb": "finished"
    },
    {
      "sentence": "You will have sent the report by next year.",
      "verb": "sent"
    },
    {
      "sentence": "My parents will have eaten juice by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By this evening, the team will have cooked pasta.",
      "verb": "cooked"
    },
    {
      "sentence": "John will have remembered the trip by then.",
      "verb": "remembered"
    },
    {
      "sentence": "My parents will have arrived to the library by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By tomorrow, the team will have listened to basketball.",
      "verb": "listened"
    },
    {
      "sentence": "The bird will have fixed the car by next year.",
      "verb": "fixed"
    },
    {
      "sentence": "By next week, my friend will have designed the room.",
      "verb": "designed"
    },
    {
      "sentence": "By next month, the manager will have found the phone.",
      "verb": "found"
    },
    {
      "sentence": "Our neighbors will have talked the teacher by then.",
      "verb": "talked"
    },
    {
      "sentence": "They will have fixed a website by this weekend.",
      "verb": "fixed"
    },
    {
      "sentence": "Tom will have left to the library by then.",
      "verb": "left"
    },
    {
      "sentence": "By tonight, my brother will have talked my family.",
      "verb": "talked"
    },
    {
      "sentence": "He will have cooked a salad by next week.",
      "verb": "cooked"
    },
    {
      "sentence": "The students will have sent the email by then.",
      "verb": "sent"
    },
    {
      "sentence": "By tonight, the bird will have arrived home.",
      "verb": "arrived"
    },
    {
      "sentence": "The children will have practiced grammar by next year.",
      "verb": "practiced"
    },
    {
      "sentence": "My parents will have taught science by then.",
      "verb": "taught"
    },
    {
      "sentence": "He will have left to the park by then.",
      "verb": "left"
    },
    {
      "sentence": "By in two days, she will have painted a picture.",
      "verb": "painted"
    },
    {
      "sentence": "You will have made coffee by then.",
      "verb": "made"
    },
    {
      "sentence": "John will have spoken the doctor by then.",
      "verb": "spoken"
    },
    {
      "sentence": "He will have found a new car by soon.",
      "verb": "found"
    },
    {
      "sentence": "The students will have sold groceries by then.",
      "verb": "sold"
    },
    {
      "sentence": "My parents will have received the presentation by then.",
      "verb": "received"
    },
    {
      "sentence": "Tom will have watched a song by later.",
      "verb": "watched"
    },
    {
      "sentence": "The children will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "The children will have understood the textbook by soon.",
      "verb": "understood"
    },
    {
      "sentence": "By this weekend, the cat will have ordered coffee.",
      "verb": "ordered"
    },
    {
      "sentence": "The manager will have played a movie by then.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, tom will have played TV.",
      "verb": "played"
    },
    {
      "sentence": "Our neighbors will have enjoyed a video by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My parents will have planned the birthday by tomorrow.",
      "verb": "planned"
    },
    {
      "sentence": "Her sister will have submitted the email by then.",
      "verb": "submitted"
    },
    {
      "sentence": "He will have studied the lesson by tonight.",
      "verb": "studied"
    },
    {
      "sentence": "Sarah will have prepared tea by next month.",
      "verb": "prepared"
    },
    {
      "sentence": "By this weekend, sarah will have ordered tea.",
      "verb": "ordered"
    },
    {
      "sentence": "John will have fixed the furniture by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By later, the teacher will have forgotten the vacation.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tonight, emma will have completed the letter.",
      "verb": "completed"
    },
    {
      "sentence": "The manager will have visited the team by then.",
      "verb": "visited"
    },
    {
      "sentence": "My brother will have sold a laptop by then.",
      "verb": "sold"
    },
    {
      "sentence": "By this weekend, her sister will have watched basketball.",
      "verb": "watched"
    },
    {
      "sentence": "By next year, she will have left to the park.",
      "verb": "left"
    },
    {
      "sentence": "The students will have enjoyed basketball by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, the students will have considered the problem.",
      "verb": "considered"
    },
    {
      "sentence": "By next month, i will have left to work.",
      "verb": "left"
    },
    {
      "sentence": "Sarah will have ordered juice by next year.",
      "verb": "ordered"
    },
    {
      "sentence": "I will have forgotten the meeting by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "Sarah will have submitted the email by next month.",
      "verb": "submitted"
    },
    {
      "sentence": "By this evening, i will have contacted the client.",
      "verb": "contacted"
    },
    {
      "sentence": "She will have met my friend by this weekend.",
      "verb": "met"
    },
    {
      "sentence": "By next year, they will have thought about the problem.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, the children will have started the email.",
      "verb": "started"
    },
    {
      "sentence": "My brother will have chosen flowers by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By this weekend, the manager will have fixed the furniture.",
      "verb": "fixed"
    },
    {
      "sentence": "By tonight, the company will have chosen the phone.",
      "verb": "chosen"
    },
    {
      "sentence": "The team will have finished the letter by next month.",
      "verb": "finished"
    },
    {
      "sentence": "My brother will have reviewed English by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "My friend will have drunk lunch by this weekend.",
      "verb": "drunk"
    },
    {
      "sentence": "By next week, the dog will have eaten juice.",
      "verb": "eaten"
    },
    {
      "sentence": "My parents will have met my friend by then.",
      "verb": "met"
    },
    {
      "sentence": "The students will have considered the options by tomorrow.",
      "verb": "considered"
    },
    {
      "sentence": "John will have sold flowers by next year.",
      "verb": "sold"
    },
    {
      "sentence": "The company will have visited the teacher by then.",
      "verb": "visited"
    },
    {
      "sentence": "By next week, our neighbors will have read French.",
      "verb": "read"
    },
    {
      "sentence": "The children will have driven to the market by this evening.",
      "verb": "driven"
    },
    {
      "sentence": "By next month, sarah will have fixed the room.",
      "verb": "fixed"
    },
    {
      "sentence": "By this weekend, he will have listened to the news.",
      "verb": "listened"
    },
    {
      "sentence": "I will have repaired a website by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By this weekend, her sister will have returned to the airport.",
      "verb": "returned"
    },
    {
      "sentence": "The bird will have gone to the store by then.",
      "verb": "gone"
    },
    {
      "sentence": "By this evening, she will have enjoyed dinner.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this evening, tom will have reviewed English.",
      "verb": "reviewed"
    },
    {
      "sentence": "My parents will have built the house by then.",
      "verb": "built"
    },
    {
      "sentence": "By in two days, the bird will have repaired the kitchen.",
      "verb": "repaired"
    },
    {
      "sentence": "By tomorrow, emma will have prepared breakfast.",
      "verb": "prepared"
    },
    {
      "sentence": "Our neighbors will have given the ticket by then.",
      "verb": "given"
    },
    {
      "sentence": "By this evening, my brother will have watched a movie.",
      "verb": "watched"
    },
    {
      "sentence": "By next month, i will have sold clothes.",
      "verb": "sold"
    },
    {
      "sentence": "She will have thought about the problem by soon.",
      "verb": "thought"
    },
    {
      "sentence": "My parents will have remembered the situation by this weekend.",
      "verb": "remembered"
    },
    {
      "sentence": "By next week, my brother will have drunk lunch.",
      "verb": "drunk"
    },
    {
      "sentence": "The team will have found a laptop by then.",
      "verb": "found"
    },
    {
      "sentence": "The cat will have listened to a documentary by then.",
      "verb": "listened"
    },
    {
      "sentence": "The teacher will have given a laptop by tomorrow.",
      "verb": "given"
    },
    {
      "sentence": "Emma will have ordered pasta by in two days.",
      "verb": "ordered"
    },
    {
      "sentence": "The bird will have planned the situation by this evening.",
      "verb": "planned"
    },
    {
      "sentence": "The students will have talked my friend by next month.",
      "verb": "talked"
    },
    {
      "sentence": "Her sister will have enjoyed the news by next week.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, sarah will have cleaned a picture.",
      "verb": "cleaned"
    },
    {
      "sentence": "The cat will have built the bathroom by then.",
      "verb": "built"
    },
    {
      "sentence": "By this weekend, our neighbors will have spoken the teacher.",
      "verb": "spoken"
    },
    {
      "sentence": "The bird will have given a gift by then.",
      "verb": "given"
    },
    {
      "sentence": "My parents will have eaten breakfast by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have visited my parents by then.",
      "verb": "visited"
    },
    {
      "sentence": "By this evening, the teacher will have given flowers.",
      "verb": "given"
    },
    {
      "sentence": "The teacher will have submitted the task by then.",
      "verb": "submitted"
    },
    {
      "sentence": "The cat will have found a book by this weekend.",
      "verb": "found"
    },
    {
      "sentence": "The students will have walked to the market by then.",
      "verb": "walked"
    },
    {
      "sentence": "By in two days, tom will have chosen a book.",
      "verb": "chosen"
    },
    {
      "sentence": "The manager will have returned home by then.",
      "verb": "returned"
    },
    {
      "sentence": "Emma will have enjoyed a salad by tonight.",
      "verb": "enjoyed"
    },
    {
      "sentence": "She will have fixed the kitchen by next year.",
      "verb": "fixed"
    },
    {
      "sentence": "The children will have sold a book by then.",
      "verb": "sold"
    },
    {
      "sentence": "The children will have visited the client by then.",
      "verb": "visited"
    },
    {
      "sentence": "By tonight, she will have returned to the airport.",
      "verb": "returned"
    },
    {
      "sentence": "The dog will have planned the future by tomorrow.",
      "verb": "planned"
    },
    {
      "sentence": "John will have visited the teacher by then.",
      "verb": "visited"
    },
    {
      "sentence": "By next month, my friend will have enjoyed lunch.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The cat will have remembered the situation by tonight.",
      "verb": "remembered"
    },
    {
      "sentence": "The cat will have bought the ticket by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "By later, he will have listened to tennis.",
      "verb": "listened"
    },
    {
      "sentence": "By next week, the bird will have walked to school.",
      "verb": "walked"
    },
    {
      "sentence": "I will have bought the phone by then.",
      "verb": "bought"
    },
    {
      "sentence": "My parents will have bought a book by soon.",
      "verb": "bought"
    },
    {
      "sentence": "By later, our neighbors will have taught French.",
      "verb": "taught"
    },
    {
      "sentence": "The team will have visited the boss by then.",
      "verb": "visited"
    },
    {
      "sentence": "The cat will have cleaned a picture by tonight.",
      "verb": "cleaned"
    },
    {
      "sentence": "The dog will have called the doctor by then.",
      "verb": "called"
    },
    {
      "sentence": "Our neighbors will have visited my friend by then.",
      "verb": "visited"
    },
    {
      "sentence": "You will have played tennis by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The teacher will have flown to the park by this evening.",
      "verb": "flown"
    },
    {
      "sentence": "Tom will have studied vocabulary by then.",
      "verb": "studied"
    },
    {
      "sentence": "We will have planned the problem by then.",
      "verb": "planned"
    },
    {
      "sentence": "The children will have planned the meeting by then.",
      "verb": "planned"
    },
    {
      "sentence": "Our neighbors will have enjoyed a sandwich by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The company will have enjoyed the game by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "John will have watched a documentary by later.",
      "verb": "watched"
    },
    {
      "sentence": "By tomorrow, the dog will have come to the office.",
      "verb": "come"
    },
    {
      "sentence": "Sarah will have practiced the lesson by then.",
      "verb": "practiced"
    },
    {
      "sentence": "By later, she will have designed the furniture.",
      "verb": "designed"
    },
    {
      "sentence": "She will have considered the birthday by then.",
      "verb": "considered"
    },
    {
      "sentence": "By soon, the bird will have remembered the situation.",
      "verb": "remembered"
    },
    {
      "sentence": "By tomorrow, john will have met the doctor.",
      "verb": "met"
    },
    {
      "sentence": "By tonight, my friend will have built the garden.",
      "verb": "built"
    },
    {
      "sentence": "She will have forgotten the meeting by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "My brother will have enjoyed a song by tonight.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My parents will have written the letter by then.",
      "verb": "written"
    },
    {
      "sentence": "By later, my brother will have left to the gym.",
      "verb": "left"
    },
    {
      "sentence": "Our neighbors will have forgotten the decision by next week.",
      "verb": "forgotten"
    },
    {
      "sentence": "The team will have called the team by then.",
      "verb": "called"
    },
    {
      "sentence": "They will have visited my family by this weekend.",
      "verb": "visited"
    },
    {
      "sentence": "Emma will have given flowers by then.",
      "verb": "given"
    },
    {
      "sentence": "She will have listened to a song by next month.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have found the keys by then.",
      "verb": "found"
    },
    {
      "sentence": "By this evening, her sister will have enjoyed the game.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, john will have prepared soup.",
      "verb": "prepared"
    },
    {
      "sentence": "You will have written the presentation by this evening.",
      "verb": "written"
    },
    {
      "sentence": "By next month, the cat will have forgotten the meeting.",
      "verb": "forgotten"
    },
    {
      "sentence": "My parents will have received the presentation by later.",
      "verb": "received"
    },
    {
      "sentence": "The students will have cooked a sandwich by then.",
      "verb": "cooked"
    },
    {
      "sentence": "Emma will have understood mathematics by soon.",
      "verb": "understood"
    },
    {
      "sentence": "John will have arrived downtown by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By next year, you will have called the manager.",
      "verb": "called"
    },
    {
      "sentence": "By next week, she will have designed the house.",
      "verb": "designed"
    },
    {
      "sentence": "By this weekend, the students will have forgotten the future.",
      "verb": "forgotten"
    },
    {
      "sentence": "By next month, the teacher will have found a book.",
      "verb": "found"
    },
    {
      "sentence": "The teacher will have called my friend by then.",
      "verb": "called"
    },
    {
      "sentence": "By this evening, my brother will have repaired the kitchen.",
      "verb": "repaired"
    },
    {
      "sentence": "The manager will have enjoyed a podcast by soon.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next year, the dog will have eaten a snack.",
      "verb": "eaten"
    },
    {
      "sentence": "Her sister will have repaired the house by then.",
      "verb": "repaired"
    },
    {
      "sentence": "They will have arrived to the library by later.",
      "verb": "arrived"
    },
    {
      "sentence": "Our neighbors will have come to the market by next year.",
      "verb": "come"
    },
    {
      "sentence": "The manager will have fixed the car by then.",
      "verb": "fixed"
    },
    {
      "sentence": "By soon, her sister will have played basketball.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, john will have thought about the event.",
      "verb": "thought"
    },
    {
      "sentence": "We will have listened to a song by this weekend.",
      "verb": "listened"
    },
    {
      "sentence": "Her sister will have listened to a song by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "By next month, she will have chosen a present.",
      "verb": "chosen"
    },
    {
      "sentence": "By soon, my friend will have given a laptop.",
      "verb": "given"
    },
    {
      "sentence": "The company will have watched music by this evening.",
      "verb": "watched"
    },
    {
      "sentence": "Our neighbors will have met the manager by next year.",
      "verb": "met"
    },
    {
      "sentence": "By next week, my friend will have played a podcast.",
      "verb": "played"
    },
    {
      "sentence": "By next year, the dog will have given a present.",
      "verb": "given"
    },
    {
      "sentence": "By next month, the children will have sold groceries.",
      "verb": "sold"
    },
    {
      "sentence": "By this weekend, the company will have cooked pizza.",
      "verb": "cooked"
    },
    {
      "sentence": "The teacher will have remembered the situation by next month.",
      "verb": "remembered"
    },
    {
      "sentence": "The teacher will have arrived to the market by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By next week, john will have enjoyed a movie.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, john will have built the room.",
      "verb": "built"
    },
    {
      "sentence": "I will have come home by then.",
      "verb": "come"
    },
    {
      "sentence": "The children will have written the assignment by then.",
      "verb": "written"
    },
    {
      "sentence": "Emma will have planned the birthday by this weekend.",
      "verb": "planned"
    },
    {
      "sentence": "By later, my brother will have designed the bathroom.",
      "verb": "designed"
    },
    {
      "sentence": "She will have bought the phone by then.",
      "verb": "bought"
    },
    {
      "sentence": "We will have met the neighbors by then.",
      "verb": "met"
    },
    {
      "sentence": "You will have walked to school by tomorrow.",
      "verb": "walked"
    },
    {
      "sentence": "By next month, john will have reviewed grammar.",
      "verb": "reviewed"
    },
    {
      "sentence": "The company will have remembered the future by then.",
      "verb": "remembered"
    },
    {
      "sentence": "Sarah will have come to the beach by then.",
      "verb": "come"
    },
    {
      "sentence": "By next week, my friend will have met the doctor.",
      "verb": "met"
    },
    {
      "sentence": "She will have enjoyed tennis by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The company will have gone home by next year.",
      "verb": "gone"
    },
    {
      "sentence": "Her sister will have sold a gift by in two days.",
      "verb": "sold"
    },
    {
      "sentence": "We will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "By later, the team will have sold the phone.",
      "verb": "sold"
    },
    {
      "sentence": "By next month, i will have thought about the situation.",
      "verb": "thought"
    },
    {
      "sentence": "They will have ordered soup by soon.",
      "verb": "ordered"
    },
    {
      "sentence": "The manager will have written the letter by then.",
      "verb": "written"
    },
    {
      "sentence": "The bird will have visited the client by then.",
      "verb": "visited"
    },
    {
      "sentence": "By next month, i will have remembered the event.",
      "verb": "remembered"
    },
    {
      "sentence": "By next year, my parents will have practiced English.",
      "verb": "practiced"
    },
    {
      "sentence": "The children will have submitted the letter by then.",
      "verb": "submitted"
    },
    {
      "sentence": "We will have prepared soup by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By next week, her sister will have chosen a present.",
      "verb": "chosen"
    },
    {
      "sentence": "The company will have listened to the news by then.",
      "verb": "listened"
    },
    {
      "sentence": "By later, the team will have arrived to the market.",
      "verb": "arrived"
    },
    {
      "sentence": "By this weekend, my parents will have given clothes.",
      "verb": "given"
    },
    {
      "sentence": "The company will have remembered the vacation by in two days.",
      "verb": "remembered"
    },
    {
      "sentence": "Her sister will have played the game by then.",
      "verb": "played"
    },
    {
      "sentence": "The team will have practiced the textbook by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The cat will have talked the team by then.",
      "verb": "talked"
    },
    {
      "sentence": "By this weekend, my parents will have given the phone.",
      "verb": "given"
    },
    {
      "sentence": "By next year, the bird will have planned the trip.",
      "verb": "planned"
    },
    {
      "sentence": "The manager will have designed the bathroom by then.",
      "verb": "designed"
    },
    {
      "sentence": "My friend will have started the letter by then.",
      "verb": "started"
    },
    {
      "sentence": "By next month, the teacher will have taught Spanish.",
      "verb": "taught"
    },
    {
      "sentence": "Sarah will have fixed the car by tonight.",
      "verb": "fixed"
    },
    {
      "sentence": "By next year, they will have forgotten the meeting.",
      "verb": "forgotten"
    },
    {
      "sentence": "By tonight, the students will have ordered juice.",
      "verb": "ordered"
    },
    {
      "sentence": "Her sister will have arrived to the park by then.",
      "verb": "arrived"
    },
    {
      "sentence": "He will have taught the chapter by tonight.",
      "verb": "taught"
    },
    {
      "sentence": "My brother will have enjoyed music by this weekend.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The cat will have submitted the assignment by then.",
      "verb": "submitted"
    },
    {
      "sentence": "The manager will have written the presentation by then.",
      "verb": "written"
    },
    {
      "sentence": "They will have met the teacher by next week.",
      "verb": "met"
    },
    {
      "sentence": "The cat will have fixed the house by later.",
      "verb": "fixed"
    },
    {
      "sentence": "By in two days, the children will have gotten a book.",
      "verb": "gotten"
    },
    {
      "sentence": "The company will have watched music by then.",
      "verb": "watched"
    },
    {
      "sentence": "He will have enjoyed a podcast by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Her sister will have considered the future by later.",
      "verb": "considered"
    },
    {
      "sentence": "The company will have flown to work by then.",
      "verb": "flown"
    },
    {
      "sentence": "By this weekend, i will have reviewed science.",
      "verb": "reviewed"
    },
    {
      "sentence": "He will have enjoyed a salad by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The company will have drunk lunch by then.",
      "verb": "drunk"
    },
    {
      "sentence": "You will have received the report by then.",
      "verb": "received"
    },
    {
      "sentence": "We will have drawn the furniture by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The team will have given a laptop by then.",
      "verb": "given"
    },
    {
      "sentence": "By tonight, her sister will have eaten pasta.",
      "verb": "eaten"
    },
    {
      "sentence": "Our neighbors will have called the boss by tonight.",
      "verb": "called"
    },
    {
      "sentence": "By this evening, tom will have driven home.",
      "verb": "driven"
    },
    {
      "sentence": "I will have repaired the room by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By next month, my friend will have listened to the news.",
      "verb": "listened"
    },
    {
      "sentence": "Sarah will have enjoyed a documentary by in two days.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next month, the bird will have painted the computer.",
      "verb": "painted"
    },
    {
      "sentence": "My parents will have remembered the trip by in two days.",
      "verb": "remembered"
    },
    {
      "sentence": "By next year, emma will have considered the birthday.",
      "verb": "considered"
    },
    {
      "sentence": "The manager will have bought a present by soon.",
      "verb": "bought"
    },
    {
      "sentence": "I will have flown home by then.",
      "verb": "flown"
    },
    {
      "sentence": "By this weekend, the students will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "Our neighbors will have come to the market by then.",
      "verb": "come"
    },
    {
      "sentence": "Tom will have started the task by then.",
      "verb": "started"
    },
    {
      "sentence": "She will have completed the presentation by then.",
      "verb": "completed"
    },
    {
      "sentence": "By this weekend, my parents will have thought about the trip.",
      "verb": "thought"
    },
    {
      "sentence": "The students will have studied Spanish by in two days.",
      "verb": "studied"
    },
    {
      "sentence": "You will have fixed the bathroom by next week.",
      "verb": "fixed"
    },
    {
      "sentence": "The bird will have bought clothes by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "They will have cleaned a website by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "By tomorrow, tom will have ordered breakfast.",
      "verb": "ordered"
    },
    {
      "sentence": "By this weekend, my brother will have completed the contract.",
      "verb": "completed"
    },
    {
      "sentence": "By tonight, i will have left to the airport.",
      "verb": "left"
    },
    {
      "sentence": "John will have eaten a snack by then.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, the students will have gotten a gift.",
      "verb": "gotten"
    },
    {
      "sentence": "The cat will have thought about the problem by then.",
      "verb": "thought"
    },
    {
      "sentence": "By in two days, the team will have gotten a gift.",
      "verb": "gotten"
    },
    {
      "sentence": "Emma will have completed the presentation by this weekend.",
      "verb": "completed"
    },
    {
      "sentence": "Her sister will have submitted the report by then.",
      "verb": "submitted"
    },
    {
      "sentence": "The children will have eaten lunch by then.",
      "verb": "eaten"
    },
    {
      "sentence": "John will have enjoyed football by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, the company will have spoken the neighbors.",
      "verb": "spoken"
    },
    {
      "sentence": "The company will have designed the car by later.",
      "verb": "designed"
    },
    {
      "sentence": "By soon, they will have remembered the vacation.",
      "verb": "remembered"
    },
    {
      "sentence": "They will have written the project by next month.",
      "verb": "written"
    },
    {
      "sentence": "My friend will have designed the furniture by tonight.",
      "verb": "designed"
    },
    {
      "sentence": "By in two days, my friend will have prepared pizza.",
      "verb": "prepared"
    },
    {
      "sentence": "My friend will have played music by then.",
      "verb": "played"
    },
    {
      "sentence": "My parents will have listened to a song by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "We will have listened to music by then.",
      "verb": "listened"
    },
    {
      "sentence": "By later, we will have understood vocabulary.",
      "verb": "understood"
    },
    {
      "sentence": "By next week, the cat will have written the application.",
      "verb": "written"
    },
    {
      "sentence": "Our neighbors will have chosen groceries by next month.",
      "verb": "chosen"
    },
    {
      "sentence": "Her sister will have studied the lesson by then.",
      "verb": "studied"
    },
    {
      "sentence": "By in two days, my friend will have completed the presentation.",
      "verb": "completed"
    },
    {
      "sentence": "John will have repaired the car by next year.",
      "verb": "repaired"
    },
    {
      "sentence": "My friend will have studied the lesson by then.",
      "verb": "studied"
    },
    {
      "sentence": "The bird will have drunk pizza by then.",
      "verb": "drunk"
    },
    {
      "sentence": "By tonight, my brother will have enjoyed tea.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, my friend will have talked my parents.",
      "verb": "talked"
    },
    {
      "sentence": "John will have drawn a website by tomorrow.",
      "verb": "drawn"
    },
    {
      "sentence": "By next week, my brother will have taught the chapter.",
      "verb": "taught"
    },
    {
      "sentence": "The teacher will have drunk a salad by then.",
      "verb": "drunk"
    },
    {
      "sentence": "Tom will have reviewed the chapter by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "By soon, the bird will have called the manager.",
      "verb": "called"
    },
    {
      "sentence": "The dog will have prepared lunch by then.",
      "verb": "prepared"
    },
    {
      "sentence": "John will have spoken the teacher by tonight.",
      "verb": "spoken"
    },
    {
      "sentence": "The bird will have sold the ticket by then.",
      "verb": "sold"
    },
    {
      "sentence": "The teacher will have left to school by next week.",
      "verb": "left"
    },
    {
      "sentence": "By next month, sarah will have sold the phone.",
      "verb": "sold"
    },
    {
      "sentence": "By next month, she will have come to school.",
      "verb": "come"
    },
    {
      "sentence": "The teacher will have played music by then.",
      "verb": "played"
    },
    {
      "sentence": "By tomorrow, the teacher will have flown to the store.",
      "verb": "flown"
    },
    {
      "sentence": "By soon, we will have sold the phone.",
      "verb": "sold"
    },
    {
      "sentence": "By next month, i will have found the keys.",
      "verb": "found"
    },
    {
      "sentence": "By in two days, the team will have started the presentation.",
      "verb": "started"
    },
    {
      "sentence": "My parents will have considered the problem by tonight.",
      "verb": "considered"
    },
    {
      "sentence": "By tomorrow, the bird will have given a book.",
      "verb": "given"
    },
    {
      "sentence": "The team will have planned the situation by then.",
      "verb": "planned"
    },
    {
      "sentence": "The students will have prepared pasta by then.",
      "verb": "prepared"
    },
    {
      "sentence": "You will have received the application by next month.",
      "verb": "received"
    },
    {
      "sentence": "The manager will have understood grammar by then.",
      "verb": "understood"
    },
    {
      "sentence": "My brother will have painted the kitchen by then.",
      "verb": "painted"
    },
    {
      "sentence": "The teacher will have flown to the store by then.",
      "verb": "flown"
    },
    {
      "sentence": "By next week, the children will have submitted the email.",
      "verb": "submitted"
    },
    {
      "sentence": "The manager will have considered the trip by soon.",
      "verb": "considered"
    },
    {
      "sentence": "My friend will have left to the office by tonight.",
      "verb": "left"
    },
    {
      "sentence": "By tonight, sarah will have painted the computer.",
      "verb": "painted"
    },
    {
      "sentence": "By soon, tom will have gotten the ticket.",
      "verb": "gotten"
    },
    {
      "sentence": "Sarah will have completed the letter by later.",
      "verb": "completed"
    },
    {
      "sentence": "My brother will have spoken the client by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By later, the company will have gotten the ticket.",
      "verb": "gotten"
    },
    {
      "sentence": "The team will have watched football by then.",
      "verb": "watched"
    },
    {
      "sentence": "The teacher will have given groceries by then.",
      "verb": "given"
    },
    {
      "sentence": "You will have ordered a salad by then.",
      "verb": "ordered"
    },
    {
      "sentence": "The team will have spoken my friend by then.",
      "verb": "spoken"
    },
    {
      "sentence": "By this weekend, my brother will have taught English.",
      "verb": "taught"
    },
    {
      "sentence": "Our neighbors will have enjoyed breakfast by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "He will have driven to the store by in two days.",
      "verb": "driven"
    },
    {
      "sentence": "Sarah will have gotten a gift by later.",
      "verb": "gotten"
    },
    {
      "sentence": "Our neighbors will have finished the document by then.",
      "verb": "finished"
    },
    {
      "sentence": "Our neighbors will have written the proposal by then.",
      "verb": "written"
    },
    {
      "sentence": "We will have written the email by then.",
      "verb": "written"
    },
    {
      "sentence": "By tomorrow, you will have bought groceries.",
      "verb": "bought"
    },
    {
      "sentence": "My friend will have practiced grammar by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The children will have cleaned the kitchen by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "We will have planned the decision by this evening.",
      "verb": "planned"
    },
    {
      "sentence": "My parents will have played a documentary by tonight.",
      "verb": "played"
    },
    {
      "sentence": "We will have practiced French by this weekend.",
      "verb": "practiced"
    },
    {
      "sentence": "The teacher will have spoken the team by next week.",
      "verb": "spoken"
    },
    {
      "sentence": "The team will have ordered soup by then.",
      "verb": "ordered"
    },
    {
      "sentence": "The children will have considered the options by then.",
      "verb": "considered"
    },
    {
      "sentence": "Her sister will have talked the client by next year.",
      "verb": "talked"
    },
    {
      "sentence": "The cat will have found a present by soon.",
      "verb": "found"
    },
    {
      "sentence": "You will have gotten the phone by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The bird will have submitted the proposal by then.",
      "verb": "submitted"
    },
    {
      "sentence": "By next month, we will have contacted the manager.",
      "verb": "contacted"
    },
    {
      "sentence": "By later, we will have reviewed science.",
      "verb": "reviewed"
    },
    {
      "sentence": "We will have considered the problem by then.",
      "verb": "considered"
    },
    {
      "sentence": "He will have run to work by then.",
      "verb": "run"
    },
    {
      "sentence": "John will have listened to a documentary by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "My friend will have found a new car by later.",
      "verb": "found"
    },
    {
      "sentence": "The bird will have driven to the gym by tonight.",
      "verb": "driven"
    },
    {
      "sentence": "The dog will have finished the task by then.",
      "verb": "finished"
    },
    {
      "sentence": "The bird will have eaten breakfast by then.",
      "verb": "eaten"
    },
    {
      "sentence": "We will have learned mathematics by this weekend.",
      "verb": "learned"
    },
    {
      "sentence": "The cat will have enjoyed a song by this evening.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Tom will have written the email by then.",
      "verb": "written"
    },
    {
      "sentence": "By this evening, the manager will have sold flowers.",
      "verb": "sold"
    },
    {
      "sentence": "My parents will have bought a new car by tonight.",
      "verb": "bought"
    },
    {
      "sentence": "Her sister will have contacted my friend by then.",
      "verb": "contacted"
    },
    {
      "sentence": "She will have fixed a website by then.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have cooked a salad by then.",
      "verb": "cooked"
    },
    {
      "sentence": "My friend will have visited the manager by then.",
      "verb": "visited"
    },
    {
      "sentence": "The manager will have run to the library by then.",
      "verb": "run"
    },
    {
      "sentence": "Tom will have started the contract by next week.",
      "verb": "started"
    },
    {
      "sentence": "By tomorrow, sarah will have chosen a present.",
      "verb": "chosen"
    },
    {
      "sentence": "They will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, the dog will have given a book.",
      "verb": "given"
    },
    {
      "sentence": "By this weekend, john will have learned for the exam.",
      "verb": "learned"
    },
    {
      "sentence": "By this weekend, our neighbors will have drunk lunch.",
      "verb": "drunk"
    },
    {
      "sentence": "The company will have thought about the problem by then.",
      "verb": "thought"
    },
    {
      "sentence": "By next year, our neighbors will have watched TV.",
      "verb": "watched"
    },
    {
      "sentence": "We will have considered the situation by soon.",
      "verb": "considered"
    },
    {
      "sentence": "The bird will have written the assignment by then.",
      "verb": "written"
    },
    {
      "sentence": "By tomorrow, she will have considered the future.",
      "verb": "considered"
    },
    {
      "sentence": "By tomorrow, tom will have finished the email.",
      "verb": "finished"
    },
    {
      "sentence": "My brother will have planned the problem by next month.",
      "verb": "planned"
    },
    {
      "sentence": "The cat will have practiced for the exam by then.",
      "verb": "practiced"
    },
    {
      "sentence": "By next year, the team will have called the teacher.",
      "verb": "called"
    },
    {
      "sentence": "My friend will have written the project by then.",
      "verb": "written"
    },
    {
      "sentence": "He will have arrived to the market by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The children will have talked the doctor by tonight.",
      "verb": "talked"
    },
    {
      "sentence": "Tom will have drunk soup by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The team will have walked to the beach by then.",
      "verb": "walked"
    },
    {
      "sentence": "I will have studied vocabulary by then.",
      "verb": "studied"
    },
    {
      "sentence": "We will have ordered tea by this weekend.",
      "verb": "ordered"
    },
    {
      "sentence": "By tomorrow, john will have chosen groceries.",
      "verb": "chosen"
    },
    {
      "sentence": "Tom will have drunk breakfast by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The children will have visited the teacher by later.",
      "verb": "visited"
    },
    {
      "sentence": "Her sister will have gotten flowers by in two days.",
      "verb": "gotten"
    },
    {
      "sentence": "The company will have come to the beach by then.",
      "verb": "come"
    },
    {
      "sentence": "She will have watched TV by later.",
      "verb": "watched"
    },
    {
      "sentence": "My parents will have read vocabulary by then.",
      "verb": "read"
    },
    {
      "sentence": "He will have taught vocabulary by next week.",
      "verb": "taught"
    },
    {
      "sentence": "By this evening, the team will have forgotten the situation.",
      "verb": "forgotten"
    },
    {
      "sentence": "Sarah will have visited the boss by tonight.",
      "verb": "visited"
    },
    {
      "sentence": "He will have sent the presentation by tonight.",
      "verb": "sent"
    },
    {
      "sentence": "Her sister will have ordered a snack by in two days.",
      "verb": "ordered"
    },
    {
      "sentence": "My friend will have understood history by this evening.",
      "verb": "understood"
    },
    {
      "sentence": "The teacher will have planned the decision by next month.",
      "verb": "planned"
    },
    {
      "sentence": "Her sister will have enjoyed breakfast by tonight.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this evening, the children will have listened to a podcast.",
      "verb": "listened"
    },
    {
      "sentence": "By this evening, you will have eaten lunch.",
      "verb": "eaten"
    },
    {
      "sentence": "By next year, my parents will have repaired the bathroom.",
      "verb": "repaired"
    },
    {
      "sentence": "The teacher will have taught Spanish by then.",
      "verb": "taught"
    },
    {
      "sentence": "She will have listened to a podcast by this weekend.",
      "verb": "listened"
    },
    {
      "sentence": "My brother will have chosen a present by tomorrow.",
      "verb": "chosen"
    },
    {
      "sentence": "Sarah will have built the house by soon.",
      "verb": "built"
    },
    {
      "sentence": "Tom will have prepared juice by next year.",
      "verb": "prepared"
    },
    {
      "sentence": "He will have called the doctor by next week.",
      "verb": "called"
    },
    {
      "sentence": "I will have planned the decision by soon.",
      "verb": "planned"
    },
    {
      "sentence": "The teacher will have called the teacher by next year.",
      "verb": "called"
    },
    {
      "sentence": "By next month, the students will have designed the garden.",
      "verb": "designed"
    },
    {
      "sentence": "The children will have cleaned the garden by this evening.",
      "verb": "cleaned"
    },
    {
      "sentence": "By this evening, the bird will have remembered the future.",
      "verb": "remembered"
    },
    {
      "sentence": "Sarah will have prepared juice by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By in two days, she will have enjoyed TV.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By later, my parents will have flown to the library.",
      "verb": "flown"
    },
    {
      "sentence": "My parents will have understood French by soon.",
      "verb": "understood"
    },
    {
      "sentence": "The cat will have sent the presentation by then.",
      "verb": "sent"
    },
    {
      "sentence": "Our neighbors will have cooked tea by next month.",
      "verb": "cooked"
    },
    {
      "sentence": "She will have planned the options by in two days.",
      "verb": "planned"
    },
    {
      "sentence": "Her sister will have eaten coffee by next year.",
      "verb": "eaten"
    },
    {
      "sentence": "They will have given the keys by next month.",
      "verb": "given"
    },
    {
      "sentence": "By this weekend, he will have given clothes.",
      "verb": "given"
    },
    {
      "sentence": "By tonight, the team will have built the garden.",
      "verb": "built"
    },
    {
      "sentence": "He will have understood English by next week.",
      "verb": "understood"
    },
    {
      "sentence": "Tom will have enjoyed the game by this evening.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, the manager will have called the team.",
      "verb": "called"
    },
    {
      "sentence": "The children will have submitted the task by next year.",
      "verb": "submitted"
    },
    {
      "sentence": "The students will have gotten a laptop by next year.",
      "verb": "gotten"
    },
    {
      "sentence": "Our neighbors will have contacted the doctor by then.",
      "verb": "contacted"
    },
    {
      "sentence": "My brother will have gotten clothes by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By this weekend, you will have thought about the problem.",
      "verb": "thought"
    },
    {
      "sentence": "My parents will have called the boss by next year.",
      "verb": "called"
    },
    {
      "sentence": "By next year, my parents will have gotten a new car.",
      "verb": "gotten"
    },
    {
      "sentence": "My brother will have gotten a gift by then.",
      "verb": "gotten"
    },
    {
      "sentence": "The company will have listened to a movie by in two days.",
      "verb": "listened"
    },
    {
      "sentence": "She will have taught the textbook by then.",
      "verb": "taught"
    },
    {
      "sentence": "By this evening, tom will have left to the beach.",
      "verb": "left"
    },
    {
      "sentence": "By next week, she will have watched the game.",
      "verb": "watched"
    },
    {
      "sentence": "The cat will have sold a present by this weekend.",
      "verb": "sold"
    },
    {
      "sentence": "The dog will have considered the event by in two days.",
      "verb": "considered"
    },
    {
      "sentence": "My friend will have finished the contract by then.",
      "verb": "finished"
    },
    {
      "sentence": "By tomorrow, the children will have built the furniture.",
      "verb": "built"
    },
    {
      "sentence": "By tonight, the students will have found flowers.",
      "verb": "found"
    },
    {
      "sentence": "They will have started the application by tomorrow.",
      "verb": "started"
    },
    {
      "sentence": "He will have made coffee by then.",
      "verb": "made"
    },
    {
      "sentence": "Emma will have taught French by soon.",
      "verb": "taught"
    },
    {
      "sentence": "My parents will have cooked coffee by tonight.",
      "verb": "cooked"
    },
    {
      "sentence": "By this weekend, the bird will have cleaned a picture.",
      "verb": "cleaned"
    },
    {
      "sentence": "My brother will have made a salad by tonight.",
      "verb": "made"
    },
    {
      "sentence": "John will have considered the problem by then.",
      "verb": "considered"
    },
    {
      "sentence": "By next year, my friend will have ordered a salad.",
      "verb": "ordered"
    },
    {
      "sentence": "By tomorrow, tom will have studied mathematics.",
      "verb": "studied"
    },
    {
      "sentence": "I will have ordered lunch by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By this evening, they will have spoken my friend.",
      "verb": "spoken"
    },
    {
      "sentence": "The teacher will have met the doctor by then.",
      "verb": "met"
    },
    {
      "sentence": "The team will have drawn the house by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The team will have cleaned the house by this evening.",
      "verb": "cleaned"
    },
    {
      "sentence": "The children will have found a new car by then.",
      "verb": "found"
    },
    {
      "sentence": "Our neighbors will have sold groceries by then.",
      "verb": "sold"
    },
    {
      "sentence": "My parents will have listened to tennis by then.",
      "verb": "listened"
    },
    {
      "sentence": "By this weekend, they will have given groceries.",
      "verb": "given"
    },
    {
      "sentence": "The team will have flown to the store by in two days.",
      "verb": "flown"
    },
    {
      "sentence": "Sarah will have contacted the manager by then.",
      "verb": "contacted"
    },
    {
      "sentence": "They will have found the phone by then.",
      "verb": "found"
    },
    {
      "sentence": "Emma will have practiced the lesson by this evening.",
      "verb": "practiced"
    },
    {
      "sentence": "The students will have visited the doctor by this evening.",
      "verb": "visited"
    },
    {
      "sentence": "We will have remembered the situation by next year.",
      "verb": "remembered"
    },
    {
      "sentence": "My brother will have read the chapter by tomorrow.",
      "verb": "read"
    },
    {
      "sentence": "Emma will have arrived home by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The cat will have run home by then.",
      "verb": "run"
    },
    {
      "sentence": "My parents will have submitted the email by next month.",
      "verb": "submitted"
    },
    {
      "sentence": "The children will have learned English by later.",
      "verb": "learned"
    },
    {
      "sentence": "The bird will have fixed a picture by later.",
      "verb": "fixed"
    },
    {
      "sentence": "By later, the students will have left to the beach.",
      "verb": "left"
    },
    {
      "sentence": "By tomorrow, the cat will have sold groceries.",
      "verb": "sold"
    },
    {
      "sentence": "My parents will have planned the meeting by soon.",
      "verb": "planned"
    },
    {
      "sentence": "By next month, the children will have enjoyed the news.",
      "verb": "enjoyed"
    },
    {
      "sentence": "My friend will have spoken the neighbors by soon.",
      "verb": "spoken"
    },
    {
      "sentence": "He will have submitted the document by then.",
      "verb": "submitted"
    },
    {
      "sentence": "Our neighbors will have painted the furniture by then.",
      "verb": "painted"
    },
    {
      "sentence": "By this evening, john will have cleaned the kitchen.",
      "verb": "cleaned"
    },
    {
      "sentence": "I will have arrived to the market by then.",
      "verb": "arrived"
    },
    {
      "sentence": "Our neighbors will have drunk lunch by soon.",
      "verb": "drunk"
    },
    {
      "sentence": "By in two days, my parents will have watched music.",
      "verb": "watched"
    },
    {
      "sentence": "The team will have given flowers by then.",
      "verb": "given"
    },
    {
      "sentence": "Tom will have cleaned the garden by in two days.",
      "verb": "cleaned"
    },
    {
      "sentence": "By this evening, the students will have taught mathematics.",
      "verb": "taught"
    },
    {
      "sentence": "By next year, the manager will have considered the meeting.",
      "verb": "considered"
    },
    {
      "sentence": "By tomorrow, the bird will have cleaned the car.",
      "verb": "cleaned"
    },
    {
      "sentence": "Our neighbors will have met the client by then.",
      "verb": "met"
    },
    {
      "sentence": "We will have given the ticket by then.",
      "verb": "given"
    },
    {
      "sentence": "He will have given a present by then.",
      "verb": "given"
    },
    {
      "sentence": "By in two days, my parents will have remembered the vacation.",
      "verb": "remembered"
    },
    {
      "sentence": "By next month, the cat will have drawn the computer.",
      "verb": "drawn"
    },
    {
      "sentence": "I will have studied the lesson by this weekend.",
      "verb": "studied"
    },
    {
      "sentence": "The teacher will have watched basketball by next week.",
      "verb": "watched"
    },
    {
      "sentence": "My friend will have made juice by next month.",
      "verb": "made"
    },
    {
      "sentence": "The teacher will have remembered the situation by soon.",
      "verb": "remembered"
    },
    {
      "sentence": "By this evening, my brother will have repaired the garden.",
      "verb": "repaired"
    },
    {
      "sentence": "By later, i will have contacted the neighbors.",
      "verb": "contacted"
    },
    {
      "sentence": "The team will have played tennis by then.",
      "verb": "played"
    },
    {
      "sentence": "By this weekend, john will have watched a video.",
      "verb": "watched"
    },
    {
      "sentence": "We will have watched a song by in two days.",
      "verb": "watched"
    },
    {
      "sentence": "The dog will have prepared juice by next week.",
      "verb": "prepared"
    },
    {
      "sentence": "She will have understood grammar by tomorrow.",
      "verb": "understood"
    },
    {
      "sentence": "The company will have run to the park by tomorrow.",
      "verb": "run"
    },
    {
      "sentence": "My brother will have gotten a book by tomorrow.",
      "verb": "gotten"
    },
    {
      "sentence": "By in two days, they will have cleaned the car.",
      "verb": "cleaned"
    },
    {
      "sentence": "By tomorrow, the dog will have eaten a salad.",
      "verb": "eaten"
    },
    {
      "sentence": "By next month, she will have considered the vacation.",
      "verb": "considered"
    },
    {
      "sentence": "By soon, you will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "She will have written the assignment by soon.",
      "verb": "written"
    },
    {
      "sentence": "I will have thought about the event by next week.",
      "verb": "thought"
    },
    {
      "sentence": "The students will have spoken my parents by tomorrow.",
      "verb": "spoken"
    },
    {
      "sentence": "Sarah will have built the furniture by this evening.",
      "verb": "built"
    },
    {
      "sentence": "By tonight, my parents will have designed the garden.",
      "verb": "designed"
    },
    {
      "sentence": "Emma will have completed the project by then.",
      "verb": "completed"
    },
    {
      "sentence": "By this evening, the students will have prepared a snack.",
      "verb": "prepared"
    },
    {
      "sentence": "Her sister will have considered the situation by in two days.",
      "verb": "considered"
    },
    {
      "sentence": "The children will have studied the textbook by tomorrow.",
      "verb": "studied"
    },
    {
      "sentence": "My parents will have learned Spanish by then.",
      "verb": "learned"
    },
    {
      "sentence": "We will have run downtown by then.",
      "verb": "run"
    },
    {
      "sentence": "By this evening, the manager will have eaten pizza.",
      "verb": "eaten"
    },
    {
      "sentence": "By next week, my parents will have eaten juice.",
      "verb": "eaten"
    },
    {
      "sentence": "By in two days, the bird will have prepared lunch.",
      "verb": "prepared"
    },
    {
      "sentence": "By soon, john will have repaired a picture.",
      "verb": "repaired"
    },
    {
      "sentence": "Tom will have fixed the computer by then.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have bought flowers by then.",
      "verb": "bought"
    },
    {
      "sentence": "Emma will have planned the situation by next year.",
      "verb": "planned"
    },
    {
      "sentence": "I will have visited the neighbors by then.",
      "verb": "visited"
    },
    {
      "sentence": "They will have understood Spanish by then.",
      "verb": "understood"
    },
    {
      "sentence": "The bird will have completed the document by then.",
      "verb": "completed"
    },
    {
      "sentence": "They will have met the boss by later.",
      "verb": "met"
    },
    {
      "sentence": "I will have cooked coffee by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By tomorrow, the company will have gone to the office.",
      "verb": "gone"
    },
    {
      "sentence": "By soon, the dog will have watched a video.",
      "verb": "watched"
    },
    {
      "sentence": "By this evening, the company will have enjoyed dinner.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, the bird will have eaten coffee.",
      "verb": "eaten"
    },
    {
      "sentence": "By later, my brother will have sold a present.",
      "verb": "sold"
    },
    {
      "sentence": "The manager will have finished the document by next week.",
      "verb": "finished"
    },
    {
      "sentence": "By soon, john will have given a new car.",
      "verb": "given"
    },
    {
      "sentence": "The teacher will have taught the chapter by this weekend.",
      "verb": "taught"
    },
    {
      "sentence": "Sarah will have drawn a picture by then.",
      "verb": "drawn"
    },
    {
      "sentence": "The dog will have eaten a snack by then.",
      "verb": "eaten"
    },
    {
      "sentence": "I will have understood the lesson by next month.",
      "verb": "understood"
    },
    {
      "sentence": "By this evening, he will have forgotten the birthday.",
      "verb": "forgotten"
    },
    {
      "sentence": "I will have fixed a picture by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The manager will have forgotten the birthday by then.",
      "verb": "forgotten"
    },
    {
      "sentence": "My friend will have sold the keys by soon.",
      "verb": "sold"
    },
    {
      "sentence": "By next month, you will have come downtown.",
      "verb": "come"
    },
    {
      "sentence": "Emma will have finished the presentation by then.",
      "verb": "finished"
    },
    {
      "sentence": "You will have bought a new car by next year.",
      "verb": "bought"
    },
    {
      "sentence": "By later, john will have enjoyed a podcast.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The company will have completed the document by then.",
      "verb": "completed"
    },
    {
      "sentence": "Our neighbors will have chosen groceries by next week.",
      "verb": "chosen"
    },
    {
      "sentence": "The dog will have remembered the problem by next year.",
      "verb": "remembered"
    },
    {
      "sentence": "The manager will have given a gift by then.",
      "verb": "given"
    },
    {
      "sentence": "My friend will have taught vocabulary by tomorrow.",
      "verb": "taught"
    },
    {
      "sentence": "By next year, you will have painted the room.",
      "verb": "painted"
    },
    {
      "sentence": "By in two days, john will have met the doctor.",
      "verb": "met"
    },
    {
      "sentence": "By next week, we will have arrived to school.",
      "verb": "arrived"
    },
    {
      "sentence": "Our neighbors will have sold a present by then.",
      "verb": "sold"
    },
    {
      "sentence": "By soon, our neighbors will have forgotten the meeting.",
      "verb": "forgotten"
    },
    {
      "sentence": "The dog will have drawn the computer by tomorrow.",
      "verb": "drawn"
    },
    {
      "sentence": "Tom will have prepared a snack by then.",
      "verb": "prepared"
    },
    {
      "sentence": "By tomorrow, the children will have sold the phone.",
      "verb": "sold"
    },
    {
      "sentence": "By this evening, they will have taught French.",
      "verb": "taught"
    },
    {
      "sentence": "Emma will have drunk juice by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The company will have received the contract by then.",
      "verb": "received"
    },
    {
      "sentence": "By next week, the students will have taught science.",
      "verb": "taught"
    },
    {
      "sentence": "My brother will have finished the presentation by next year.",
      "verb": "finished"
    },
    {
      "sentence": "By next month, he will have walked to school.",
      "verb": "walked"
    },
    {
      "sentence": "By next month, her sister will have fixed a picture.",
      "verb": "fixed"
    },
    {
      "sentence": "Our neighbors will have talked my parents by then.",
      "verb": "talked"
    },
    {
      "sentence": "The company will have watched TV by then.",
      "verb": "watched"
    },
    {
      "sentence": "By later, the team will have made breakfast.",
      "verb": "made"
    },
    {
      "sentence": "The students will have arrived to the beach by then.",
      "verb": "arrived"
    },
    {
      "sentence": "By this evening, the manager will have considered the event.",
      "verb": "considered"
    },
    {
      "sentence": "The dog will have ordered lunch by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By later, the company will have reviewed Spanish.",
      "verb": "reviewed"
    },
    {
      "sentence": "Emma will have listened to a video by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "My parents will have bought a new car by then.",
      "verb": "bought"
    },
    {
      "sentence": "I will have forgotten the event by this evening.",
      "verb": "forgotten"
    },
    {
      "sentence": "She will have walked to the store by then.",
      "verb": "walked"
    },
    {
      "sentence": "She will have read Spanish by later.",
      "verb": "read"
    },
    {
      "sentence": "John will have met the client by then.",
      "verb": "met"
    },
    {
      "sentence": "He will have drawn the garden by tomorrow.",
      "verb": "drawn"
    },
    {
      "sentence": "By later, sarah will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "My parents will have submitted the contract by next year.",
      "verb": "submitted"
    },
    {
      "sentence": "You will have planned the birthday by then.",
      "verb": "planned"
    },
    {
      "sentence": "My brother will have listened to a song by this evening.",
      "verb": "listened"
    },
    {
      "sentence": "Our neighbors will have reviewed Spanish by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "The company will have gotten a laptop by next month.",
      "verb": "gotten"
    },
    {
      "sentence": "The students will have found clothes by this weekend.",
      "verb": "found"
    },
    {
      "sentence": "Her sister will have planned the trip by tomorrow.",
      "verb": "planned"
    },
    {
      "sentence": "The dog will have ordered pizza by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By later, the students will have cooked a snack.",
      "verb": "cooked"
    },
    {
      "sentence": "By this evening, we will have thought about the meeting.",
      "verb": "thought"
    },
    {
      "sentence": "He will have forgotten the meeting by in two days.",
      "verb": "forgotten"
    },
    {
      "sentence": "By next week, tom will have sold groceries.",
      "verb": "sold"
    },
    {
      "sentence": "Sarah will have considered the decision by then.",
      "verb": "considered"
    },
    {
      "sentence": "The team will have taught vocabulary by in two days.",
      "verb": "taught"
    },
    {
      "sentence": "Sarah will have chosen the keys by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By soon, the team will have planned the future.",
      "verb": "planned"
    },
    {
      "sentence": "By next year, the bird will have drawn the garden.",
      "verb": "drawn"
    },
    {
      "sentence": "The manager will have listened to tennis by next month.",
      "verb": "listened"
    },
    {
      "sentence": "The team will have planned the birthday by tomorrow.",
      "verb": "planned"
    },
    {
      "sentence": "By in two days, you will have made soup.",
      "verb": "made"
    },
    {
      "sentence": "You will have enjoyed tennis by next year.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By this weekend, the children will have remembered the problem.",
      "verb": "remembered"
    },
    {
      "sentence": "My brother will have taught the textbook by tonight.",
      "verb": "taught"
    },
    {
      "sentence": "John will have built the car by then.",
      "verb": "built"
    },
    {
      "sentence": "By later, tom will have understood science.",
      "verb": "understood"
    },
    {
      "sentence": "Sarah will have played basketball by then.",
      "verb": "played"
    },
    {
      "sentence": "I will have understood history by then.",
      "verb": "understood"
    },
    {
      "sentence": "The team will have gone to the market by in two days.",
      "verb": "gone"
    },
    {
      "sentence": "My friend will have sent the task by in two days.",
      "verb": "sent"
    },
    {
      "sentence": "The teacher will have watched the game by next month.",
      "verb": "watched"
    },
    {
      "sentence": "The students will have completed the document by this evening.",
      "verb": "completed"
    },
    {
      "sentence": "The cat will have learned for the exam by in two days.",
      "verb": "learned"
    },
    {
      "sentence": "John will have found groceries by then.",
      "verb": "found"
    },
    {
      "sentence": "Tom will have thought about the birthday by soon.",
      "verb": "thought"
    },
    {
      "sentence": "The company will have driven to the gym by then.",
      "verb": "driven"
    },
    {
      "sentence": "John will have fixed a website by then.",
      "verb": "fixed"
    },
    {
      "sentence": "The bird will have taught the chapter by then.",
      "verb": "taught"
    },
    {
      "sentence": "My parents will have given the ticket by next month.",
      "verb": "given"
    },
    {
      "sentence": "By next week, sarah will have drunk a snack.",
      "verb": "drunk"
    },
    {
      "sentence": "I will have submitted the project by then.",
      "verb": "submitted"
    },
    {
      "sentence": "By soon, they will have designed the room.",
      "verb": "designed"
    },
    {
      "sentence": "By tomorrow, my friend will have flown to work.",
      "verb": "flown"
    },
    {
      "sentence": "The teacher will have watched tennis by tonight.",
      "verb": "watched"
    },
    {
      "sentence": "We will have considered the situation by tonight.",
      "verb": "considered"
    },
    {
      "sentence": "By this evening, the children will have prepared tea.",
      "verb": "prepared"
    },
    {
      "sentence": "Tom will have enjoyed lunch by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Tom will have planned the meeting by then.",
      "verb": "planned"
    },
    {
      "sentence": "By tomorrow, tom will have cleaned the room.",
      "verb": "cleaned"
    },
    {
      "sentence": "By this evening, the teacher will have spoken the boss.",
      "verb": "spoken"
    },
    {
      "sentence": "The students will have studied English by then.",
      "verb": "studied"
    },
    {
      "sentence": "They will have ordered tea by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By this weekend, he will have taught grammar.",
      "verb": "taught"
    },
    {
      "sentence": "My friend will have visited my friend by then.",
      "verb": "visited"
    },
    {
      "sentence": "By later, my parents will have read vocabulary.",
      "verb": "read"
    },
    {
      "sentence": "We will have thought about the problem by then.",
      "verb": "thought"
    },
    {
      "sentence": "Our neighbors will have played football by then.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, the company will have practiced mathematics.",
      "verb": "practiced"
    },
    {
      "sentence": "By this evening, the cat will have painted the room.",
      "verb": "painted"
    },
    {
      "sentence": "The students will have designed the car by then.",
      "verb": "designed"
    },
    {
      "sentence": "The bird will have enjoyed pizza by in two days.",
      "verb": "enjoyed"
    },
    {
      "sentence": "She will have studied grammar by then.",
      "verb": "studied"
    },
    {
      "sentence": "We will have visited the boss by next month.",
      "verb": "visited"
    },
    {
      "sentence": "My parents will have spoken my family by then.",
      "verb": "spoken"
    },
    {
      "sentence": "I will have visited my family by then.",
      "verb": "visited"
    },
    {
      "sentence": "By this weekend, my friend will have listened to football.",
      "verb": "listened"
    },
    {
      "sentence": "The team will have left to the gym by in two days.",
      "verb": "left"
    },
    {
      "sentence": "My parents will have cooked a sandwich by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By this evening, the cat will have listened to a video.",
      "verb": "listened"
    },
    {
      "sentence": "You will have cleaned the bathroom by then.",
      "verb": "cleaned"
    },
    {
      "sentence": "The bird will have started the document by next month.",
      "verb": "started"
    },
    {
      "sentence": "Her sister will have visited the neighbors by then.",
      "verb": "visited"
    },
    {
      "sentence": "You will have enjoyed a video by soon.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next year, the manager will have cleaned the bathroom.",
      "verb": "cleaned"
    },
    {
      "sentence": "He will have designed a picture by then.",
      "verb": "designed"
    },
    {
      "sentence": "By next year, the dog will have cooked juice.",
      "verb": "cooked"
    },
    {
      "sentence": "The students will have completed the document by next year.",
      "verb": "completed"
    },
    {
      "sentence": "By tomorrow, the manager will have forgotten the situation.",
      "verb": "forgotten"
    },
    {
      "sentence": "Sarah will have enjoyed tennis by tomorrow.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The children will have returned to the market by this weekend.",
      "verb": "returned"
    },
    {
      "sentence": "By this weekend, sarah will have returned home.",
      "verb": "returned"
    },
    {
      "sentence": "By soon, the company will have remembered the vacation.",
      "verb": "remembered"
    },
    {
      "sentence": "By next year, they will have painted a website.",
      "verb": "painted"
    },
    {
      "sentence": "My friend will have played a movie by later.",
      "verb": "played"
    },
    {
      "sentence": "By this evening, tom will have watched the news.",
      "verb": "watched"
    },
    {
      "sentence": "The dog will have painted the house by then.",
      "verb": "painted"
    },
    {
      "sentence": "Her sister will have cleaned the room by next year.",
      "verb": "cleaned"
    },
    {
      "sentence": "By later, we will have gotten a book.",
      "verb": "gotten"
    },
    {
      "sentence": "Tom will have designed the garden by next week.",
      "verb": "designed"
    },
    {
      "sentence": "My brother will have sold clothes by soon.",
      "verb": "sold"
    },
    {
      "sentence": "By tomorrow, i will have talked the manager.",
      "verb": "talked"
    },
    {
      "sentence": "You will have sold a present by then.",
      "verb": "sold"
    },
    {
      "sentence": "By this evening, emma will have studied the chapter.",
      "verb": "studied"
    },
    {
      "sentence": "By this weekend, the children will have painted the room.",
      "verb": "painted"
    },
    {
      "sentence": "He will have built the furniture by then.",
      "verb": "built"
    },
    {
      "sentence": "By soon, sarah will have walked to the office.",
      "verb": "walked"
    },
    {
      "sentence": "Her sister will have finished the letter by next month.",
      "verb": "finished"
    },
    {
      "sentence": "Her sister will have planned the trip by then.",
      "verb": "planned"
    },
    {
      "sentence": "They will have submitted the document by next year.",
      "verb": "submitted"
    },
    {
      "sentence": "You will have prepared soup by then.",
      "verb": "prepared"
    },
    {
      "sentence": "We will have planned the future by then.",
      "verb": "planned"
    },
    {
      "sentence": "By this evening, he will have left to the office.",
      "verb": "left"
    },
    {
      "sentence": "By next year, the students will have given a present.",
      "verb": "given"
    },
    {
      "sentence": "By soon, we will have fixed a website.",
      "verb": "fixed"
    },
    {
      "sentence": "We will have painted a website by this weekend.",
      "verb": "painted"
    },
    {
      "sentence": "Tom will have planned the event by then.",
      "verb": "planned"
    },
    {
      "sentence": "The company will have returned to the office by later.",
      "verb": "returned"
    },
    {
      "sentence": "She will have flown to the gym by then.",
      "verb": "flown"
    },
    {
      "sentence": "Tom will have forgotten the options by in two days.",
      "verb": "forgotten"
    },
    {
      "sentence": "The team will have listened to basketball by soon.",
      "verb": "listened"
    },
    {
      "sentence": "By next week, we will have met my friend.",
      "verb": "met"
    },
    {
      "sentence": "They will have made tea by then.",
      "verb": "made"
    },
    {
      "sentence": "By this evening, john will have completed the letter.",
      "verb": "completed"
    },
    {
      "sentence": "By next week, she will have contacted the neighbors.",
      "verb": "contacted"
    },
    {
      "sentence": "My parents will have gone to the gym by then.",
      "verb": "gone"
    },
    {
      "sentence": "Our neighbors will have made dinner by tonight.",
      "verb": "made"
    },
    {
      "sentence": "By this weekend, emma will have cooked a salad.",
      "verb": "cooked"
    },
    {
      "sentence": "By in two days, the dog will have finished the report.",
      "verb": "finished"
    },
    {
      "sentence": "The children will have gotten the ticket by then.",
      "verb": "gotten"
    },
    {
      "sentence": "By tomorrow, she will have enjoyed breakfast.",
      "verb": "enjoyed"
    },
    {
      "sentence": "John will have repaired a website by then.",
      "verb": "repaired"
    },
    {
      "sentence": "Tom will have remembered the future by later.",
      "verb": "remembered"
    },
    {
      "sentence": "I will have played basketball by in two days.",
      "verb": "played"
    },
    {
      "sentence": "The dog will have run to school by soon.",
      "verb": "run"
    },
    {
      "sentence": "I will have drawn a picture by then.",
      "verb": "drawn"
    },
    {
      "sentence": "I will have ordered a snack by then.",
      "verb": "ordered"
    },
    {
      "sentence": "By later, the students will have bought a new car.",
      "verb": "bought"
    },
    {
      "sentence": "By soon, the cat will have written the contract.",
      "verb": "written"
    },
    {
      "sentence": "The team will have sent the letter by then.",
      "verb": "sent"
    },
    {
      "sentence": "By next month, my friend will have visited the client.",
      "verb": "visited"
    },
    {
      "sentence": "My parents will have bought the phone by then.",
      "verb": "bought"
    },
    {
      "sentence": "I will have contacted my family by this weekend.",
      "verb": "contacted"
    },
    {
      "sentence": "By next month, you will have walked downtown.",
      "verb": "walked"
    },
    {
      "sentence": "By in two days, the dog will have played TV.",
      "verb": "played"
    },
    {
      "sentence": "You will have completed the presentation by tonight.",
      "verb": "completed"
    },
    {
      "sentence": "My friend will have flown to the market by then.",
      "verb": "flown"
    },
    {
      "sentence": "You will have remembered the decision by then.",
      "verb": "remembered"
    },
    {
      "sentence": "By tomorrow, the cat will have started the task.",
      "verb": "started"
    },
    {
      "sentence": "The dog will have built the kitchen by this weekend.",
      "verb": "built"
    },
    {
      "sentence": "Sarah will have finished the presentation by then.",
      "verb": "finished"
    },
    {
      "sentence": "By next month, her sister will have reviewed history.",
      "verb": "reviewed"
    },
    {
      "sentence": "By this weekend, we will have completed the email.",
      "verb": "completed"
    },
    {
      "sentence": "Tom will have run to work by then.",
      "verb": "run"
    },
    {
      "sentence": "Emma will have called my friend by then.",
      "verb": "called"
    },
    {
      "sentence": "Emma will have contacted my friend by this evening.",
      "verb": "contacted"
    },
    {
      "sentence": "The students will have bought a gift by then.",
      "verb": "bought"
    },
    {
      "sentence": "My friend will have met the teacher by this evening.",
      "verb": "met"
    },
    {
      "sentence": "Emma will have sent the letter by next year.",
      "verb": "sent"
    },
    {
      "sentence": "My friend will have listened to a documentary by then.",
      "verb": "listened"
    },
    {
      "sentence": "The students will have given a new car by then.",
      "verb": "given"
    },
    {
      "sentence": "By later, john will have written the presentation.",
      "verb": "written"
    },
    {
      "sentence": "Sarah will have cooked lunch by then.",
      "verb": "cooked"
    },
    {
      "sentence": "By this evening, the team will have watched tennis.",
      "verb": "watched"
    },
    {
      "sentence": "Her sister will have started the letter by then.",
      "verb": "started"
    },
    {
      "sentence": "Emma will have met the team by soon.",
      "verb": "met"
    },
    {
      "sentence": "They will have cleaned the computer by tonight.",
      "verb": "cleaned"
    },
    {
      "sentence": "By later, the cat will have remembered the options.",
      "verb": "remembered"
    },
    {
      "sentence": "The manager will have driven to the library by later.",
      "verb": "driven"
    },
    {
      "sentence": "The team will have spoken the client by then.",
      "verb": "spoken"
    },
    {
      "sentence": "The cat will have painted the car by next week.",
      "verb": "painted"
    },
    {
      "sentence": "She will have come to the store by tonight.",
      "verb": "come"
    },
    {
      "sentence": "By next week, sarah will have taught the chapter.",
      "verb": "taught"
    },
    {
      "sentence": "By next month, john will have met the manager.",
      "verb": "met"
    },
    {
      "sentence": "The manager will have started the report by then.",
      "verb": "started"
    },
    {
      "sentence": "We will have driven home by later.",
      "verb": "driven"
    },
    {
      "sentence": "The teacher will have called my friend by in two days.",
      "verb": "called"
    },
    {
      "sentence": "The team will have painted the bathroom by later.",
      "verb": "painted"
    },
    {
      "sentence": "He will have designed the furniture by then.",
      "verb": "designed"
    },
    {
      "sentence": "John will have watched basketball by next month.",
      "verb": "watched"
    },
    {
      "sentence": "My friend will have sent the document by then.",
      "verb": "sent"
    },
    {
      "sentence": "Emma will have enjoyed a snack by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By in two days, i will have walked home.",
      "verb": "walked"
    },
    {
      "sentence": "Emma will have chosen a present by then.",
      "verb": "chosen"
    },
    {
      "sentence": "By later, he will have received the presentation.",
      "verb": "received"
    },
    {
      "sentence": "By next week, sarah will have given a present.",
      "verb": "given"
    },
    {
      "sentence": "John will have reviewed vocabulary by then.",
      "verb": "reviewed"
    },
    {
      "sentence": "I will have written the proposal by in two days.",
      "verb": "written"
    },
    {
      "sentence": "I will have sent the proposal by tomorrow.",
      "verb": "sent"
    },
    {
      "sentence": "By in two days, the team will have enjoyed a sandwich.",
      "verb": "enjoyed"
    },
    {
      "sentence": "By next week, her sister will have planned the meeting.",
      "verb": "planned"
    },
    {
      "sentence": "By soon, we will have played music.",
      "verb": "played"
    },
    {
      "sentence": "By next month, he will have sent the project.",
      "verb": "sent"
    },
    {
      "sentence": "By this evening, the manager will have sent the report.",
      "verb": "sent"
    },
    {
      "sentence": "He will have played a video by later.",
      "verb": "played"
    },
    {
      "sentence": "The children will have found the phone by then.",
      "verb": "found"
    },
    {
      "sentence": "My parents will have visited my parents by later.",
      "verb": "visited"
    },
    {
      "sentence": "He will have made breakfast by then.",
      "verb": "made"
    },
    {
      "sentence": "By this weekend, the manager will have bought flowers.",
      "verb": "bought"
    },
    {
      "sentence": "She will have met the manager by next week.",
      "verb": "met"
    },
    {
      "sentence": "She will have planned the situation by then.",
      "verb": "planned"
    },
    {
      "sentence": "The teacher will have planned the decision by tonight.",
      "verb": "planned"
    },
    {
      "sentence": "By later, the students will have enjoyed the game.",
      "verb": "enjoyed"
    },
    {
      "sentence": "Her sister will have arrived to the office by then.",
      "verb": "arrived"
    },
    {
      "sentence": "The students will have sold the ticket by next year.",
      "verb": "sold"
    },
    {
      "sentence": "By this evening, they will have gone to the park.",
      "verb": "gone"
    },
    {
      "sentence": "The cat will have drunk breakfast by then.",
      "verb": "drunk"
    },
    {
      "sentence": "The cat will have talked my family by this evening.",
      "verb": "talked"
    },
    {
      "sentence": "My brother will have ordered a sandwich by then.",
      "verb": "ordered"
    },
    {
      "sentence": "The manager will have played a podcast by then.",
      "verb": "played"
    },
    {
      "sentence": "By in two days, we will have fixed the computer.",
      "verb": "fixed"
    },
    {
      "sentence": "I will have reviewed vocabulary by next month.",
      "verb": "reviewed"
    },
    {
      "sentence": "He will have played tennis by tonight.",
      "verb": "played"
    },
    {
      "sentence": "John will have listened to the news by later.",
      "verb": "listened"
    },
    {
      "sentence": "By tonight, the cat will have flown to the market.",
      "verb": "flown"
    },
    {
      "sentence": "The team will have painted the house by next month.",
      "verb": "painted"
    },
    {
      "sentence": "The students will have designed a website by this weekend.",
      "verb": "designed"
    },
    {
      "sentence": "The teacher will have repaired the house by then.",
      "verb": "repaired"
    },
    {
      "sentence": "The students will have received the contract by this evening.",
      "verb": "received"
    },
    {
      "sentence": "By in two days, you will have left downtown.",
      "verb": "left"
    },
    {
      "sentence": "By in two days, he will have gotten the keys.",
      "verb": "gotten"
    },
    {
      "sentence": "By next year, our neighbors will have prepared tea.",
      "verb": "prepared"
    },
    {
      "sentence": "You will have repaired the house by then.",
      "verb": "repaired"
    },
    {
      "sentence": "By in two days, the cat will have gotten a present.",
      "verb": "gotten"
    },
    {
      "sentence": "He will have called the manager by then.",
      "verb": "called"
    },
    {
      "sentence": "By soon, the manager will have finished the presentation.",
      "verb": "finished"
    },
    {
      "sentence": "Emma will have drawn the room by then.",
      "verb": "drawn"
    },
    {
      "sentence": "By next week, my brother will have written the contract.",
      "verb": "written"
    },
    {
      "sentence": "Her sister will have practiced Spanish by then.",
      "verb": "practiced"
    },
    {
      "sentence": "The team will have thought about the event by later.",
      "verb": "thought"
    },
    {
      "sentence": "My brother will have ordered tea by then.",
      "verb": "ordered"
    },
    {
      "sentence": "Tom will have ordered breakfast by then.",
      "verb": "ordered"
    },
    {
      "sentence": "The bird will have sold a laptop by then.",
      "verb": "sold"
    },
    {
      "sentence": "He will have made tea by then.",
      "verb": "made"
    },
    {
      "sentence": "Tom will have played TV by tonight.",
      "verb": "played"
    },
    {
      "sentence": "The manager will have run to the airport by then.",
      "verb": "run"
    },
    {
      "sentence": "The manager will have enjoyed a documentary by then.",
      "verb": "enjoyed"
    },
    {
      "sentence": "The bird will have sold clothes by then.",
      "verb": "sold"
    },
    {
      "sentence": "By next week, we will have met the doctor.",
      "verb": "met"
    },
    {
      "sentence": "By tonight, the children will have reviewed grammar.",
      "verb": "reviewed"
    },
    {
      "sentence": "We will have taught science by then.",
      "verb": "taught"
    },
    {
      "sentence": "By soon, the dog will have thought about the event.",
      "verb": "thought"
    },
    {
      "sentence": "By tomorrow, we will have repaired the kitchen.",
      "verb": "repaired"
    },
    {
      "sentence": "By next month, the company will have remembered the meeting.",
      "verb": "remembered"
    },
    {
      "sentence": "Sarah will have found groceries by then.",
      "verb": "found"
    },
    {
      "sentence": "Her sister will have played the news by in two days.",
      "verb": "played"
    },
    {
      "sentence": "The bird will have practiced for the exam by later.",
      "verb": "practiced"
    },
    {
      "sentence": "My brother will have come to the park by next week.",
      "verb": "come"
    },
    {
      "sentence": "The company will have sent the contract by then.",
      "verb": "sent"
    },
    {
      "sentence": "The company will have listened to basketball by this evening.",
      "verb": "listened"
    }
  ]
}