{
  "tense": "Future Continuous",
  "description": "Used for actions that will be in progress at a specific time in the future",
  "examples": [
    {
      "sentence": "At this time later, the teacher will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "The manager will be selling some clothes tonight.",
      "verb": "selling"
    },
    {
      "sentence": "She will be drinking a smoothie this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "The children will be practicing the textbook this evening.",
      "verb": "practicing"
    },
    {
      "sentence": "I will be playing guitar later.",
      "verb": "playing"
    },
    {
      "sentence": "The children will be choosing a gift next month.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this evening, my parents will be playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will be playing basketball next year.",
      "verb": "playing"
    },
    {
      "sentence": "He will be contacting my friend next year.",
      "verb": "contacting"
    },
    {
      "sentence": "Tonight, i will be writing the email.",
      "verb": "writing"
    },
    {
      "sentence": "They will be playing video games this evening.",
      "verb": "playing"
    },
    {
      "sentence": "John will be learning science this evening.",
      "verb": "learning"
    },
    {
      "sentence": "Tonight, the dog will be running in circles.",
      "verb": "running"
    },
    {
      "sentence": "Next year, we will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next week, i will be eating breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, the dog will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister will be drinking some water next year.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, our neighbors will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, my friend will be speaking to a colleague.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, my parents will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird will be playing with the ball soon.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will be repairing the door this weekend.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager will be finding a new car tomorrow.",
      "verb": "finding"
    },
    {
      "sentence": "At this time later, the students will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tomorrow, the dog will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah will be meeting my friend tonight.",
      "verb": "meeting"
    },
    {
      "sentence": "Next week, you will be listening to the radio.",
      "verb": "listening"
    },
    {
      "sentence": "John will be meeting my family tonight.",
      "verb": "meeting"
    },
    {
      "sentence": "In two days, the dog will be eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be repairing the sink next month.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tomorrow, her sister will be playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "He will be watching a show next month.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be seeing an old friend next month.",
      "verb": "seeing"
    },
    {
      "sentence": "My brother will be seeing the manager later.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time tonight, the company will be releasing the results.",
      "verb": "releasing"
    },
    {
      "sentence": "Next week, the dog will be sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next year, the dog will be playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, he will be running to school.",
      "verb": "running"
    },
    {
      "sentence": "This evening, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "In two days, the dog will be catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "This evening, the team will be announcing a new product.",
      "verb": "announcing"
    },
    {
      "sentence": "Tom will be making dinner soon.",
      "verb": "making"
    },
    {
      "sentence": "This weekend, the dog will be chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "Next week, the bird will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog will be running through the grass tonight.",
      "verb": "running"
    },
    {
      "sentence": "Next week, he will be cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time tomorrow, the cat will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next year, the bird will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog will be eating the leftover food in two days.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be chasing the toy this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, my parents will be eating some fruit.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, i will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "In two days, my friend will be remembering the future.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time tomorrow, he will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "Soon, the dog will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next month, the cat will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "The cat will be eating its dinner in two days.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, emma will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will be running in the garden later.",
      "verb": "running"
    },
    {
      "sentence": "At this time next month, sarah will be having lunch.",
      "verb": "having"
    },
    {
      "sentence": "In two days, the bird will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "At this time tomorrow, my parents will be texting the doctor.",
      "verb": "texting"
    },
    {
      "sentence": "Next month, john will be cleaning the kitchen.",
      "verb": "cleaning"
    },
    {
      "sentence": "The cat will be running in the garden in two days.",
      "verb": "running"
    },
    {
      "sentence": "At this time soon, the cat will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the cat will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "At this time soon, her sister will be preparing a cake.",
      "verb": "preparing"
    },
    {
      "sentence": "This evening, the dog will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "At this time tomorrow, the dog will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, the bird will be running across the field.",
      "verb": "running"
    },
    {
      "sentence": "At this time next year, the company will be releasing the championship.",
      "verb": "releasing"
    },
    {
      "sentence": "He will be contacting my family this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "In two days, the team will be completing the deal.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next month, the team will be announcing a new product.",
      "verb": "announcing"
    },
    {
      "sentence": "At this time in two days, john will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tomorrow, my friend will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "John will be watching the news tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "Later, the children will be listening to the radio.",
      "verb": "listening"
    },
    {
      "sentence": "At this time later, you will be having a salad.",
      "verb": "having"
    },
    {
      "sentence": "Later, sarah will be eating some fruit.",
      "verb": "eating"
    },
    {
      "sentence": "My brother will be repairing the bike next month.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "At this time tomorrow, the dog will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "John will be painting a portrait next month.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, my brother will be contacting the doctor.",
      "verb": "contacting"
    },
    {
      "sentence": "In two days, the bird will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children will be sending the presentation in two days.",
      "verb": "sending"
    },
    {
      "sentence": "At this time tomorrow, our neighbors will be submitting the assignment.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time next week, my parents will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the dog will be running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "The dog will be catching a treat later.",
      "verb": "catching"
    },
    {
      "sentence": "At this time tomorrow, he will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "We will be texting the teacher soon.",
      "verb": "texting"
    },
    {
      "sentence": "At this time next week, her sister will be repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "Soon, sarah will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be calling the client tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher will be driving to the library this weekend.",
      "verb": "driving"
    },
    {
      "sentence": "This weekend, you will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "This evening, emma will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "The company will be completing the results next year.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next week, i will be learning the notes.",
      "verb": "learning"
    },
    {
      "sentence": "Later, the teacher will be sketching a poster.",
      "verb": "sketching"
    },
    {
      "sentence": "My friend will be cleaning the car next week.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next month, you will be arriving to the beach.",
      "verb": "arriving"
    },
    {
      "sentence": "Tomorrow, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will be sketching a poster this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma will be studying mathematics later.",
      "verb": "studying"
    },
    {
      "sentence": "Tomorrow, the cat will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "They will be choosing a present later.",
      "verb": "choosing"
    },
    {
      "sentence": "John will be watching a series this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister will be preparing dinner tomorrow.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time in two days, he will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "At this time tomorrow, my friend will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time next week, they will be driving to the beach.",
      "verb": "driving"
    },
    {
      "sentence": "The cat will be chasing the other pets this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "This evening, the teacher will be meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors will be eating breakfast soon.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, he will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, my parents will be receiving the assignment.",
      "verb": "receiving"
    },
    {
      "sentence": "We will be listening to the news later.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next week, she will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "This weekend, our neighbors will be speaking to my friend.",
      "verb": "speaking"
    },
    {
      "sentence": "This evening, the teacher will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "In two days, sarah will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat will be chasing its tail next year.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next month, tom will be repairing the bike.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time later, i will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "John will be playing chess next month.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will be chasing the mouse this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next week, the cat will be running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "At this time later, the students will be selling groceries.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, sarah will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Later, john will be building a project.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, her sister will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "At this time in two days, they will be talking to the boss.",
      "verb": "talking"
    },
    {
      "sentence": "He will be selling the phone this evening.",
      "verb": "selling"
    },
    {
      "sentence": "Tom will be building a prototype in two days.",
      "verb": "building"
    },
    {
      "sentence": "Tomorrow, the company will be completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "In two days, the bird will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, the bird will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next week, her sister will be calling the doctor.",
      "verb": "calling"
    },
    {
      "sentence": "Sarah will be preparing a cake next month.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time this weekend, john will be eating pasta.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the dog will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the manager will be eating some fruit.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, my brother will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time in two days, the teacher will be creating a project.",
      "verb": "creating"
    },
    {
      "sentence": "Later, they will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, john will be sketching an illustration.",
      "verb": "sketching"
    },
    {
      "sentence": "In two days, tom will be seeing the team.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time in two days, emma will be speaking with the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "In two days, he will be cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "My friend will be sketching a design next year.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma will be remembering the situation this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "Later, i will be speaking with my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "Next week, she will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next week, tom will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tonight, tom will be finding the keys.",
      "verb": "finding"
    },
    {
      "sentence": "Sarah will be watching the match later.",
      "verb": "watching"
    },
    {
      "sentence": "Next week, my friend will be playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, our neighbors will be leaving to the market.",
      "verb": "leaving"
    },
    {
      "sentence": "The dog will be sleeping by the window later.",
      "verb": "sleeping"
    },
    {
      "sentence": "I will be meeting an old friend next month.",
      "verb": "meeting"
    },
    {
      "sentence": "She will be choosing the keys next month.",
      "verb": "choosing"
    },
    {
      "sentence": "John will be walking to the beach tonight.",
      "verb": "walking"
    },
    {
      "sentence": "The students will be making a meal next year.",
      "verb": "making"
    },
    {
      "sentence": "This weekend, the dog will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "He will be watching a documentary later.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tonight, we will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog will be chasing the toy this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "We will be drawing a landscape later.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next month, my friend will be receiving the proposal.",
      "verb": "receiving"
    },
    {
      "sentence": "The students will be reading mathematics tonight.",
      "verb": "reading"
    },
    {
      "sentence": "Next year, the cat will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the cat will be playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, our neighbors will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will be winning the project in two days.",
      "verb": "winning"
    },
    {
      "sentence": "At this time next month, sarah will be running to school.",
      "verb": "running"
    },
    {
      "sentence": "My friend will be speaking with the client next year.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this evening, the cat will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "At this time next month, she will be receiving the email.",
      "verb": "receiving"
    },
    {
      "sentence": "The manager will be remembering the event this evening.",
      "verb": "remembering"
    },
    {
      "sentence": "My parents will be repairing the sink this evening.",
      "verb": "repairing"
    },
    {
      "sentence": "Next week, the cat will be sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird will be eating the leftover food later.",
      "verb": "eating"
    },
    {
      "sentence": "Tonight, he will be creating a model.",
      "verb": "creating"
    },
    {
      "sentence": "At this time next month, the cat will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "The students will be watching the match later.",
      "verb": "watching"
    },
    {
      "sentence": "You will be creating a project this weekend.",
      "verb": "creating"
    },
    {
      "sentence": "Soon, the bird will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the company will be announcing a new product.",
      "verb": "announcing"
    },
    {
      "sentence": "The bird will be playing in the yard soon.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, you will be contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "This evening, the team will be completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "My parents will be drinking juice this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next year, the cat will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "Next year, the children will be seeing the team.",
      "verb": "seeing"
    },
    {
      "sentence": "The children will be speaking with the client next year.",
      "verb": "speaking"
    },
    {
      "sentence": "John will be driving to the market tonight.",
      "verb": "driving"
    },
    {
      "sentence": "This weekend, we will be having some fruit.",
      "verb": "having"
    },
    {
      "sentence": "Later, the bird will be playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "Later, she will be painting a portrait.",
      "verb": "painting"
    },
    {
      "sentence": "Emma will be cleaning the bathroom next year.",
      "verb": "cleaning"
    },
    {
      "sentence": "Later, they will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "Next week, sarah will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat will be playing in the yard next week.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the children will be planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "Tonight, the teacher will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, the dog will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "At this time this evening, the manager will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time in two days, my parents will be teaching vocabulary.",
      "verb": "teaching"
    },
    {
      "sentence": "The cat will be eating some food next year.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be playing in the garden in two days.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, the bird will be playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "This evening, tom will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "The dog will be playing in the park this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, the manager will be deciding on the future.",
      "verb": "deciding"
    },
    {
      "sentence": "This weekend, we will be painting a diagram.",
      "verb": "painting"
    },
    {
      "sentence": "Next year, john will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "At this time tonight, the manager will be meeting the client.",
      "verb": "meeting"
    },
    {
      "sentence": "This weekend, the dog will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time tonight, sarah will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, you will be forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time tomorrow, the cat will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "Tom will be painting a landscape next year.",
      "verb": "painting"
    },
    {
      "sentence": "Next year, the bird will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "You will be drawing a picture later.",
      "verb": "drawing"
    },
    {
      "sentence": "Later, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "In two days, the teacher will be forgetting the plan.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students will be calling the teacher tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "The bird will be chasing the ball next year.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time this evening, they will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "John will be considering the options tonight.",
      "verb": "considering"
    },
    {
      "sentence": "I will be playing soccer this evening.",
      "verb": "playing"
    },
    {
      "sentence": "At this time soon, my friend will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "Her sister will be organizing the clothes tomorrow.",
      "verb": "organizing"
    },
    {
      "sentence": "Our neighbors will be calling the doctor in two days.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next year, the teacher will be talking to the boss.",
      "verb": "talking"
    },
    {
      "sentence": "She will be speaking to my parents tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next month, the dog will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next year, my parents will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "This evening, my brother will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "Later, the teacher will be submitting the assignment.",
      "verb": "submitting"
    },
    {
      "sentence": "My brother will be cooking cookies soon.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time tonight, the children will be reviewing English.",
      "verb": "reviewing"
    },
    {
      "sentence": "I will be forgetting the decision this evening.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next week, my parents will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "Tomorrow, my friend will be coming to the gym.",
      "verb": "coming"
    },
    {
      "sentence": "At this time next year, i will be organizing the dishes.",
      "verb": "organizing"
    },
    {
      "sentence": "Next month, she will be drawing an illustration.",
      "verb": "drawing"
    },
    {
      "sentence": "The teacher will be organizing the car later.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time in two days, the dog will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, the dog will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "John will be watching football later.",
      "verb": "watching"
    },
    {
      "sentence": "My parents will be speaking to the teacher next year.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager will be writing the assignment this weekend.",
      "verb": "writing"
    },
    {
      "sentence": "Soon, my parents will be traveling to the airport.",
      "verb": "traveling"
    },
    {
      "sentence": "This weekend, he will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors will be getting a book in two days.",
      "verb": "getting"
    },
    {
      "sentence": "Next week, her sister will be understanding for the exam.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, tom will be preparing a salad.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time this weekend, he will be playing guitar.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, we will be fixing the fence.",
      "verb": "fixing"
    },
    {
      "sentence": "They will be teaching mathematics soon.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time next month, the dog will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors will be repairing the roof this evening.",
      "verb": "repairing"
    },
    {
      "sentence": "This weekend, our neighbors will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "This weekend, the students will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "This weekend, you will be having a sandwich.",
      "verb": "having"
    },
    {
      "sentence": "At this time soon, you will be repairing the sink.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will be playing with the ball next month.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next year, the cat will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "At this time tonight, the children will be talking to the manager.",
      "verb": "talking"
    },
    {
      "sentence": "Next month, i will be remembering the decision.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time tonight, her sister will be repairing the sink.",
      "verb": "repairing"
    },
    {
      "sentence": "The team will be announcing a new product in two days.",
      "verb": "announcing"
    },
    {
      "sentence": "At this time this weekend, he will be playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, the dog will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "The children will be playing football later.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next year, sarah will be talking to the professor.",
      "verb": "talking"
    },
    {
      "sentence": "At this time later, tom will be contacting the office.",
      "verb": "contacting"
    },
    {
      "sentence": "Soon, sarah will be practicing French.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next year, the dog will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next week, the team will be completing a new product.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next week, sarah will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "At this time later, the students will be baking rice.",
      "verb": "baking"
    },
    {
      "sentence": "Later, our neighbors will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be watching football next year.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, the team will be releasing the contract.",
      "verb": "releasing"
    },
    {
      "sentence": "At this time later, the dog will be sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird will be sleeping on the bed soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time this weekend, the manager will be creating a project.",
      "verb": "creating"
    },
    {
      "sentence": "At this time this weekend, they will be having some fruit.",
      "verb": "having"
    },
    {
      "sentence": "This weekend, the cat will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time in two days, the team will be launching the deal.",
      "verb": "launching"
    },
    {
      "sentence": "The bird will be eating its food this evening.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, the dog will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, tom will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time next month, my parents will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "She will be listening to the lecture soon.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next month, the bird will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "John will be preparing dinner next month.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time tonight, my friend will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "At this time soon, the bird will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "The children will be watching the news next week.",
      "verb": "watching"
    },
    {
      "sentence": "Later, he will be repairing the roof.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird will be chasing the mouse this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time this weekend, emma will be having a meal.",
      "verb": "having"
    },
    {
      "sentence": "Her sister will be reviewing Spanish next week.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat will be playing in the yard tonight.",
      "verb": "playing"
    },
    {
      "sentence": "At this time later, our neighbors will be having lunch.",
      "verb": "having"
    },
    {
      "sentence": "Tonight, emma will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "In two days, the students will be traveling to the hospital.",
      "verb": "traveling"
    },
    {
      "sentence": "This evening, the manager will be texting the teacher.",
      "verb": "texting"
    },
    {
      "sentence": "At this time next month, we will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "Next year, i will be sketching the wall.",
      "verb": "sketching"
    },
    {
      "sentence": "Tonight, the dog will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "She will be eating some fruit tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be playing in the yard this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "The team will be releasing the contract next month.",
      "verb": "releasing"
    },
    {
      "sentence": "They will be drawing a diagram next week.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time soon, john will be starting the document.",
      "verb": "starting"
    },
    {
      "sentence": "At this time tonight, she will be fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, we will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, the cat will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time soon, the bird will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be running in circles next year.",
      "verb": "running"
    },
    {
      "sentence": "In two days, tom will be going to the hospital.",
      "verb": "going"
    },
    {
      "sentence": "The dog will be catching a butterfly later.",
      "verb": "catching"
    },
    {
      "sentence": "Next week, tom will be giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "At this time tomorrow, the cat will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, we will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, she will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "Tonight, she will be having lunch.",
      "verb": "having"
    },
    {
      "sentence": "My brother will be emailing the client next week.",
      "verb": "emailing"
    },
    {
      "sentence": "This evening, the team will be releasing the results.",
      "verb": "releasing"
    },
    {
      "sentence": "Tomorrow, the teacher will be texting the doctor.",
      "verb": "texting"
    },
    {
      "sentence": "At this time this weekend, the cat will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "John will be driving to the bank this weekend.",
      "verb": "driving"
    },
    {
      "sentence": "The team will be launching the deal in two days.",
      "verb": "launching"
    },
    {
      "sentence": "She will be sketching a landscape this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "He will be learning for the exam next year.",
      "verb": "learning"
    },
    {
      "sentence": "At this time tomorrow, my parents will be completing the email.",
      "verb": "completing"
    },
    {
      "sentence": "Sarah will be learning for the exam this evening.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, john will be speaking to the doctor.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors will be calling my family tonight.",
      "verb": "calling"
    },
    {
      "sentence": "The bird will be catching a treat soon.",
      "verb": "catching"
    },
    {
      "sentence": "At this time this evening, the company will be completing the project.",
      "verb": "completing"
    },
    {
      "sentence": "Tonight, i will be studying the lesson.",
      "verb": "studying"
    },
    {
      "sentence": "At this time next month, the bird will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "I will be considering the event this weekend.",
      "verb": "considering"
    },
    {
      "sentence": "Next year, you will be cleaning the dishes.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister will be visiting my parents next month.",
      "verb": "visiting"
    },
    {
      "sentence": "Sarah will be having soup next week.",
      "verb": "having"
    },
    {
      "sentence": "The teacher will be speaking to a colleague next month.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, you will be seeing the teacher.",
      "verb": "seeing"
    },
    {
      "sentence": "He will be practicing the material next month.",
      "verb": "practicing"
    },
    {
      "sentence": "Tonight, the manager will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager will be thinking about the options next year.",
      "verb": "thinking"
    },
    {
      "sentence": "Tonight, my parents will be calling the team.",
      "verb": "calling"
    },
    {
      "sentence": "At this time soon, my parents will be giving the ticket.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next week, she will be finishing the assignment.",
      "verb": "finishing"
    },
    {
      "sentence": "Tonight, the bird will be playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "My parents will be repairing the bike this evening.",
      "verb": "repairing"
    },
    {
      "sentence": "Tonight, emma will be speaking with my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "Tomorrow, she will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time soon, you will be talking to my family.",
      "verb": "talking"
    },
    {
      "sentence": "At this time this evening, the bird will be running across the field.",
      "verb": "running"
    },
    {
      "sentence": "At this time next year, my friend will be flying home.",
      "verb": "flying"
    },
    {
      "sentence": "My parents will be thinking about the meeting this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "The team will be developing the contract this evening.",
      "verb": "developing"
    },
    {
      "sentence": "At this time this evening, they will be listening to the radio.",
      "verb": "listening"
    },
    {
      "sentence": "You will be sending the presentation next year.",
      "verb": "sending"
    },
    {
      "sentence": "Sarah will be going to work this weekend.",
      "verb": "going"
    },
    {
      "sentence": "The manager will be washing the garage tomorrow.",
      "verb": "washing"
    },
    {
      "sentence": "John will be going to the hospital next month.",
      "verb": "going"
    },
    {
      "sentence": "Next month, the manager will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "At this time tomorrow, the bird will be playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the manager will be completing the document.",
      "verb": "completing"
    },
    {
      "sentence": "At this time next year, my friend will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, her sister will be thinking about the event.",
      "verb": "thinking"
    },
    {
      "sentence": "This evening, the students will be practicing grammar.",
      "verb": "practicing"
    },
    {
      "sentence": "The children will be giving a new house next month.",
      "verb": "giving"
    },
    {
      "sentence": "At this time next week, you will be sending the assignment.",
      "verb": "sending"
    },
    {
      "sentence": "This evening, the manager will be painting an illustration.",
      "verb": "painting"
    },
    {
      "sentence": "Next month, the cat will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, the company will be launching the project.",
      "verb": "launching"
    },
    {
      "sentence": "Sarah will be building a prototype this evening.",
      "verb": "building"
    },
    {
      "sentence": "The students will be tidying the room next year.",
      "verb": "tidying"
    },
    {
      "sentence": "At this time next year, my friend will be contacting the team.",
      "verb": "contacting"
    },
    {
      "sentence": "My brother will be getting a new house next year.",
      "verb": "getting"
    },
    {
      "sentence": "At this time this weekend, he will be finding the phone.",
      "verb": "finding"
    },
    {
      "sentence": "This weekend, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next year, my friend will be contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time later, tom will be sending the email.",
      "verb": "sending"
    },
    {
      "sentence": "At this time later, you will be meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time soon, the bird will be eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the cat will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the cat will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tomorrow, the bird will be running across the field.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the bird will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "Soon, my brother will be forgetting the situation.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time next month, my friend will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this weekend, the teacher will be repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tonight, my brother will be visiting the manager.",
      "verb": "visiting"
    },
    {
      "sentence": "My parents will be repairing the door later.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog will be sleeping under the table tonight.",
      "verb": "sleeping"
    },
    {
      "sentence": "He will be texting customer service tomorrow.",
      "verb": "texting"
    },
    {
      "sentence": "At this time this weekend, emma will be finding flowers.",
      "verb": "finding"
    },
    {
      "sentence": "Next month, the cat will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, john will be learning grammar.",
      "verb": "learning"
    },
    {
      "sentence": "The dog will be playing in the park tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, the children will be getting a new house.",
      "verb": "getting"
    },
    {
      "sentence": "At this time next year, i will be learning French.",
      "verb": "learning"
    },
    {
      "sentence": "Tonight, my brother will be creating a project.",
      "verb": "creating"
    },
    {
      "sentence": "Next month, sarah will be choosing the ticket.",
      "verb": "choosing"
    },
    {
      "sentence": "This evening, she will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "This evening, tom will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "At this time in two days, sarah will be learning for the exam.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next week, the manager will be making pasta.",
      "verb": "making"
    },
    {
      "sentence": "At this time this weekend, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, he will be creating a prototype.",
      "verb": "creating"
    },
    {
      "sentence": "Tonight, he will be playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "Soon, my friend will be building a model.",
      "verb": "building"
    },
    {
      "sentence": "We will be listening to a song next month.",
      "verb": "listening"
    },
    {
      "sentence": "Next week, the team will be announcing a new product.",
      "verb": "announcing"
    },
    {
      "sentence": "Next week, she will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be contacting the boss this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "Soon, the bird will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "Later, emma will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will be cooking cookies this weekend.",
      "verb": "cooking"
    },
    {
      "sentence": "In two days, our neighbors will be building a website.",
      "verb": "building"
    },
    {
      "sentence": "Tom will be fixing the machine next month.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister will be meeting an old friend tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next month, our neighbors will be running to the beach.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, sarah will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time this weekend, the cat will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time this weekend, they will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "Later, tom will be learning the textbook.",
      "verb": "learning"
    },
    {
      "sentence": "At this time soon, you will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "The manager will be practicing the material later.",
      "verb": "practicing"
    },
    {
      "sentence": "The dog will be running in the garden this weekend.",
      "verb": "running"
    },
    {
      "sentence": "At this time in two days, he will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be chasing birds in the garden next week.",
      "verb": "chasing"
    },
    {
      "sentence": "Next month, sarah will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "Later, her sister will be sketching a portrait.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time tomorrow, we will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "At this time later, our neighbors will be playing guitar.",
      "verb": "playing"
    },
    {
      "sentence": "Later, her sister will be understanding French.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this weekend, he will be baking breakfast.",
      "verb": "baking"
    },
    {
      "sentence": "This weekend, she will be considering the event.",
      "verb": "considering"
    },
    {
      "sentence": "Tomorrow, the students will be playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "I will be texting my parents this evening.",
      "verb": "texting"
    },
    {
      "sentence": "We will be repairing the roof later.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher will be texting my family in two days.",
      "verb": "texting"
    },
    {
      "sentence": "At this time next week, the students will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "They will be calling the teacher next month.",
      "verb": "calling"
    },
    {
      "sentence": "Tonight, the teacher will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "Later, our neighbors will be starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this weekend, the teacher will be flying to the gym.",
      "verb": "flying"
    },
    {
      "sentence": "At this time tomorrow, the students will be washing the clothes.",
      "verb": "washing"
    },
    {
      "sentence": "At this time this evening, john will be calling customer service.",
      "verb": "calling"
    },
    {
      "sentence": "At this time soon, my parents will be selling the phone.",
      "verb": "selling"
    },
    {
      "sentence": "John will be listening to music tomorrow.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, he will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, he will be tidying the car.",
      "verb": "tidying"
    },
    {
      "sentence": "The teacher will be speaking with my family this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time soon, the dog will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "The manager will be repairing the door next month.",
      "verb": "repairing"
    },
    {
      "sentence": "Next week, the manager will be washing the bathroom.",
      "verb": "washing"
    },
    {
      "sentence": "At this time this evening, the dog will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "Soon, the dog will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "The children will be meeting the team this evening.",
      "verb": "meeting"
    },
    {
      "sentence": "You will be building a house next year.",
      "verb": "building"
    },
    {
      "sentence": "At this time next year, he will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "The cat will be running across the field next week.",
      "verb": "running"
    },
    {
      "sentence": "The cat will be running in the garden next year.",
      "verb": "running"
    },
    {
      "sentence": "The bird will be running around the house tonight.",
      "verb": "running"
    },
    {
      "sentence": "Soon, john will be preparing breakfast.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog will be catching a bird next year.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next month, our neighbors will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, the cat will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, her sister will be calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "Tonight, tom will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "He will be listening to jazz next week.",
      "verb": "listening"
    },
    {
      "sentence": "The children will be watching a documentary this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "You will be texting the boss tomorrow.",
      "verb": "texting"
    },
    {
      "sentence": "Next year, i will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will be catching a bird in two days.",
      "verb": "catching"
    },
    {
      "sentence": "Next year, you will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will be practicing the chapter next week.",
      "verb": "practicing"
    },
    {
      "sentence": "Tomorrow, my friend will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tomorrow, the team will be announcing the results.",
      "verb": "announcing"
    },
    {
      "sentence": "At this time this evening, emma will be talking to my friend.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, the cat will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time tomorrow, sarah will be fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat will be eating quickly in two days.",
      "verb": "eating"
    },
    {
      "sentence": "My friend will be sketching a design tomorrow.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister will be washing the house soon.",
      "verb": "washing"
    },
    {
      "sentence": "He will be sketching a landscape this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "This weekend, my parents will be studying the chapter.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister will be driving downtown next month.",
      "verb": "driving"
    },
    {
      "sentence": "I will be cleaning the room tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time this weekend, the students will be baking cookies.",
      "verb": "baking"
    },
    {
      "sentence": "Soon, my friend will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, the manager will be organizing the garage.",
      "verb": "organizing"
    },
    {
      "sentence": "John will be starting the document next month.",
      "verb": "starting"
    },
    {
      "sentence": "At this time next month, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next week, the manager will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "Tonight, her sister will be studying the material.",
      "verb": "studying"
    },
    {
      "sentence": "At this time later, my brother will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, john will be seeing my parents.",
      "verb": "seeing"
    },
    {
      "sentence": "He will be fixing the machine this evening.",
      "verb": "fixing"
    },
    {
      "sentence": "Next week, i will be having a salad.",
      "verb": "having"
    },
    {
      "sentence": "Next month, the manager will be fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat will be sleeping by the window soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tonight, my parents will be cleaning the office.",
      "verb": "cleaning"
    },
    {
      "sentence": "This evening, my friend will be watching a show.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, the cat will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, our neighbors will be listening to the radio.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will be catching the ball in two days.",
      "verb": "catching"
    },
    {
      "sentence": "Tonight, she will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "At this time tomorrow, i will be understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "The bird will be catching a bird tonight.",
      "verb": "catching"
    },
    {
      "sentence": "The children will be drawing a picture next week.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next week, emma will be coming to the office.",
      "verb": "coming"
    },
    {
      "sentence": "The children will be having some fruit this evening.",
      "verb": "having"
    },
    {
      "sentence": "John will be submitting the contract this weekend.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, emma will be sketching the wall.",
      "verb": "sketching"
    },
    {
      "sentence": "Tonight, john will be designing a model.",
      "verb": "designing"
    },
    {
      "sentence": "The cat will be running through the grass tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "The cat will be chasing the toy next month.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next year, my parents will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "She will be understanding French later.",
      "verb": "understanding"
    },
    {
      "sentence": "This weekend, the teacher will be remembering the birthday party.",
      "verb": "remembering"
    },
    {
      "sentence": "This evening, i will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "Next week, the manager will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "Tomorrow, emma will be teaching mathematics.",
      "verb": "teaching"
    },
    {
      "sentence": "The teacher will be speaking to the doctor soon.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tomorrow, the bird will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "The students will be sketching a poster this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "The company will be developing the project in two days.",
      "verb": "developing"
    },
    {
      "sentence": "The manager will be talking to the client next week.",
      "verb": "talking"
    },
    {
      "sentence": "Next week, the dog will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children will be reviewing the notes tonight.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tonight, her sister will be organizing the kitchen.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time this weekend, the bird will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "Her sister will be sketching a diagram tonight.",
      "verb": "sketching"
    },
    {
      "sentence": "Soon, the bird will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the students will be buying some clothes.",
      "verb": "buying"
    },
    {
      "sentence": "The children will be choosing a laptop later.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time soon, he will be organizing the kitchen.",
      "verb": "organizing"
    },
    {
      "sentence": "The cat will be chasing the ball next year.",
      "verb": "chasing"
    },
    {
      "sentence": "Soon, he will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, she will be making a cake.",
      "verb": "making"
    },
    {
      "sentence": "They will be playing video games next year.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, we will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "The cat will be eating a treat next year.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, tom will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "At this time next month, the manager will be choosing some clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "This weekend, tom will be creating a model.",
      "verb": "creating"
    },
    {
      "sentence": "At this time this weekend, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next week, the manager will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "The company will be completing the championship next month.",
      "verb": "completing"
    },
    {
      "sentence": "The children will be drinking coffee this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tonight, sarah will be speaking with the client.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, john will be visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "They will be listening to a podcast later.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tomorrow, i will be repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "Later, the children will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time later, i will be deciding on the trip.",
      "verb": "deciding"
    },
    {
      "sentence": "Next week, he will be having pasta.",
      "verb": "having"
    },
    {
      "sentence": "At this time this evening, the bird will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "Tomorrow, the students will be receiving the document.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next year, the dog will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next week, her sister will be arriving to the library.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time soon, we will be baking pasta.",
      "verb": "baking"
    },
    {
      "sentence": "Tomorrow, emma will be receiving the report.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time tomorrow, the cat will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "The company will be releasing the update later.",
      "verb": "releasing"
    },
    {
      "sentence": "At this time this evening, the children will be emailing my parents.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time soon, the students will be coming to the hospital.",
      "verb": "coming"
    },
    {
      "sentence": "Next week, the company will be releasing the deal.",
      "verb": "releasing"
    },
    {
      "sentence": "At this time this evening, her sister will be seeing an old friend.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog will be running around the house next month.",
      "verb": "running"
    },
    {
      "sentence": "In two days, tom will be meeting the client.",
      "verb": "meeting"
    },
    {
      "sentence": "This weekend, the bird will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah will be talking to the manager later.",
      "verb": "talking"
    },
    {
      "sentence": "In two days, they will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "The children will be fixing the door tomorrow.",
      "verb": "fixing"
    },
    {
      "sentence": "Tonight, they will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat will be playing with the toy next month.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, john will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, our neighbors will be drawing a design.",
      "verb": "drawing"
    },
    {
      "sentence": "Tomorrow, john will be going to the gym.",
      "verb": "going"
    },
    {
      "sentence": "At this time this evening, she will be finding the keys.",
      "verb": "finding"
    },
    {
      "sentence": "Tomorrow, tom will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "They will be drinking a smoothie this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma will be listening to the news in two days.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be playing guitar later.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, emma will be finishing the proposal.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time later, you will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, i will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "The dog will be playing with the toy next month.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the children will be calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "The cat will be eating its dinner next month.",
      "verb": "eating"
    },
    {
      "sentence": "In two days, my friend will be organizing the garage.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time tonight, they will be repairing the sink.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time soon, sarah will be thinking about the plan.",
      "verb": "thinking"
    },
    {
      "sentence": "This evening, the manager will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time this evening, my parents will be buying the keys.",
      "verb": "buying"
    },
    {
      "sentence": "At this time tomorrow, the manager will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah will be eating pizza this evening.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be finishing the letter soon.",
      "verb": "finishing"
    },
    {
      "sentence": "Soon, emma will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "Next week, john will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be repairing the car next week.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, the children will be baking dinner.",
      "verb": "baking"
    },
    {
      "sentence": "At this time soon, my parents will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time soon, the dog will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, the children will be eating pasta.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next year, the bird will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, our neighbors will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next year, the cat will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, john will be choosing a new house.",
      "verb": "choosing"
    },
    {
      "sentence": "Tomorrow, the dog will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "At this time soon, her sister will be fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "This evening, she will be receiving the project.",
      "verb": "receiving"
    },
    {
      "sentence": "Soon, we will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "At this time this evening, the children will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, i will be emailing the client.",
      "verb": "emailing"
    },
    {
      "sentence": "The dog will be catching the toy next month.",
      "verb": "catching"
    },
    {
      "sentence": "Tomorrow, the bird will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "At this time this evening, the team will be releasing the championship.",
      "verb": "releasing"
    },
    {
      "sentence": "In two days, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "Tom will be talking to my friend next month.",
      "verb": "talking"
    },
    {
      "sentence": "At this time next year, you will be fixing the bike.",
      "verb": "fixing"
    },
    {
      "sentence": "In two days, i will be contacting my friend.",
      "verb": "contacting"
    },
    {
      "sentence": "Tonight, the teacher will be eating some fruit.",
      "verb": "eating"
    },
    {
      "sentence": "This evening, tom will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, the dog will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, my parents will be meeting an old friend.",
      "verb": "meeting"
    },
    {
      "sentence": "In two days, the bird will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "In two days, our neighbors will be repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "This evening, the teacher will be sketching a diagram.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time next year, she will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "She will be watching the match this evening.",
      "verb": "watching"
    },
    {
      "sentence": "Later, we will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, the cat will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "You will be drinking tea tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tomorrow, my parents will be emailing my friend.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time in two days, my friend will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Tonight, the bird will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "My brother will be receiving the contract this weekend.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah will be painting a diagram next week.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next year, the teacher will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, the children will be cooking dinner.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time later, the children will be having lunch.",
      "verb": "having"
    },
    {
      "sentence": "Next month, my friend will be tidying the kitchen.",
      "verb": "tidying"
    },
    {
      "sentence": "The manager will be forgetting the situation next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend will be making a salad next month.",
      "verb": "making"
    },
    {
      "sentence": "The bird will be sleeping by the window next month.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next week, sarah will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "Later, you will be cooking a cake.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time tonight, she will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "We will be cleaning the clothes this weekend.",
      "verb": "cleaning"
    },
    {
      "sentence": "The bird will be running across the field tonight.",
      "verb": "running"
    },
    {
      "sentence": "Tonight, we will be sketching a design.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time this evening, the manager will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, she will be preparing the application.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher will be watching the game soon.",
      "verb": "watching"
    },
    {
      "sentence": "Later, her sister will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, our neighbors will be playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, the bird will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, he will be washing the kitchen.",
      "verb": "washing"
    },
    {
      "sentence": "Her sister will be speaking with the client in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "They will be repairing the door tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "Next week, john will be writing the proposal.",
      "verb": "writing"
    },
    {
      "sentence": "At this time tonight, emma will be buying a gift.",
      "verb": "buying"
    },
    {
      "sentence": "At this time in two days, the dog will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager will be emailing customer service soon.",
      "verb": "emailing"
    },
    {
      "sentence": "Next month, the bird will be running in circles.",
      "verb": "running"
    },
    {
      "sentence": "At this time this evening, she will be texting customer service.",
      "verb": "texting"
    },
    {
      "sentence": "Next year, sarah will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, the students will be writing the application.",
      "verb": "writing"
    },
    {
      "sentence": "Soon, he will be designing a plan.",
      "verb": "designing"
    },
    {
      "sentence": "She will be watching a movie soon.",
      "verb": "watching"
    },
    {
      "sentence": "At this time soon, my friend will be talking to the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "Emma will be buying a new house later.",
      "verb": "buying"
    },
    {
      "sentence": "At this time later, the dog will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "Next month, her sister will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "At this time tomorrow, the bird will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "The dog will be eating some food next year.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be eating its breakfast next week.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the bird will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors will be drawing a poster this evening.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time next year, sarah will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, her sister will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "I will be calling the doctor next week.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next year, the dog will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "You will be texting my parents later.",
      "verb": "texting"
    },
    {
      "sentence": "Next month, her sister will be emailing the teacher.",
      "verb": "emailing"
    },
    {
      "sentence": "He will be preparing soup this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time tonight, we will be washing the office.",
      "verb": "washing"
    },
    {
      "sentence": "At this time tomorrow, the children will be calling the client.",
      "verb": "calling"
    },
    {
      "sentence": "At this time next month, i will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, my friend will be deciding on the decision.",
      "verb": "deciding"
    },
    {
      "sentence": "Our neighbors will be speaking with the client this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, he will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Tom will be fixing the sink next month.",
      "verb": "fixing"
    },
    {
      "sentence": "Tomorrow, the cat will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "At this time tomorrow, he will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "Next year, our neighbors will be traveling to work.",
      "verb": "traveling"
    },
    {
      "sentence": "My parents will be listening to the lecture next month.",
      "verb": "listening"
    },
    {
      "sentence": "In two days, the dog will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "Next month, sarah will be preparing lunch.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, john will be driving downtown.",
      "verb": "driving"
    },
    {
      "sentence": "Sarah will be contacting customer service later.",
      "verb": "contacting"
    },
    {
      "sentence": "My friend will be seeing my family this evening.",
      "verb": "seeing"
    },
    {
      "sentence": "You will be drinking coffee next month.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time later, the children will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, the dog will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, sarah will be completing the proposal.",
      "verb": "completing"
    },
    {
      "sentence": "Later, she will be deciding on the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "At this time this weekend, tom will be organizing the kitchen.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time next month, we will be driving to the bank.",
      "verb": "driving"
    },
    {
      "sentence": "She will be watching the news this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "She will be playing guitar this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "At this time soon, the dog will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "This weekend, she will be repairing the machine.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next week, the cat will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "My brother will be drinking tea in two days.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, the cat will be sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time this evening, my friend will be considering the future.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next month, she will be emailing the teacher.",
      "verb": "emailing"
    },
    {
      "sentence": "Soon, the dog will be sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "Soon, i will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "This weekend, the cat will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, the cat will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "At this time later, the cat will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Later, he will be repairing the machine.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this evening, the company will be winning the contract.",
      "verb": "winning"
    },
    {
      "sentence": "Next month, the children will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time this weekend, my brother will be speaking with my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next year, my parents will be visiting my grandmother.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tonight, the teacher will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "At this time later, the bird will be running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "Tonight, my friend will be creating a project.",
      "verb": "creating"
    },
    {
      "sentence": "At this time this weekend, my friend will be walking to the office.",
      "verb": "walking"
    },
    {
      "sentence": "Tom will be playing guitar tonight.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will be catching the toy soon.",
      "verb": "catching"
    },
    {
      "sentence": "This evening, my brother will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "At this time this weekend, john will be having dinner.",
      "verb": "having"
    },
    {
      "sentence": "Next year, i will be having dinner.",
      "verb": "having"
    },
    {
      "sentence": "She will be planning the event in two days.",
      "verb": "planning"
    },
    {
      "sentence": "At this time this evening, emma will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "You will be fixing the sink next week.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time tonight, the manager will be sketching a landscape.",
      "verb": "sketching"
    },
    {
      "sentence": "The cat will be sleeping on the couch this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tomorrow, my friend will be calling my friend.",
      "verb": "calling"
    },
    {
      "sentence": "At this time tonight, tom will be speaking to my family.",
      "verb": "speaking"
    },
    {
      "sentence": "She will be seeing the teacher later.",
      "verb": "seeing"
    },
    {
      "sentence": "Soon, the dog will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time later, you will be contacting customer service.",
      "verb": "contacting"
    },
    {
      "sentence": "The teacher will be going to work next year.",
      "verb": "going"
    },
    {
      "sentence": "Next week, the bird will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will be sleeping in the sun this weekend.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tonight, the students will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "At this time soon, they will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Tonight, my parents will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, john will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, tom will be returning to the library.",
      "verb": "returning"
    },
    {
      "sentence": "At this time tomorrow, the students will be cleaning the room.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next month, her sister will be building a project.",
      "verb": "building"
    },
    {
      "sentence": "Next year, they will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, the bird will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Soon, my friend will be contacting my family.",
      "verb": "contacting"
    },
    {
      "sentence": "John will be deciding on the event later.",
      "verb": "deciding"
    },
    {
      "sentence": "Tomorrow, my parents will be starting the presentation.",
      "verb": "starting"
    },
    {
      "sentence": "The teacher will be tidying the kitchen tomorrow.",
      "verb": "tidying"
    },
    {
      "sentence": "At this time soon, he will be cleaning the clothes.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time in two days, the dog will be catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will be playing in the yard next year.",
      "verb": "playing"
    },
    {
      "sentence": "At this time soon, her sister will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this weekend, the bird will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister will be buying the keys in two days.",
      "verb": "buying"
    },
    {
      "sentence": "At this time later, emma will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, john will be playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "The students will be emailing the doctor next month.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time next month, the bird will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time in two days, emma will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "She will be buying a new car soon.",
      "verb": "buying"
    },
    {
      "sentence": "Next month, my parents will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tonight, he will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "Tonight, she will be seeing my family.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time tomorrow, emma will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "You will be meeting my parents next month.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors will be meeting the doctor next month.",
      "verb": "meeting"
    },
    {
      "sentence": "The students will be repairing the computer soon.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be cooking soup.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, you will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "The manager will be calling my family soon.",
      "verb": "calling"
    },
    {
      "sentence": "This weekend, i will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time in two days, the students will be making a meal.",
      "verb": "making"
    },
    {
      "sentence": "Tonight, she will be drawing a landscape.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time in two days, the bird will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "You will be planning the vacation tomorrow.",
      "verb": "planning"
    },
    {
      "sentence": "The teacher will be understanding science soon.",
      "verb": "understanding"
    },
    {
      "sentence": "The bird will be running across the field next month.",
      "verb": "running"
    },
    {
      "sentence": "At this time later, we will be reading the lesson.",
      "verb": "reading"
    },
    {
      "sentence": "The company will be announcing the results in two days.",
      "verb": "announcing"
    },
    {
      "sentence": "We will be drinking milk next month.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, the cat will be catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next year, i will be eating a meal.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, john will be baking soup.",
      "verb": "baking"
    },
    {
      "sentence": "The children will be choosing a new house tomorrow.",
      "verb": "choosing"
    },
    {
      "sentence": "The children will be tidying the kitchen next year.",
      "verb": "tidying"
    },
    {
      "sentence": "Emma will be sending the application later.",
      "verb": "sending"
    },
    {
      "sentence": "My brother will be texting the doctor next week.",
      "verb": "texting"
    },
    {
      "sentence": "The children will be watching the match next week.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, my friend will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tomorrow, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time later, our neighbors will be playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will be sleeping on the bed tonight.",
      "verb": "sleeping"
    },
    {
      "sentence": "Soon, my brother will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, the manager will be organizing the office.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time this evening, they will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "In two days, he will be learning the material.",
      "verb": "learning"
    },
    {
      "sentence": "The teacher will be building a presentation this weekend.",
      "verb": "building"
    },
    {
      "sentence": "At this time tomorrow, the bird will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "Next week, my friend will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next week, she will be completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "This weekend, she will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next year, her sister will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, my friend will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, she will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager will be completing the report in two days.",
      "verb": "completing"
    },
    {
      "sentence": "They will be starting the letter next week.",
      "verb": "starting"
    },
    {
      "sentence": "At this time tonight, the cat will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "Later, the dog will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "She will be reviewing Spanish this weekend.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tom will be fixing the fence tomorrow.",
      "verb": "fixing"
    },
    {
      "sentence": "The team will be completing the project this evening.",
      "verb": "completing"
    },
    {
      "sentence": "Tonight, you will be speaking to a colleague.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, the children will be forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time this evening, they will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, john will be texting the team.",
      "verb": "texting"
    },
    {
      "sentence": "At this time next week, we will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, the company will be launching the software.",
      "verb": "launching"
    },
    {
      "sentence": "This evening, the children will be deciding on the decision.",
      "verb": "deciding"
    },
    {
      "sentence": "We will be talking to the teacher tomorrow.",
      "verb": "talking"
    },
    {
      "sentence": "Next year, the bird will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "The bird will be running in circles next month.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the bird will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah will be calling my parents later.",
      "verb": "calling"
    },
    {
      "sentence": "John will be painting a landscape this evening.",
      "verb": "painting"
    },
    {
      "sentence": "John will be texting the office next week.",
      "verb": "texting"
    },
    {
      "sentence": "Tonight, the team will be completing the results.",
      "verb": "completing"
    },
    {
      "sentence": "Tomorrow, my friend will be seeing the team.",
      "verb": "seeing"
    },
    {
      "sentence": "Tonight, the students will be reviewing for the exam.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time later, i will be eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, the cat will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister will be drinking some water tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next week, the children will be seeing an old friend.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time this weekend, my brother will be visiting my parents.",
      "verb": "visiting"
    },
    {
      "sentence": "This evening, the team will be releasing a new product.",
      "verb": "releasing"
    },
    {
      "sentence": "I will be talking to the client soon.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tonight, i will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "We will be watching the news in two days.",
      "verb": "watching"
    },
    {
      "sentence": "This weekend, she will be understanding the textbook.",
      "verb": "understanding"
    },
    {
      "sentence": "Next week, the children will be organizing the dishes.",
      "verb": "organizing"
    },
    {
      "sentence": "My brother will be submitting the assignment in two days.",
      "verb": "submitting"
    },
    {
      "sentence": "Next week, he will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time tonight, the manager will be meeting the manager.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors will be writing the document soon.",
      "verb": "writing"
    },
    {
      "sentence": "The cat will be chasing the mouse next year.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next year, he will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next year, my parents will be having a snack.",
      "verb": "having"
    },
    {
      "sentence": "At this time this evening, she will be repairing the fence.",
      "verb": "repairing"
    },
    {
      "sentence": "He will be giving groceries next month.",
      "verb": "giving"
    },
    {
      "sentence": "The cat will be playing with its owner next week.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will be eating a snack next year.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the team will be announcing the contract.",
      "verb": "announcing"
    },
    {
      "sentence": "The children will be speaking to my friend later.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time soon, my brother will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "I will be remembering the birthday party soon.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat will be chasing its tail soon.",
      "verb": "chasing"
    },
    {
      "sentence": "The bird will be eating its dinner next week.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, our neighbors will be speaking with the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, the students will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "Her sister will be eating a sandwich soon.",
      "verb": "eating"
    },
    {
      "sentence": "Tomorrow, john will be baking breakfast.",
      "verb": "baking"
    },
    {
      "sentence": "In two days, emma will be painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tomorrow, john will be emailing the manager.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time tonight, the dog will be running in circles.",
      "verb": "running"
    },
    {
      "sentence": "We will be learning history this evening.",
      "verb": "learning"
    },
    {
      "sentence": "Emma will be eating a salad this evening.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, you will be baking soup.",
      "verb": "baking"
    },
    {
      "sentence": "At this time this evening, you will be understanding vocabulary.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time tomorrow, the dog will be eating some food.",
      "verb": "eating"
    },
    {
      "sentence": "This evening, my parents will be receiving the proposal.",
      "verb": "receiving"
    },
    {
      "sentence": "Next year, she will be getting the ticket.",
      "verb": "getting"
    },
    {
      "sentence": "She will be preparing dinner next year.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird will be sleeping on the bed tomorrow.",
      "verb": "sleeping"
    },
    {
      "sentence": "Soon, they will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "The children will be fixing the roof in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "Tonight, the company will be launching the project.",
      "verb": "launching"
    },
    {
      "sentence": "This evening, my parents will be speaking with the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, tom will be practicing science.",
      "verb": "practicing"
    },
    {
      "sentence": "We will be painting a design in two days.",
      "verb": "painting"
    },
    {
      "sentence": "At this time soon, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next month, they will be baking a salad.",
      "verb": "baking"
    },
    {
      "sentence": "Tonight, i will be studying English.",
      "verb": "studying"
    },
    {
      "sentence": "This evening, the team will be launching the software.",
      "verb": "launching"
    },
    {
      "sentence": "At this time this evening, the dog will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next week, the dog will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "In two days, the children will be emailing the manager.",
      "verb": "emailing"
    },
    {
      "sentence": "Next month, tom will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "He will be flying to the bank next week.",
      "verb": "flying"
    },
    {
      "sentence": "Next year, we will be designing a model.",
      "verb": "designing"
    },
    {
      "sentence": "At this time next month, they will be preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time later, my friend will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, he will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, the bird will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children will be calling the office soon.",
      "verb": "calling"
    },
    {
      "sentence": "Soon, they will be finishing the report.",
      "verb": "finishing"
    },
    {
      "sentence": "In two days, john will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "Next week, the team will be announcing the results.",
      "verb": "announcing"
    },
    {
      "sentence": "The manager will be cleaning the dishes tomorrow.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next week, my brother will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, the cat will be running in the yard.",
      "verb": "running"
    },
    {
      "sentence": "At this time in two days, you will be considering the problem.",
      "verb": "considering"
    },
    {
      "sentence": "He will be playing football soon.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, my brother will be emailing my family.",
      "verb": "emailing"
    },
    {
      "sentence": "I will be repairing the computer tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "Tonight, they will be calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "Next week, i will be talking to the manager.",
      "verb": "talking"
    },
    {
      "sentence": "The students will be deciding on the trip later.",
      "verb": "deciding"
    },
    {
      "sentence": "In two days, john will be emailing my parents.",
      "verb": "emailing"
    },
    {
      "sentence": "Next year, our neighbors will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "This weekend, we will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, the teacher will be thinking about the situation.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time in two days, they will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "The company will be releasing the project next year.",
      "verb": "releasing"
    },
    {
      "sentence": "At this time next year, the manager will be meeting the team.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time in two days, emma will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next year, they will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "At this time this weekend, her sister will be reviewing the chapter.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next year, the teacher will be having a salad.",
      "verb": "having"
    },
    {
      "sentence": "At this time this evening, i will be building a prototype.",
      "verb": "building"
    },
    {
      "sentence": "Next year, the children will be tidying the house.",
      "verb": "tidying"
    },
    {
      "sentence": "The manager will be learning vocabulary this evening.",
      "verb": "learning"
    },
    {
      "sentence": "Tonight, the manager will be preparing breakfast.",
      "verb": "preparing"
    },
    {
      "sentence": "The children will be calling the doctor next month.",
      "verb": "calling"
    },
    {
      "sentence": "This weekend, the dog will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "Next year, the dog will be eating a treat.",
      "verb": "eating"
    },
    {
      "sentence": "Next month, the bird will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next year, emma will be playing football.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, tom will be washing the bathroom.",
      "verb": "washing"
    },
    {
      "sentence": "The bird will be running in the park this evening.",
      "verb": "running"
    },
    {
      "sentence": "At this time soon, she will be painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next year, you will be selling a laptop.",
      "verb": "selling"
    },
    {
      "sentence": "Soon, my parents will be organizing the bathroom.",
      "verb": "organizing"
    },
    {
      "sentence": "Next month, the dog will be playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, the students will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "This evening, john will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, the bird will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors will be watching the game tonight.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, the manager will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "Later, her sister will be organizing the kitchen.",
      "verb": "organizing"
    },
    {
      "sentence": "Next month, the dog will be sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "You will be fixing the machine tonight.",
      "verb": "fixing"
    },
    {
      "sentence": "This evening, my brother will be talking to my family.",
      "verb": "talking"
    },
    {
      "sentence": "In two days, the bird will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "We will be having some fruit next month.",
      "verb": "having"
    },
    {
      "sentence": "The cat will be running through the grass tonight.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, the cat will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "Soon, the manager will be speaking to the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "Next year, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma will be writing the proposal tomorrow.",
      "verb": "writing"
    },
    {
      "sentence": "At this time soon, they will be designing a project.",
      "verb": "designing"
    },
    {
      "sentence": "At this time this evening, they will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "She will be drinking tea in two days.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat will be running in the park tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "He will be learning the material next month.",
      "verb": "learning"
    },
    {
      "sentence": "At this time next month, we will be making dinner.",
      "verb": "making"
    },
    {
      "sentence": "He will be cleaning the dishes next week.",
      "verb": "cleaning"
    },
    {
      "sentence": "John will be selling the phone this weekend.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, she will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be playing with its owner next year.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, my friend will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, i will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah will be reviewing English next month.",
      "verb": "reviewing"
    },
    {
      "sentence": "This weekend, she will be making soup.",
      "verb": "making"
    },
    {
      "sentence": "Sarah will be driving to the hospital tomorrow.",
      "verb": "driving"
    },
    {
      "sentence": "The cat will be playing in the yard tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister will be teaching science in two days.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog will be chasing birds in the garden tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, the cat will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "They will be coming to the market this weekend.",
      "verb": "coming"
    },
    {
      "sentence": "Next month, our neighbors will be sketching a portrait.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time tomorrow, my parents will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "At this time this weekend, the students will be texting the teacher.",
      "verb": "texting"
    },
    {
      "sentence": "At this time soon, my parents will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, the cat will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "Soon, the cat will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time tomorrow, the students will be fixing the computer.",
      "verb": "fixing"
    },
    {
      "sentence": "This weekend, you will be forgetting the problem.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time in two days, my parents will be finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "Her sister will be visiting the client tonight.",
      "verb": "visiting"
    },
    {
      "sentence": "Soon, our neighbors will be organizing the car.",
      "verb": "organizing"
    },
    {
      "sentence": "He will be listening to music soon.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tonight, emma will be drawing a portrait.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time this evening, the bird will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "The teacher will be visiting the doctor next year.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog will be running in the garden tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "At this time tomorrow, the bird will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, my brother will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "This weekend, our neighbors will be deciding on the future.",
      "verb": "deciding"
    },
    {
      "sentence": "This weekend, the students will be repairing the bike.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next week, i will be eating a meal.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this evening, the bird will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "Next year, the bird will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, emma will be remembering the situation.",
      "verb": "remembering"
    },
    {
      "sentence": "Next month, you will be getting a book.",
      "verb": "getting"
    },
    {
      "sentence": "They will be designing a website next year.",
      "verb": "designing"
    },
    {
      "sentence": "This evening, the cat will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, the students will be giving groceries.",
      "verb": "giving"
    },
    {
      "sentence": "At this time this evening, tom will be eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "The manager will be watching the news in two days.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, the bird will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tonight, my parents will be creating a presentation.",
      "verb": "creating"
    },
    {
      "sentence": "My brother will be cooking lunch next week.",
      "verb": "cooking"
    },
    {
      "sentence": "Next month, the dog will be playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher will be drawing a picture tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "This evening, she will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, the teacher will be repairing the door.",
      "verb": "repairing"
    },
    {
      "sentence": "Later, they will be creating an app.",
      "verb": "creating"
    },
    {
      "sentence": "You will be eating a sandwich this weekend.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the manager will be deciding on the trip.",
      "verb": "deciding"
    },
    {
      "sentence": "The cat will be sleeping in the sun soon.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team will be launching the project in two days.",
      "verb": "launching"
    },
    {
      "sentence": "At this time next year, the dog will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "I will be repairing the door tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "She will be receiving the project next week.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time soon, i will be receiving the contract.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time this weekend, the students will be watching a documentary.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, the teacher will be returning to the library.",
      "verb": "returning"
    },
    {
      "sentence": "The bird will be chasing the other pets this weekend.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors will be listening to a song later.",
      "verb": "listening"
    },
    {
      "sentence": "At this time next week, john will be eating a meal.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, the dog will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "The manager will be running to the beach next month.",
      "verb": "running"
    },
    {
      "sentence": "Next month, emma will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "My brother will be seeing my family next month.",
      "verb": "seeing"
    },
    {
      "sentence": "This evening, she will be writing the proposal.",
      "verb": "writing"
    },
    {
      "sentence": "My friend will be watching a series tonight.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, her sister will be fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "Next month, she will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "Sarah will be fixing the door this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "We will be deciding on the event later.",
      "verb": "deciding"
    },
    {
      "sentence": "Sarah will be receiving the document tonight.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time next week, sarah will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "He will be organizing the clothes soon.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time next week, the manager will be watching a show.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will be running in the yard soon.",
      "verb": "running"
    },
    {
      "sentence": "At this time next week, the students will be contacting the teacher.",
      "verb": "contacting"
    },
    {
      "sentence": "This evening, the team will be winning the contract.",
      "verb": "winning"
    },
    {
      "sentence": "You will be creating a presentation tonight.",
      "verb": "creating"
    },
    {
      "sentence": "Next week, the children will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "My friend will be deciding on the birthday party soon.",
      "verb": "deciding"
    },
    {
      "sentence": "The teacher will be watching a video tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tomorrow, sarah will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, the cat will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will be eating its dinner next month.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the cat will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "The team will be announcing the deal this evening.",
      "verb": "announcing"
    },
    {
      "sentence": "He will be remembering the event this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time next month, he will be reviewing the material.",
      "verb": "reviewing"
    },
    {
      "sentence": "Emma will be walking to the library in two days.",
      "verb": "walking"
    },
    {
      "sentence": "At this time next year, the dog will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "Tomorrow, emma will be reading for the exam.",
      "verb": "reading"
    },
    {
      "sentence": "At this time later, my brother will be repairing the machine.",
      "verb": "repairing"
    },
    {
      "sentence": "Next week, sarah will be drawing the wall.",
      "verb": "drawing"
    },
    {
      "sentence": "The manager will be receiving the task next year.",
      "verb": "receiving"
    },
    {
      "sentence": "At this time this weekend, john will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "At this time this evening, the cat will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, he will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, he will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother will be visiting the teacher in two days.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister will be eating soup this evening.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, sarah will be studying grammar.",
      "verb": "studying"
    },
    {
      "sentence": "Next year, my friend will be planning the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "At this time next year, our neighbors will be eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the manager will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "At this time in two days, they will be fixing the machine.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time next month, tom will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "At this time in two days, we will be speaking with a colleague.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this evening, emma will be arriving to work.",
      "verb": "arriving"
    },
    {
      "sentence": "At this time later, emma will be calling the boss.",
      "verb": "calling"
    },
    {
      "sentence": "At this time in two days, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "John will be flying to the beach soon.",
      "verb": "flying"
    },
    {
      "sentence": "At this time soon, i will be building a house.",
      "verb": "building"
    },
    {
      "sentence": "Next month, the cat will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors will be calling my family this weekend.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, her sister will be buying a book.",
      "verb": "buying"
    },
    {
      "sentence": "Next year, john will be tidying the garage.",
      "verb": "tidying"
    },
    {
      "sentence": "Next year, the bird will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "This weekend, the children will be having some fruit.",
      "verb": "having"
    },
    {
      "sentence": "Emma will be tidying the house next month.",
      "verb": "tidying"
    },
    {
      "sentence": "My friend will be fixing the roof later.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents will be sketching a picture this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time in two days, we will be choosing a present.",
      "verb": "choosing"
    },
    {
      "sentence": "The children will be eating a sandwich next year.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be playing in the garden tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, you will be submitting the project.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time tonight, tom will be practicing Spanish.",
      "verb": "practicing"
    },
    {
      "sentence": "This weekend, you will be teaching grammar.",
      "verb": "teaching"
    },
    {
      "sentence": "Next year, the students will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, we will be sending the proposal.",
      "verb": "sending"
    },
    {
      "sentence": "Tonight, he will be sketching an illustration.",
      "verb": "sketching"
    },
    {
      "sentence": "This evening, my brother will be forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next week, our neighbors will be reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "This evening, she will be repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "Tomorrow, he will be designing a plan.",
      "verb": "designing"
    },
    {
      "sentence": "In two days, the team will be developing the championship.",
      "verb": "developing"
    },
    {
      "sentence": "Later, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this evening, the manager will be thinking about the birthday party.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time next year, the students will be finding a present.",
      "verb": "finding"
    },
    {
      "sentence": "Next week, the dog will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "John will be forgetting the event later.",
      "verb": "forgetting"
    },
    {
      "sentence": "At this time soon, tom will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, she will be understanding Spanish.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this evening, she will be remembering the birthday party.",
      "verb": "remembering"
    },
    {
      "sentence": "At this time in two days, my friend will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog will be chasing its tail next month.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah will be contacting the doctor this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "Soon, the students will be having breakfast.",
      "verb": "having"
    },
    {
      "sentence": "At this time next month, she will be painting a landscape.",
      "verb": "painting"
    },
    {
      "sentence": "At this time this evening, i will be cleaning the house.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next week, the bird will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time this evening, you will be washing the kitchen.",
      "verb": "washing"
    },
    {
      "sentence": "Tomorrow, the company will be completing the update.",
      "verb": "completing"
    },
    {
      "sentence": "John will be tidying the office tomorrow.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat will be catching a treat in two days.",
      "verb": "catching"
    },
    {
      "sentence": "At this time this weekend, tom will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "You will be baking a meal this weekend.",
      "verb": "baking"
    },
    {
      "sentence": "At this time later, john will be speaking with the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time tonight, he will be finishing the email.",
      "verb": "finishing"
    },
    {
      "sentence": "Emma will be learning Spanish this weekend.",
      "verb": "learning"
    },
    {
      "sentence": "Tonight, she will be forgetting the options.",
      "verb": "forgetting"
    },
    {
      "sentence": "The manager will be cleaning the room tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "Tomorrow, sarah will be submitting the task.",
      "verb": "submitting"
    },
    {
      "sentence": "The bird will be playing with the other pets later.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will be visiting the doctor next month.",
      "verb": "visiting"
    },
    {
      "sentence": "Next year, she will be forgetting the vacation.",
      "verb": "forgetting"
    },
    {
      "sentence": "Next month, the bird will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will be running around the house soon.",
      "verb": "running"
    },
    {
      "sentence": "At this time later, the company will be completing the championship.",
      "verb": "completing"
    },
    {
      "sentence": "At this time later, the team will be launching the project.",
      "verb": "launching"
    },
    {
      "sentence": "In two days, her sister will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "Tomorrow, he will be eating a snack.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, the bird will be chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will be catching a butterfly tomorrow.",
      "verb": "catching"
    },
    {
      "sentence": "Next month, the dog will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, my brother will be calling the doctor.",
      "verb": "calling"
    },
    {
      "sentence": "Sarah will be receiving the proposal tomorrow.",
      "verb": "receiving"
    },
    {
      "sentence": "Next year, the team will be announcing the update.",
      "verb": "announcing"
    },
    {
      "sentence": "In two days, the manager will be studying Spanish.",
      "verb": "studying"
    },
    {
      "sentence": "At this time tomorrow, the students will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "At this time soon, the teacher will be texting my friend.",
      "verb": "texting"
    },
    {
      "sentence": "Tom will be forgetting the options soon.",
      "verb": "forgetting"
    },
    {
      "sentence": "This evening, the manager will be emailing customer service.",
      "verb": "emailing"
    },
    {
      "sentence": "Next week, you will be washing the bathroom.",
      "verb": "washing"
    },
    {
      "sentence": "The dog will be sleeping in the sun this weekend.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time this evening, the dog will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "The bird will be eating some food in two days.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next year, the bird will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time later, he will be speaking with the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "We will be designing a website this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "My brother will be fixing the computer this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "Next week, you will be writing the presentation.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah will be planning the trip next week.",
      "verb": "planning"
    },
    {
      "sentence": "This weekend, tom will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "At this time soon, the students will be choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time soon, he will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "The students will be designing a project in two days.",
      "verb": "designing"
    },
    {
      "sentence": "Next year, he will be watching a show.",
      "verb": "watching"
    },
    {
      "sentence": "At this time tomorrow, sarah will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the company will be developing the update.",
      "verb": "developing"
    },
    {
      "sentence": "He will be having dinner tomorrow.",
      "verb": "having"
    },
    {
      "sentence": "This weekend, they will be seeing the client.",
      "verb": "seeing"
    },
    {
      "sentence": "Soon, the children will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will be submitting the email soon.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time in two days, she will be playing soccer.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will be running in the yard in two days.",
      "verb": "running"
    },
    {
      "sentence": "This evening, the cat will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, we will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "Next week, the teacher will be forgetting the birthday party.",
      "verb": "forgetting"
    },
    {
      "sentence": "John will be coming to the store later.",
      "verb": "coming"
    },
    {
      "sentence": "Tonight, the bird will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next month, sarah will be eating pasta.",
      "verb": "eating"
    },
    {
      "sentence": "They will be having a sandwich this weekend.",
      "verb": "having"
    },
    {
      "sentence": "This weekend, i will be drawing an illustration.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time soon, emma will be understanding mathematics.",
      "verb": "understanding"
    },
    {
      "sentence": "John will be baking cookies next week.",
      "verb": "baking"
    },
    {
      "sentence": "The children will be drawing the wall soon.",
      "verb": "drawing"
    },
    {
      "sentence": "Later, the bird will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "The bird will be sleeping on the couch later.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time soon, tom will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will be running around the house this evening.",
      "verb": "running"
    },
    {
      "sentence": "Tomorrow, the cat will be playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, my friend will be cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "The manager will be sketching a landscape tomorrow.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time later, the cat will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, you will be playing volleyball.",
      "verb": "playing"
    },
    {
      "sentence": "He will be tidying the house in two days.",
      "verb": "tidying"
    },
    {
      "sentence": "Tom will be talking to my parents next week.",
      "verb": "talking"
    },
    {
      "sentence": "At this time soon, the team will be announcing the project.",
      "verb": "announcing"
    },
    {
      "sentence": "The dog will be chasing the ball next week.",
      "verb": "chasing"
    },
    {
      "sentence": "Later, he will be considering the situation.",
      "verb": "considering"
    },
    {
      "sentence": "At this time this evening, the children will be fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time in two days, the bird will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next week, the cat will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next week, tom will be cooking breakfast.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time this evening, the teacher will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "She will be flying to school in two days.",
      "verb": "flying"
    },
    {
      "sentence": "At this time tomorrow, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, the company will be winning the championship.",
      "verb": "winning"
    },
    {
      "sentence": "My brother will be cleaning the room tomorrow.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher will be practicing for the exam tomorrow.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time this weekend, the manager will be reading the material.",
      "verb": "reading"
    },
    {
      "sentence": "Soon, they will be building a presentation.",
      "verb": "building"
    },
    {
      "sentence": "You will be choosing a present next week.",
      "verb": "choosing"
    },
    {
      "sentence": "Next month, the cat will be playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "This evening, my brother will be speaking to the professor.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, sarah will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "At this time later, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time in two days, our neighbors will be fixing the door.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time tomorrow, the students will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next week, he will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time tomorrow, we will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "I will be watching a show later.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next month, tom will be eating dinner.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be chasing the ball next month.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time tonight, the bird will be playing with the other pets.",
      "verb": "playing"
    },
    {
      "sentence": "Tom will be contacting the doctor in two days.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will be reviewing vocabulary in two days.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this evening, the cat will be chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time tonight, her sister will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "The children will be fixing the roof this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "Tonight, they will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "He will be completing the report next year.",
      "verb": "completing"
    },
    {
      "sentence": "Next week, my brother will be seeing the manager.",
      "verb": "seeing"
    },
    {
      "sentence": "This weekend, our neighbors will be going to the library.",
      "verb": "going"
    },
    {
      "sentence": "At this time this weekend, he will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "Our neighbors will be meeting the doctor next year.",
      "verb": "meeting"
    },
    {
      "sentence": "Later, he will be completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "At this time tomorrow, they will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, my friend will be preparing cookies.",
      "verb": "preparing"
    },
    {
      "sentence": "She will be preparing the email this weekend.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher will be seeing the doctor this evening.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time later, you will be giving the ticket.",
      "verb": "giving"
    },
    {
      "sentence": "At this time later, the cat will be running around the house.",
      "verb": "running"
    },
    {
      "sentence": "The dog will be playing in the garden soon.",
      "verb": "playing"
    },
    {
      "sentence": "John will be listening to music in two days.",
      "verb": "listening"
    },
    {
      "sentence": "He will be playing guitar this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Later, i will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "We will be understanding the chapter next week.",
      "verb": "understanding"
    },
    {
      "sentence": "The students will be tidying the car next month.",
      "verb": "tidying"
    },
    {
      "sentence": "Next year, the dog will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "Emma will be drinking coffee this weekend.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, my friend will be designing a presentation.",
      "verb": "designing"
    },
    {
      "sentence": "At this time soon, the bird will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "At this time later, my brother will be drawing a portrait.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time soon, the teacher will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "At this time tonight, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will be playing with the ball later.",
      "verb": "playing"
    },
    {
      "sentence": "Tomorrow, we will be buying a new car.",
      "verb": "buying"
    },
    {
      "sentence": "At this time tonight, the children will be playing basketball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the students will be visiting the teacher.",
      "verb": "visiting"
    },
    {
      "sentence": "In two days, my brother will be going to the market.",
      "verb": "going"
    },
    {
      "sentence": "In two days, sarah will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors will be forgetting the event next week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tonight, the dog will be running in the park.",
      "verb": "running"
    },
    {
      "sentence": "At this time this evening, the cat will be sleeping under the table.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next year, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, emma will be planning the situation.",
      "verb": "planning"
    },
    {
      "sentence": "I will be finishing the application next week.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time this evening, the students will be playing guitar.",
      "verb": "playing"
    },
    {
      "sentence": "Soon, her sister will be talking to the professor.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tonight, the manager will be having breakfast.",
      "verb": "having"
    },
    {
      "sentence": "You will be repairing the fence next month.",
      "verb": "repairing"
    },
    {
      "sentence": "This evening, my friend will be buying a new car.",
      "verb": "buying"
    },
    {
      "sentence": "The teacher will be sketching a poster next month.",
      "verb": "sketching"
    },
    {
      "sentence": "This weekend, my friend will be cooking pasta.",
      "verb": "cooking"
    },
    {
      "sentence": "The teacher will be arriving to the park tonight.",
      "verb": "arriving"
    },
    {
      "sentence": "This evening, her sister will be submitting the task.",
      "verb": "submitting"
    },
    {
      "sentence": "Tomorrow, the bird will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, i will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, the students will be submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "This weekend, my brother will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, he will be studying French.",
      "verb": "studying"
    },
    {
      "sentence": "The manager will be texting my parents next month.",
      "verb": "texting"
    },
    {
      "sentence": "This weekend, the children will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "At this time next month, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, my friend will be considering the birthday party.",
      "verb": "considering"
    },
    {
      "sentence": "At this time next year, the bird will be eating some food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time later, my brother will be learning vocabulary.",
      "verb": "learning"
    },
    {
      "sentence": "The teacher will be studying science next week.",
      "verb": "studying"
    },
    {
      "sentence": "Next week, my friend will be getting the phone.",
      "verb": "getting"
    },
    {
      "sentence": "My parents will be watching a show soon.",
      "verb": "watching"
    },
    {
      "sentence": "This weekend, the children will be finding a new house.",
      "verb": "finding"
    },
    {
      "sentence": "At this time this evening, sarah will be finding a new car.",
      "verb": "finding"
    },
    {
      "sentence": "At this time next week, she will be preparing dinner.",
      "verb": "preparing"
    },
    {
      "sentence": "The manager will be building a presentation later.",
      "verb": "building"
    },
    {
      "sentence": "Tomorrow, the dog will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "At this time this weekend, the dog will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, emma will be flying to work.",
      "verb": "flying"
    },
    {
      "sentence": "The children will be playing guitar this evening.",
      "verb": "playing"
    },
    {
      "sentence": "She will be baking dinner soon.",
      "verb": "baking"
    },
    {
      "sentence": "At this time next year, sarah will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah will be listening to music soon.",
      "verb": "listening"
    },
    {
      "sentence": "In two days, tom will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "This weekend, my parents will be listening to jazz.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, the dog will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, her sister will be submitting the task.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time this weekend, the company will be winning the software.",
      "verb": "winning"
    },
    {
      "sentence": "At this time tonight, sarah will be drawing a design.",
      "verb": "drawing"
    },
    {
      "sentence": "Emma will be making cookies next year.",
      "verb": "making"
    },
    {
      "sentence": "Tonight, our neighbors will be coming to the office.",
      "verb": "coming"
    },
    {
      "sentence": "In two days, the bird will be eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the teacher will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time tonight, she will be cleaning the clothes.",
      "verb": "cleaning"
    },
    {
      "sentence": "At this time next year, our neighbors will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "This evening, sarah will be sketching the wall.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time next week, her sister will be painting a picture.",
      "verb": "painting"
    },
    {
      "sentence": "At this time next month, her sister will be choosing a new car.",
      "verb": "choosing"
    },
    {
      "sentence": "Tonight, the students will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "The cat will be running around the house tonight.",
      "verb": "running"
    },
    {
      "sentence": "They will be sketching an illustration this evening.",
      "verb": "sketching"
    },
    {
      "sentence": "Later, tom will be thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time in two days, the children will be thinking about the birthday party.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time this evening, the cat will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend will be listening to the lecture next month.",
      "verb": "listening"
    },
    {
      "sentence": "Soon, john will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "He will be watching the news this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "John will be having a snack soon.",
      "verb": "having"
    },
    {
      "sentence": "At this time tonight, the manager will be repairing the roof.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors will be painting a portrait later.",
      "verb": "painting"
    },
    {
      "sentence": "This weekend, the cat will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "I will be fixing the bike this weekend.",
      "verb": "fixing"
    },
    {
      "sentence": "Tonight, the cat will be catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next year, the students will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "At this time soon, i will be emailing the office.",
      "verb": "emailing"
    },
    {
      "sentence": "I will be cleaning the dishes this weekend.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog will be chasing birds in the garden next year.",
      "verb": "chasing"
    },
    {
      "sentence": "Later, emma will be completing the letter.",
      "verb": "completing"
    },
    {
      "sentence": "At this time this evening, emma will be repairing the machine.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time this weekend, the dog will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next month, the team will be launching the deal.",
      "verb": "launching"
    },
    {
      "sentence": "Later, john will be thinking about the trip.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tonight, the dog will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "This evening, the teacher will be seeing the client.",
      "verb": "seeing"
    },
    {
      "sentence": "She will be playing golf next year.",
      "verb": "playing"
    },
    {
      "sentence": "The cat will be sleeping in the sun this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma will be watching the news tomorrow.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, she will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, sarah will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "This evening, our neighbors will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "Tomorrow, the bird will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next month, the cat will be sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next month, the team will be developing the update.",
      "verb": "developing"
    },
    {
      "sentence": "Tomorrow, the bird will be catching a bird.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next year, we will be drawing a diagram.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time later, tom will be finishing the email.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time in two days, the manager will be playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "John will be watching a movie this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "The manager will be creating a plan this evening.",
      "verb": "creating"
    },
    {
      "sentence": "He will be speaking to the neighbors next year.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time next month, my brother will be walking to the airport.",
      "verb": "walking"
    },
    {
      "sentence": "At this time later, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, john will be eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "This evening, my friend will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tonight, the company will be announcing the contract.",
      "verb": "announcing"
    },
    {
      "sentence": "The students will be remembering the options this weekend.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat will be sleeping in the sun next month.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time tonight, you will be understanding the lesson.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time tomorrow, the cat will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tonight, the bird will be eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, emma will be understanding the chapter.",
      "verb": "understanding"
    },
    {
      "sentence": "Tomorrow, i will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, our neighbors will be fixing the sink.",
      "verb": "fixing"
    },
    {
      "sentence": "This weekend, she will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next year, i will be having a meal.",
      "verb": "having"
    },
    {
      "sentence": "The bird will be eating the leftover food tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "Next year, the bird will be eating its food.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, john will be texting the office.",
      "verb": "texting"
    },
    {
      "sentence": "At this time tomorrow, she will be eating soup.",
      "verb": "eating"
    },
    {
      "sentence": "In two days, the manager will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "Later, the teacher will be considering the options.",
      "verb": "considering"
    },
    {
      "sentence": "At this time soon, the students will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "I will be eating a snack in two days.",
      "verb": "eating"
    },
    {
      "sentence": "The cat will be playing in the park in two days.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the dog will be chasing birds in the garden.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time tomorrow, the bird will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will be chasing birds in the garden tomorrow.",
      "verb": "chasing"
    },
    {
      "sentence": "Later, the bird will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors will be understanding grammar later.",
      "verb": "understanding"
    },
    {
      "sentence": "He will be driving to the library next year.",
      "verb": "driving"
    },
    {
      "sentence": "Tomorrow, emma will be sketching a design.",
      "verb": "sketching"
    },
    {
      "sentence": "Next month, the children will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, john will be tidying the car.",
      "verb": "tidying"
    },
    {
      "sentence": "Next month, my friend will be contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "Tomorrow, the bird will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "My brother will be planning the future this weekend.",
      "verb": "planning"
    },
    {
      "sentence": "The teacher will be drinking water next month.",
      "verb": "drinking"
    },
    {
      "sentence": "We will be repairing the car tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend will be watching a series next year.",
      "verb": "watching"
    },
    {
      "sentence": "John will be drinking tea tomorrow.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird will be running through the grass tomorrow.",
      "verb": "running"
    },
    {
      "sentence": "At this time soon, my friend will be playing tennis.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will be catching a treat in two days.",
      "verb": "catching"
    },
    {
      "sentence": "At this time soon, my friend will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "Next month, tom will be having dinner.",
      "verb": "having"
    },
    {
      "sentence": "Next year, the dog will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "Later, i will be contacting customer service.",
      "verb": "contacting"
    },
    {
      "sentence": "Tom will be painting a landscape soon.",
      "verb": "painting"
    },
    {
      "sentence": "At this time later, the bird will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "At this time next month, he will be finishing the letter.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time next month, the manager will be receiving the assignment.",
      "verb": "receiving"
    },
    {
      "sentence": "Tomorrow, sarah will be making a meal.",
      "verb": "making"
    },
    {
      "sentence": "Sarah will be organizing the office later.",
      "verb": "organizing"
    },
    {
      "sentence": "The dog will be eating its dinner in two days.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, my brother will be seeing my parents.",
      "verb": "seeing"
    },
    {
      "sentence": "This weekend, my parents will be traveling to school.",
      "verb": "traveling"
    },
    {
      "sentence": "The dog will be catching a treat this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "The cat will be sleeping all day next year.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next week, we will be talking to my friend.",
      "verb": "talking"
    },
    {
      "sentence": "At this time tonight, the cat will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next month, the cat will be running through the grass.",
      "verb": "running"
    },
    {
      "sentence": "My brother will be teaching the chapter this evening.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog will be playing in the garden this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, she will be baking dinner.",
      "verb": "baking"
    },
    {
      "sentence": "The cat will be playing with its owner next year.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next year, my friend will be understanding French.",
      "verb": "understanding"
    },
    {
      "sentence": "My parents will be watching a show next month.",
      "verb": "watching"
    },
    {
      "sentence": "This weekend, he will be sending the task.",
      "verb": "sending"
    },
    {
      "sentence": "At this time next year, we will be speaking with the client.",
      "verb": "speaking"
    },
    {
      "sentence": "This weekend, they will be choosing some clothes.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time next year, we will be reading English.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah will be eating a meal this evening.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, you will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, my parents will be watching a video.",
      "verb": "watching"
    },
    {
      "sentence": "At this time next year, emma will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "You will be washing the office next year.",
      "verb": "washing"
    },
    {
      "sentence": "My parents will be repairing the door this evening.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, they will be traveling to the store.",
      "verb": "traveling"
    },
    {
      "sentence": "Next month, he will be drawing a diagram.",
      "verb": "drawing"
    },
    {
      "sentence": "Next week, they will be understanding the notes.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this weekend, she will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "At this time next week, the company will be announcing the deal.",
      "verb": "announcing"
    },
    {
      "sentence": "Tonight, sarah will be choosing the keys.",
      "verb": "choosing"
    },
    {
      "sentence": "The students will be washing the dishes this weekend.",
      "verb": "washing"
    },
    {
      "sentence": "Tonight, we will be flying to the office.",
      "verb": "flying"
    },
    {
      "sentence": "The cat will be eating some food in two days.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next week, the company will be completing the deal.",
      "verb": "completing"
    },
    {
      "sentence": "My parents will be practicing Spanish this evening.",
      "verb": "practicing"
    },
    {
      "sentence": "At this time next year, the teacher will be emailing the boss.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time next month, our neighbors will be calling the office.",
      "verb": "calling"
    },
    {
      "sentence": "The manager will be walking to the market later.",
      "verb": "walking"
    },
    {
      "sentence": "At this time next month, the dog will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next year, the company will be releasing the project.",
      "verb": "releasing"
    },
    {
      "sentence": "The children will be creating a house in two days.",
      "verb": "creating"
    },
    {
      "sentence": "Next week, the teacher will be choosing flowers.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother will be understanding the material tomorrow.",
      "verb": "understanding"
    },
    {
      "sentence": "At this time this weekend, our neighbors will be fixing the machine.",
      "verb": "fixing"
    },
    {
      "sentence": "The team will be launching the contract next month.",
      "verb": "launching"
    },
    {
      "sentence": "Tonight, the manager will be creating a house.",
      "verb": "creating"
    },
    {
      "sentence": "Emma will be preparing a cake tonight.",
      "verb": "preparing"
    },
    {
      "sentence": "Tomorrow, she will be reviewing science.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next month, the teacher will be writing the presentation.",
      "verb": "writing"
    },
    {
      "sentence": "Tonight, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, they will be walking to work.",
      "verb": "walking"
    },
    {
      "sentence": "He will be eating lunch tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "At this time in two days, the bird will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "The bird will be running in circles this evening.",
      "verb": "running"
    },
    {
      "sentence": "John will be submitting the report soon.",
      "verb": "submitting"
    },
    {
      "sentence": "Tonight, my friend will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors will be designing an app next month.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tonight, john will be reviewing the notes.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time this weekend, the company will be releasing the results.",
      "verb": "releasing"
    },
    {
      "sentence": "This weekend, my parents will be completing the application.",
      "verb": "completing"
    },
    {
      "sentence": "At this time this evening, the dog will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next month, emma will be speaking with the neighbors.",
      "verb": "speaking"
    },
    {
      "sentence": "Soon, my parents will be giving flowers.",
      "verb": "giving"
    },
    {
      "sentence": "Tomorrow, she will be having breakfast.",
      "verb": "having"
    },
    {
      "sentence": "This evening, my parents will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, she will be creating an app.",
      "verb": "creating"
    },
    {
      "sentence": "At this time later, the children will be painting a poster.",
      "verb": "painting"
    },
    {
      "sentence": "Tomorrow, the company will be announcing the contract.",
      "verb": "announcing"
    },
    {
      "sentence": "This evening, emma will be listening to the news.",
      "verb": "listening"
    },
    {
      "sentence": "The team will be developing the update tonight.",
      "verb": "developing"
    },
    {
      "sentence": "At this time tonight, the teacher will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "At this time in two days, she will be preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time this evening, the cat will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be speaking with the client this evening.",
      "verb": "speaking"
    },
    {
      "sentence": "Next year, her sister will be listening to the radio.",
      "verb": "listening"
    },
    {
      "sentence": "The children will be receiving the assignment tomorrow.",
      "verb": "receiving"
    },
    {
      "sentence": "They will be watching the match next year.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, they will be contacting the client.",
      "verb": "contacting"
    },
    {
      "sentence": "Emma will be fixing the bike next week.",
      "verb": "fixing"
    },
    {
      "sentence": "This evening, they will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, my brother will be seeing the team.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time this weekend, the bird will be sleeping in the sun.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time next week, we will be returning to the office.",
      "verb": "returning"
    },
    {
      "sentence": "At this time next week, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "Next week, the company will be completing the contract.",
      "verb": "completing"
    },
    {
      "sentence": "Next week, her sister will be emailing the doctor.",
      "verb": "emailing"
    },
    {
      "sentence": "We will be eating a snack later.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next year, the manager will be playing chess.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will be emailing the office later.",
      "verb": "emailing"
    },
    {
      "sentence": "Next month, the cat will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "The company will be completing the project this weekend.",
      "verb": "completing"
    },
    {
      "sentence": "At this time in two days, her sister will be teaching Spanish.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time this weekend, my friend will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tonight, my friend will be washing the kitchen.",
      "verb": "washing"
    },
    {
      "sentence": "Sarah will be speaking with the teacher in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, her sister will be reading science.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah will be designing a model in two days.",
      "verb": "designing"
    },
    {
      "sentence": "At this time next week, the bird will be catching a treat.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next week, the manager will be washing the car.",
      "verb": "washing"
    },
    {
      "sentence": "Next month, the team will be releasing the results.",
      "verb": "releasing"
    },
    {
      "sentence": "Sarah will be planning the problem this evening.",
      "verb": "planning"
    },
    {
      "sentence": "I will be returning to the beach later.",
      "verb": "returning"
    },
    {
      "sentence": "They will be designing a house tonight.",
      "verb": "designing"
    },
    {
      "sentence": "The manager will be watching the match tonight.",
      "verb": "watching"
    },
    {
      "sentence": "Next week, the students will be planning the trip.",
      "verb": "planning"
    },
    {
      "sentence": "Soon, my friend will be calling the manager.",
      "verb": "calling"
    },
    {
      "sentence": "The cat will be sleeping on the bed later.",
      "verb": "sleeping"
    },
    {
      "sentence": "He will be eating a sandwich tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "The team will be developing a new product next week.",
      "verb": "developing"
    },
    {
      "sentence": "At this time next year, my parents will be baking a meal.",
      "verb": "baking"
    },
    {
      "sentence": "He will be tidying the office in two days.",
      "verb": "tidying"
    },
    {
      "sentence": "John will be cooking dinner next week.",
      "verb": "cooking"
    },
    {
      "sentence": "This weekend, the dog will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah will be talking to the doctor tonight.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will be emailing the teacher tomorrow.",
      "verb": "emailing"
    },
    {
      "sentence": "Soon, they will be designing a prototype.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah will be playing the piano later.",
      "verb": "playing"
    },
    {
      "sentence": "The children will be building a house later.",
      "verb": "building"
    },
    {
      "sentence": "Her sister will be teaching history this weekend.",
      "verb": "teaching"
    },
    {
      "sentence": "This weekend, my parents will be remembering the plan.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird will be chasing the toy next month.",
      "verb": "chasing"
    },
    {
      "sentence": "She will be tidying the dishes later.",
      "verb": "tidying"
    },
    {
      "sentence": "At this time next month, the cat will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next week, i will be washing the dishes.",
      "verb": "washing"
    },
    {
      "sentence": "I will be baking a salad this weekend.",
      "verb": "baking"
    },
    {
      "sentence": "I will be drinking juice this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time later, the dog will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "Next year, she will be tidying the dishes.",
      "verb": "tidying"
    },
    {
      "sentence": "Next week, my parents will be giving a gift.",
      "verb": "giving"
    },
    {
      "sentence": "My brother will be understanding the lesson next week.",
      "verb": "understanding"
    },
    {
      "sentence": "The cat will be running through the grass this evening.",
      "verb": "running"
    },
    {
      "sentence": "The bird will be eating some food later.",
      "verb": "eating"
    },
    {
      "sentence": "At this time this weekend, the cat will be playing with the ball.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, you will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog will be playing in the yard next month.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, our neighbors will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "Next year, my friend will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "At this time tonight, the children will be repairing the roof.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah will be driving downtown next week.",
      "verb": "driving"
    },
    {
      "sentence": "Tomorrow, the bird will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "He will be submitting the proposal this evening.",
      "verb": "submitting"
    },
    {
      "sentence": "Next month, i will be meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time soon, our neighbors will be reading English.",
      "verb": "reading"
    },
    {
      "sentence": "The cat will be playing with the other pets next year.",
      "verb": "playing"
    },
    {
      "sentence": "At this time in two days, i will be fixing the car.",
      "verb": "fixing"
    },
    {
      "sentence": "Emma will be eating pizza in two days.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah will be visiting the client tonight.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time next week, the bird will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "Next month, the dog will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "Next week, my brother will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister will be speaking to the team next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Soon, my parents will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "At this time later, john will be designing a model.",
      "verb": "designing"
    },
    {
      "sentence": "This evening, she will be drawing a portrait.",
      "verb": "drawing"
    },
    {
      "sentence": "The students will be buying a laptop tonight.",
      "verb": "buying"
    },
    {
      "sentence": "Soon, the dog will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "Tonight, the bird will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher will be cooking a salad soon.",
      "verb": "cooking"
    },
    {
      "sentence": "In two days, he will be creating a website.",
      "verb": "creating"
    },
    {
      "sentence": "At this time next year, the cat will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "Tomorrow, we will be eating a sandwich.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tomorrow, sarah will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "This evening, he will be watching TV.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, emma will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors will be designing a website next week.",
      "verb": "designing"
    },
    {
      "sentence": "We will be cooking cookies next week.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog will be eating the leftover food tomorrow.",
      "verb": "eating"
    },
    {
      "sentence": "You will be cooking cookies later.",
      "verb": "cooking"
    },
    {
      "sentence": "My brother will be designing a presentation next week.",
      "verb": "designing"
    },
    {
      "sentence": "Later, tom will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager will be drawing a poster tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "At this time tonight, you will be sketching a poster.",
      "verb": "sketching"
    },
    {
      "sentence": "The children will be preparing breakfast later.",
      "verb": "preparing"
    },
    {
      "sentence": "This evening, my parents will be having breakfast.",
      "verb": "having"
    },
    {
      "sentence": "The bird will be eating its dinner later.",
      "verb": "eating"
    },
    {
      "sentence": "John will be listening to an audiobook soon.",
      "verb": "listening"
    },
    {
      "sentence": "Emma will be visiting the neighbors this weekend.",
      "verb": "visiting"
    },
    {
      "sentence": "This evening, her sister will be painting the wall.",
      "verb": "painting"
    },
    {
      "sentence": "The bird will be playing in the garden next week.",
      "verb": "playing"
    },
    {
      "sentence": "The team will be announcing the contract this weekend.",
      "verb": "announcing"
    },
    {
      "sentence": "Next year, the manager will be reviewing the chapter.",
      "verb": "reviewing"
    },
    {
      "sentence": "At this time tomorrow, he will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be finishing the report later.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time next week, the cat will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "In two days, the teacher will be understanding mathematics.",
      "verb": "understanding"
    },
    {
      "sentence": "Tomorrow, the students will be playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, sarah will be painting a portrait.",
      "verb": "painting"
    },
    {
      "sentence": "The manager will be practicing English this evening.",
      "verb": "practicing"
    },
    {
      "sentence": "Sarah will be watching a video this evening.",
      "verb": "watching"
    },
    {
      "sentence": "Next week, the dog will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah will be returning home in two days.",
      "verb": "returning"
    },
    {
      "sentence": "Sarah will be talking to the manager tonight.",
      "verb": "talking"
    },
    {
      "sentence": "The manager will be drinking water soon.",
      "verb": "drinking"
    },
    {
      "sentence": "I will be choosing some clothes in two days.",
      "verb": "choosing"
    },
    {
      "sentence": "Later, emma will be tidying the clothes.",
      "verb": "tidying"
    },
    {
      "sentence": "You will be drinking some water this evening.",
      "verb": "drinking"
    },
    {
      "sentence": "We will be playing video games next week.",
      "verb": "playing"
    },
    {
      "sentence": "We will be sending the email soon.",
      "verb": "sending"
    },
    {
      "sentence": "Tom will be preparing the project in two days.",
      "verb": "preparing"
    },
    {
      "sentence": "Next week, they will be visiting my friend.",
      "verb": "visiting"
    },
    {
      "sentence": "Tomorrow, my parents will be understanding English.",
      "verb": "understanding"
    },
    {
      "sentence": "In two days, the manager will be making pasta.",
      "verb": "making"
    },
    {
      "sentence": "At this time this weekend, the manager will be finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "In two days, you will be understanding history.",
      "verb": "understanding"
    },
    {
      "sentence": "This evening, we will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "Later, tom will be submitting the letter.",
      "verb": "submitting"
    },
    {
      "sentence": "At this time in two days, they will be submitting the assignment.",
      "verb": "submitting"
    },
    {
      "sentence": "The cat will be playing with the other pets tonight.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, my friend will be deciding on the plan.",
      "verb": "deciding"
    },
    {
      "sentence": "Tom will be contacting the boss next year.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister will be teaching French next week.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "At this time tonight, my parents will be watching the news.",
      "verb": "watching"
    },
    {
      "sentence": "Soon, the cat will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat will be running in the garden soon.",
      "verb": "running"
    },
    {
      "sentence": "At this time next month, my parents will be making lunch.",
      "verb": "making"
    },
    {
      "sentence": "Next week, my friend will be preparing the application.",
      "verb": "preparing"
    },
    {
      "sentence": "Tomorrow, my friend will be getting a laptop.",
      "verb": "getting"
    },
    {
      "sentence": "In two days, the manager will be visiting the client.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tomorrow, my brother will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister will be playing chess this evening.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, i will be eating a salad.",
      "verb": "eating"
    },
    {
      "sentence": "Tonight, tom will be cleaning the bathroom.",
      "verb": "cleaning"
    },
    {
      "sentence": "Tomorrow, the bird will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will be seeing my parents tonight.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister will be cooking soup tonight.",
      "verb": "cooking"
    },
    {
      "sentence": "Soon, he will be preparing the assignment.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time in two days, he will be designing a model.",
      "verb": "designing"
    },
    {
      "sentence": "This evening, the cat will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "Tom will be repairing the bike tomorrow.",
      "verb": "repairing"
    },
    {
      "sentence": "He will be building an app this evening.",
      "verb": "building"
    },
    {
      "sentence": "The bird will be catching a butterfly next year.",
      "verb": "catching"
    },
    {
      "sentence": "In two days, the bird will be sleeping by the window.",
      "verb": "sleeping"
    },
    {
      "sentence": "In two days, the dog will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "In two days, the manager will be calling customer service.",
      "verb": "calling"
    },
    {
      "sentence": "This weekend, the bird will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time tonight, i will be talking to my friend.",
      "verb": "talking"
    },
    {
      "sentence": "Next week, my brother will be having a sandwich.",
      "verb": "having"
    },
    {
      "sentence": "The cat will be running around the house this evening.",
      "verb": "running"
    },
    {
      "sentence": "At this time in two days, the bird will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "At this time soon, the bird will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "Tonight, you will be building a presentation.",
      "verb": "building"
    },
    {
      "sentence": "The company will be announcing the project this evening.",
      "verb": "announcing"
    },
    {
      "sentence": "Tonight, tom will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, emma will be seeing the team.",
      "verb": "seeing"
    },
    {
      "sentence": "We will be emailing the doctor later.",
      "verb": "emailing"
    },
    {
      "sentence": "The students will be finishing the assignment tomorrow.",
      "verb": "finishing"
    },
    {
      "sentence": "The teacher will be listening to a podcast next week.",
      "verb": "listening"
    },
    {
      "sentence": "Next month, you will be teaching French.",
      "verb": "teaching"
    },
    {
      "sentence": "Next month, we will be selling a present.",
      "verb": "selling"
    },
    {
      "sentence": "Emma will be meeting the doctor later.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, the bird will be chasing the other pets.",
      "verb": "chasing"
    },
    {
      "sentence": "The students will be watching the game in two days.",
      "verb": "watching"
    },
    {
      "sentence": "At this time in two days, my friend will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "We will be drinking water tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time soon, the cat will be eating its dinner.",
      "verb": "eating"
    },
    {
      "sentence": "In two days, her sister will be sketching a picture.",
      "verb": "sketching"
    },
    {
      "sentence": "At this time tonight, my brother will be buying a present.",
      "verb": "buying"
    },
    {
      "sentence": "At this time this evening, her sister will be meeting the client.",
      "verb": "meeting"
    },
    {
      "sentence": "He will be playing basketball next week.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, emma will be organizing the kitchen.",
      "verb": "organizing"
    },
    {
      "sentence": "At this time tonight, john will be repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time tomorrow, the cat will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "We will be building an app next month.",
      "verb": "building"
    },
    {
      "sentence": "You will be meeting my grandmother next month.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat will be catching a butterfly in two days.",
      "verb": "catching"
    },
    {
      "sentence": "In two days, john will be learning science.",
      "verb": "learning"
    },
    {
      "sentence": "Tonight, the teacher will be giving a present.",
      "verb": "giving"
    },
    {
      "sentence": "Next month, they will be having lunch.",
      "verb": "having"
    },
    {
      "sentence": "In two days, she will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next year, you will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "Tonight, the children will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "My friend will be speaking with the client tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the bird will be eating some food.",
      "verb": "eating"
    },
    {
      "sentence": "This weekend, the company will be developing the update.",
      "verb": "developing"
    },
    {
      "sentence": "This weekend, sarah will be getting groceries.",
      "verb": "getting"
    },
    {
      "sentence": "This weekend, the cat will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time soon, the teacher will be thinking about the future.",
      "verb": "thinking"
    },
    {
      "sentence": "Sarah will be watching football this evening.",
      "verb": "watching"
    },
    {
      "sentence": "The students will be designing a presentation this weekend.",
      "verb": "designing"
    },
    {
      "sentence": "Soon, my parents will be building a plan.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, tom will be reviewing the lesson.",
      "verb": "reviewing"
    },
    {
      "sentence": "Tonight, she will be considering the decision.",
      "verb": "considering"
    },
    {
      "sentence": "The cat will be running through the grass next year.",
      "verb": "running"
    },
    {
      "sentence": "Tomorrow, my parents will be choosing a book.",
      "verb": "choosing"
    },
    {
      "sentence": "At this time this evening, the team will be developing a new product.",
      "verb": "developing"
    },
    {
      "sentence": "Tonight, my friend will be eating pizza.",
      "verb": "eating"
    },
    {
      "sentence": "They will be playing the piano soon.",
      "verb": "playing"
    },
    {
      "sentence": "Soon, the team will be launching the update.",
      "verb": "launching"
    },
    {
      "sentence": "The students will be fixing the bike in two days.",
      "verb": "fixing"
    },
    {
      "sentence": "Next year, i will be designing a house.",
      "verb": "designing"
    },
    {
      "sentence": "The bird will be eating its dinner next year.",
      "verb": "eating"
    },
    {
      "sentence": "My parents will be listening to the radio in two days.",
      "verb": "listening"
    },
    {
      "sentence": "We will be watching TV this evening.",
      "verb": "watching"
    },
    {
      "sentence": "He will be preparing cookies in two days.",
      "verb": "preparing"
    },
    {
      "sentence": "Tonight, the students will be starting the report.",
      "verb": "starting"
    },
    {
      "sentence": "Next week, the cat will be running across the field.",
      "verb": "running"
    },
    {
      "sentence": "At this time this weekend, she will be making a meal.",
      "verb": "making"
    },
    {
      "sentence": "The cat will be running across the field this weekend.",
      "verb": "running"
    },
    {
      "sentence": "You will be starting the email this weekend.",
      "verb": "starting"
    },
    {
      "sentence": "At this time later, our neighbors will be meeting my family.",
      "verb": "meeting"
    },
    {
      "sentence": "Next week, the bird will be catching the ball.",
      "verb": "catching"
    },
    {
      "sentence": "Next week, the bird will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Later, the bird will be running across the field.",
      "verb": "running"
    },
    {
      "sentence": "The dog will be eating its food this evening.",
      "verb": "eating"
    },
    {
      "sentence": "The dog will be playing with the ball later.",
      "verb": "playing"
    },
    {
      "sentence": "The bird will be eating its food in two days.",
      "verb": "eating"
    },
    {
      "sentence": "At this time soon, emma will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Emma will be speaking to a colleague in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Later, sarah will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "This weekend, the bird will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will be running in the park next year.",
      "verb": "running"
    },
    {
      "sentence": "At this time next week, the teacher will be washing the house.",
      "verb": "washing"
    },
    {
      "sentence": "Tonight, he will be submitting the application.",
      "verb": "submitting"
    },
    {
      "sentence": "Next week, the company will be launching the software.",
      "verb": "launching"
    },
    {
      "sentence": "The cat will be chasing its tail this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "Next week, he will be completing the report.",
      "verb": "completing"
    },
    {
      "sentence": "This evening, the manager will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "In two days, the children will be baking pasta.",
      "verb": "baking"
    },
    {
      "sentence": "Later, she will be meeting my friend.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time next week, she will be remembering the vacation.",
      "verb": "remembering"
    },
    {
      "sentence": "In two days, the dog will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "Next year, i will be repairing the car.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, the manager will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "We will be playing volleyball next month.",
      "verb": "playing"
    },
    {
      "sentence": "I will be drawing an illustration in two days.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird will be catching the ball tomorrow.",
      "verb": "catching"
    },
    {
      "sentence": "At this time next month, my brother will be forgetting the future.",
      "verb": "forgetting"
    },
    {
      "sentence": "In two days, the children will be forgetting the trip.",
      "verb": "forgetting"
    },
    {
      "sentence": "The bird will be sleeping all day next week.",
      "verb": "sleeping"
    },
    {
      "sentence": "In two days, the bird will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time in two days, the manager will be cooking lunch.",
      "verb": "cooking"
    },
    {
      "sentence": "This evening, the children will be repairing the computer.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend will be flying to the market soon.",
      "verb": "flying"
    },
    {
      "sentence": "Next week, my friend will be building a project.",
      "verb": "building"
    },
    {
      "sentence": "Next year, sarah will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "My friend will be watching the game this weekend.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah will be listening to a podcast tonight.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, the children will be buying a laptop.",
      "verb": "buying"
    },
    {
      "sentence": "My brother will be completing the document tonight.",
      "verb": "completing"
    },
    {
      "sentence": "At this time this weekend, tom will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "My parents will be planning the birthday party next month.",
      "verb": "planning"
    },
    {
      "sentence": "This evening, they will be washing the garage.",
      "verb": "washing"
    },
    {
      "sentence": "Later, i will be watching football.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, her sister will be fixing the door.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time tonight, he will be talking to the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "My friend will be finding a gift soon.",
      "verb": "finding"
    },
    {
      "sentence": "At this time soon, the children will be talking to the teacher.",
      "verb": "talking"
    },
    {
      "sentence": "The bird will be sleeping in the sun tonight.",
      "verb": "sleeping"
    },
    {
      "sentence": "I will be painting a landscape next month.",
      "verb": "painting"
    },
    {
      "sentence": "This evening, we will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this weekend, they will be fixing the fence.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time soon, they will be forgetting the plan.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tomorrow, the company will be announcing a new product.",
      "verb": "announcing"
    },
    {
      "sentence": "I will be planning the trip tonight.",
      "verb": "planning"
    },
    {
      "sentence": "My brother will be buying some clothes next month.",
      "verb": "buying"
    },
    {
      "sentence": "At this time in two days, you will be preparing a meal.",
      "verb": "preparing"
    },
    {
      "sentence": "She will be contacting the office this weekend.",
      "verb": "contacting"
    },
    {
      "sentence": "Emma will be sending the letter later.",
      "verb": "sending"
    },
    {
      "sentence": "The manager will be tidying the car in two days.",
      "verb": "tidying"
    },
    {
      "sentence": "Our neighbors will be playing chess in two days.",
      "verb": "playing"
    },
    {
      "sentence": "At this time tomorrow, my brother will be preparing the assignment.",
      "verb": "preparing"
    },
    {
      "sentence": "My friend will be playing the piano tomorrow.",
      "verb": "playing"
    },
    {
      "sentence": "She will be forgetting the plan next year.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tonight, tom will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "My brother will be having breakfast this weekend.",
      "verb": "having"
    },
    {
      "sentence": "This weekend, sarah will be speaking with my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this weekend, sarah will be designing a website.",
      "verb": "designing"
    },
    {
      "sentence": "We will be drinking milk tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, her sister will be leaving to the beach.",
      "verb": "leaving"
    },
    {
      "sentence": "In two days, the dog will be playing in the yard.",
      "verb": "playing"
    },
    {
      "sentence": "At this time later, she will be traveling to the store.",
      "verb": "traveling"
    },
    {
      "sentence": "The students will be painting a landscape this weekend.",
      "verb": "painting"
    },
    {
      "sentence": "Emma will be speaking to the team later.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time this evening, emma will be emailing the client.",
      "verb": "emailing"
    },
    {
      "sentence": "The children will be starting the project soon.",
      "verb": "starting"
    },
    {
      "sentence": "The bird will be playing with the other pets soon.",
      "verb": "playing"
    },
    {
      "sentence": "John will be thinking about the trip this weekend.",
      "verb": "thinking"
    },
    {
      "sentence": "At this time tonight, the dog will be catching the frisbee.",
      "verb": "catching"
    },
    {
      "sentence": "Tom will be playing football next year.",
      "verb": "playing"
    },
    {
      "sentence": "We will be meeting the client tomorrow.",
      "verb": "meeting"
    },
    {
      "sentence": "At this time in two days, the students will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "The teacher will be understanding for the exam next year.",
      "verb": "understanding"
    },
    {
      "sentence": "Next month, emma will be organizing the bathroom.",
      "verb": "organizing"
    },
    {
      "sentence": "Next week, sarah will be drinking a smoothie.",
      "verb": "drinking"
    },
    {
      "sentence": "You will be speaking to the boss next month.",
      "verb": "speaking"
    },
    {
      "sentence": "In two days, you will be finishing the project.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time next week, emma will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "Tonight, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "Next month, my friend will be listening to an audiobook.",
      "verb": "listening"
    },
    {
      "sentence": "Tomorrow, sarah will be selling the keys.",
      "verb": "selling"
    },
    {
      "sentence": "Next week, you will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "At this time tomorrow, the dog will be chasing the toy.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next week, the dog will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the cat will be playing in the garden.",
      "verb": "playing"
    },
    {
      "sentence": "This evening, her sister will be drinking juice.",
      "verb": "drinking"
    },
    {
      "sentence": "Tonight, the manager will be eating lunch.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next week, the manager will be getting a gift.",
      "verb": "getting"
    },
    {
      "sentence": "John will be listening to jazz tonight.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, the dog will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "They will be drinking water tonight.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time soon, her sister will be sketching an illustration.",
      "verb": "sketching"
    },
    {
      "sentence": "This weekend, the cat will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next week, our neighbors will be listening to music.",
      "verb": "listening"
    },
    {
      "sentence": "He will be cleaning the garage this evening.",
      "verb": "cleaning"
    },
    {
      "sentence": "Later, sarah will be speaking with the manager.",
      "verb": "speaking"
    },
    {
      "sentence": "Next month, the manager will be preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "The children will be drawing a portrait tonight.",
      "verb": "drawing"
    },
    {
      "sentence": "The dog will be playing in the park soon.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next month, the students will be designing a plan.",
      "verb": "designing"
    },
    {
      "sentence": "At this time next year, i will be deciding on the future.",
      "verb": "deciding"
    },
    {
      "sentence": "Next week, you will be playing golf.",
      "verb": "playing"
    },
    {
      "sentence": "In two days, the cat will be eating its breakfast.",
      "verb": "eating"
    },
    {
      "sentence": "At this time next month, the students will be building a presentation.",
      "verb": "building"
    },
    {
      "sentence": "Next year, she will be washing the bathroom.",
      "verb": "washing"
    },
    {
      "sentence": "The cat will be catching the frisbee next week.",
      "verb": "catching"
    },
    {
      "sentence": "Next month, i will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "Next year, the bird will be running in circles.",
      "verb": "running"
    },
    {
      "sentence": "My parents will be watching a show in two days.",
      "verb": "watching"
    },
    {
      "sentence": "Emma will be repairing the roof soon.",
      "verb": "repairing"
    },
    {
      "sentence": "I will be coming to the hospital next month.",
      "verb": "coming"
    },
    {
      "sentence": "Later, i will be drawing a picture.",
      "verb": "drawing"
    },
    {
      "sentence": "She will be emailing customer service soon.",
      "verb": "emailing"
    },
    {
      "sentence": "Next year, my parents will be cooking a salad.",
      "verb": "cooking"
    },
    {
      "sentence": "At this time soon, emma will be emailing the teacher.",
      "verb": "emailing"
    },
    {
      "sentence": "Next week, the cat will be playing in the park.",
      "verb": "playing"
    },
    {
      "sentence": "Tom will be baking a salad next week.",
      "verb": "baking"
    },
    {
      "sentence": "The bird will be running in the yard next week.",
      "verb": "running"
    },
    {
      "sentence": "At this time next month, the teacher will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "Next year, she will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "Next week, we will be speaking to my parents.",
      "verb": "speaking"
    },
    {
      "sentence": "At this time later, her sister will be building a presentation.",
      "verb": "building"
    },
    {
      "sentence": "Next week, i will be building an app.",
      "verb": "building"
    },
    {
      "sentence": "At this time later, the bird will be sleeping on the couch.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next month, emma will be going to the bank.",
      "verb": "going"
    },
    {
      "sentence": "They will be drinking a smoothie next week.",
      "verb": "drinking"
    },
    {
      "sentence": "Tomorrow, the team will be winning the update.",
      "verb": "winning"
    },
    {
      "sentence": "Next month, he will be painting a portrait.",
      "verb": "painting"
    },
    {
      "sentence": "At this time later, they will be giving a present.",
      "verb": "giving"
    },
    {
      "sentence": "At this time tonight, tom will be watching the match.",
      "verb": "watching"
    },
    {
      "sentence": "This evening, her sister will be running to the airport.",
      "verb": "running"
    },
    {
      "sentence": "At this time this weekend, he will be buying a new house.",
      "verb": "buying"
    },
    {
      "sentence": "This evening, the team will be releasing the championship.",
      "verb": "releasing"
    },
    {
      "sentence": "At this time next year, the students will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher will be making breakfast next week.",
      "verb": "making"
    },
    {
      "sentence": "My parents will be driving to school later.",
      "verb": "driving"
    },
    {
      "sentence": "Later, the bird will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "This evening, my parents will be preparing the contract.",
      "verb": "preparing"
    },
    {
      "sentence": "At this time next week, john will be preparing soup.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog will be chasing the mouse this evening.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time next month, the children will be designing a plan.",
      "verb": "designing"
    },
    {
      "sentence": "Next month, the bird will be chasing the mouse.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend will be studying for the exam next week.",
      "verb": "studying"
    },
    {
      "sentence": "Soon, he will be speaking to the boss.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird will be catching the toy tomorrow.",
      "verb": "catching"
    },
    {
      "sentence": "He will be selling the keys tomorrow.",
      "verb": "selling"
    },
    {
      "sentence": "At this time tonight, my parents will be organizing the house.",
      "verb": "organizing"
    },
    {
      "sentence": "We will be playing video games soon.",
      "verb": "playing"
    },
    {
      "sentence": "My friend will be having a salad this weekend.",
      "verb": "having"
    },
    {
      "sentence": "The cat will be eating its food next month.",
      "verb": "eating"
    },
    {
      "sentence": "The students will be speaking with my parents next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tonight, the children will be listening to a song.",
      "verb": "listening"
    },
    {
      "sentence": "Next week, my friend will be starting the email.",
      "verb": "starting"
    },
    {
      "sentence": "At this time this evening, emma will be sketching a diagram.",
      "verb": "sketching"
    },
    {
      "sentence": "Our neighbors will be reviewing English next year.",
      "verb": "reviewing"
    },
    {
      "sentence": "Next week, we will be preparing a meal.",
      "verb": "preparing"
    },
    {
      "sentence": "They will be watching a movie next week.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah will be seeing the manager this weekend.",
      "verb": "seeing"
    },
    {
      "sentence": "At this time this weekend, emma will be cleaning the room.",
      "verb": "cleaning"
    },
    {
      "sentence": "My friend will be teaching mathematics in two days.",
      "verb": "teaching"
    },
    {
      "sentence": "At this time next week, the manager will be listening to a podcast.",
      "verb": "listening"
    },
    {
      "sentence": "Tonight, emma will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "At this time next month, the dog will be chasing the squirrel.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time later, the dog will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "At this time tonight, my parents will be finishing the contract.",
      "verb": "finishing"
    },
    {
      "sentence": "At this time in two days, the cat will be chasing its tail.",
      "verb": "chasing"
    },
    {
      "sentence": "At this time soon, tom will be making dinner.",
      "verb": "making"
    },
    {
      "sentence": "At this time tonight, my parents will be building a project.",
      "verb": "building"
    },
    {
      "sentence": "Next week, my friend will be meeting the neighbors.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat will be playing with the toy next year.",
      "verb": "playing"
    },
    {
      "sentence": "Next week, we will be texting the office.",
      "verb": "texting"
    },
    {
      "sentence": "At this time tonight, the manager will be listening to the lecture.",
      "verb": "listening"
    },
    {
      "sentence": "They will be calling my friend tomorrow.",
      "verb": "calling"
    },
    {
      "sentence": "Next month, the children will be completing the application.",
      "verb": "completing"
    },
    {
      "sentence": "Tomorrow, her sister will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time soon, the dog will be catching a butterfly.",
      "verb": "catching"
    },
    {
      "sentence": "We will be considering the vacation tonight.",
      "verb": "considering"
    },
    {
      "sentence": "At this time later, they will be deciding on the vacation.",
      "verb": "deciding"
    },
    {
      "sentence": "At this time this weekend, the bird will be sleeping on the bed.",
      "verb": "sleeping"
    },
    {
      "sentence": "At this time soon, she will be designing a house.",
      "verb": "designing"
    },
    {
      "sentence": "At this time tonight, the cat will be playing with its owner.",
      "verb": "playing"
    },
    {
      "sentence": "At this time next week, the bird will be eating quickly.",
      "verb": "eating"
    },
    {
      "sentence": "The manager will be arriving to the library next year.",
      "verb": "arriving"
    },
    {
      "sentence": "Later, the cat will be playing with the toy.",
      "verb": "playing"
    },
    {
      "sentence": "Next year, he will be watching a series.",
      "verb": "watching"
    },
    {
      "sentence": "Emma will be arriving to the library this evening.",
      "verb": "arriving"
    },
    {
      "sentence": "Tonight, we will be having pizza.",
      "verb": "having"
    },
    {
      "sentence": "The bird will be eating a treat next year.",
      "verb": "eating"
    },
    {
      "sentence": "They will be learning the textbook next year.",
      "verb": "learning"
    },
    {
      "sentence": "At this time soon, my parents will be drinking water.",
      "verb": "drinking"
    },
    {
      "sentence": "The students will be playing the piano soon.",
      "verb": "playing"
    },
    {
      "sentence": "The dog will be sleeping all day tomorrow.",
      "verb": "sleeping"
    },
    {
      "sentence": "Next week, tom will be meeting the doctor.",
      "verb": "meeting"
    },
    {
      "sentence": "Next year, our neighbors will be meeting the teacher.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah will be painting a portrait next week.",
      "verb": "painting"
    },
    {
      "sentence": "Tomorrow, our neighbors will be watching a movie.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this evening, my parents will be finishing the presentation.",
      "verb": "finishing"
    },
    {
      "sentence": "You will be creating a model soon.",
      "verb": "creating"
    },
    {
      "sentence": "He will be eating breakfast tonight.",
      "verb": "eating"
    },
    {
      "sentence": "He will be painting an illustration later.",
      "verb": "painting"
    },
    {
      "sentence": "My parents will be playing video games this weekend.",
      "verb": "playing"
    },
    {
      "sentence": "Later, her sister will be speaking with a colleague.",
      "verb": "speaking"
    },
    {
      "sentence": "This evening, my brother will be choosing groceries.",
      "verb": "choosing"
    },
    {
      "sentence": "Later, the company will be announcing the deal.",
      "verb": "announcing"
    },
    {
      "sentence": "My friend will be considering the event this weekend.",
      "verb": "considering"
    },
    {
      "sentence": "John will be repairing the bike in two days.",
      "verb": "repairing"
    },
    {
      "sentence": "In two days, the students will be repairing the sink.",
      "verb": "repairing"
    },
    {
      "sentence": "At this time next month, my friend will be giving a new car.",
      "verb": "giving"
    },
    {
      "sentence": "At this time later, i will be visiting my grandmother.",
      "verb": "visiting"
    },
    {
      "sentence": "At this time tonight, our neighbors will be preparing rice.",
      "verb": "preparing"
    },
    {
      "sentence": "Tomorrow, the dog will be catching the toy.",
      "verb": "catching"
    },
    {
      "sentence": "The children will be talking to the neighbors tonight.",
      "verb": "talking"
    },
    {
      "sentence": "Next year, my brother will be contacting the office.",
      "verb": "contacting"
    },
    {
      "sentence": "The bird will be sleeping under the table this evening.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children will be fixing the sink tonight.",
      "verb": "fixing"
    },
    {
      "sentence": "At this time next year, the manager will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "This weekend, the bird will be chasing the ball.",
      "verb": "chasing"
    },
    {
      "sentence": "Tomorrow, the students will be writing the contract.",
      "verb": "writing"
    },
    {
      "sentence": "In two days, the manager will be watching the game.",
      "verb": "watching"
    },
    {
      "sentence": "At this time this weekend, you will be coming to work.",
      "verb": "coming"
    },
    {
      "sentence": "In two days, the dog will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Later, we will be fixing the door.",
      "verb": "fixing"
    },
    {
      "sentence": "Our neighbors will be cleaning the house tonight.",
      "verb": "cleaning"
    },
    {
      "sentence": "Next week, my brother will be emailing the manager.",
      "verb": "emailing"
    },
    {
      "sentence": "Later, we will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Tomorrow, her sister will be emailing the team.",
      "verb": "emailing"
    },
    {
      "sentence": "At this time next month, you will be drinking some water.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time this weekend, the dog will be sleeping in the corner.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tonight, tom will be drinking coffee.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time this evening, my brother will be playing video games.",
      "verb": "playing"
    },
    {
      "sentence": "At this time this evening, my friend will be baking lunch.",
      "verb": "baking"
    },
    {
      "sentence": "This weekend, john will be playing the piano.",
      "verb": "playing"
    },
    {
      "sentence": "Next month, you will be drinking milk.",
      "verb": "drinking"
    },
    {
      "sentence": "At this time next month, my friend will be planning the event.",
      "verb": "planning"
    },
    {
      "sentence": "Tonight, the teacher will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog will be eating quickly this evening.",
      "verb": "eating"
    },
    {
      "sentence": "Tomorrow, the cat will be running in the garden.",
      "verb": "running"
    },
    {
      "sentence": "At this time this weekend, the bird will be sleeping all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team will be announcing the results later.",
      "verb": "announcing"
    },
    {
      "sentence": "Tonight, my brother will be having a meal.",
      "verb": "having"
    },
    {
      "sentence": "Next month, i will be organizing the car.",
      "verb": "organizing"
    },
    {
      "sentence": "Later, the students will be drinking tea.",
      "verb": "drinking"
    },
    {
      "sentence": "Soon, the dog will be catching the mouse.",
      "verb": "catching"
    },
    {
      "sentence": "Next week, her sister will be finding a present.",
      "verb": "finding"
    },
    {
      "sentence": "This weekend, the bird will be eating the leftover food.",
      "verb": "eating"
    },
    {
      "sentence": "Soon, her sister will be giving the keys.",
      "verb": "giving"
    },
    {
      "sentence": "In two days, the team will be announcing the contract.",
      "verb": "announcing"
    },
    {
      "sentence": "My friend will be driving to the bank later.",
      "verb": "driving"
    },
    {
      "sentence": "At this time in two days, her sister will be listening to classical music.",
      "verb": "listening"
    },
    {
      "sentence": "The dog will be catching a butterfly this weekend.",
      "verb": "catching"
    },
    {
      "sentence": "The company will be winning the contract in two days.",
      "verb": "winning"
    }
  ]
}