{
  "tense": "Past Perfect Continuous",
  "description": "Used for actions that were ongoing before another past action",
  "examples": [
    {
      "sentence": "The cat had been running in the garden for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors had been meeting my grandmother since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah had been building an app all week.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the children had been having dinner for a month.",
      "verb": "having"
    },
    {
      "sentence": "The bird had been running through the grass all week.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been catching the ball before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "We had been repairing the computer all day.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the manager had been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been sleeping by the window before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, you had been getting the phone since this morning.",
      "verb": "getting"
    },
    {
      "sentence": "The dog had been running around the house since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the bird had been playing with the toy for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, sarah had been organizing the dishes for a month.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird had been chasing the other pets for years.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the manager had been selling the keys since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "Our neighbors had been running to the store before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "They had been forgetting the meeting all day.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tom had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been sleeping on the couch for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the dog had been catching the mouse all day.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, she had been meeting my parents since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird had been playing with the ball since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the dog had been eating some food all week.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah had been arriving to the airport before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "He had been watching TV before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "He had been forgetting the situation for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the manager had been reading vocabulary since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "The students had been fixing the sink for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird had been playing with the other pets before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been listening to the lecture since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been emailing the doctor before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, my brother had been cleaning the office for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the dog had been chasing the squirrel all day.",
      "verb": "chasing"
    },
    {
      "sentence": "John had been giving a new car for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "Tom had been watching football before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "My parents had been making cookies for two hours.",
      "verb": "making"
    },
    {
      "sentence": "The cat had been chasing birds in the garden for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "I had been meeting the teacher all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the manager had been drinking milk since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "We had been preparing a meal before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog had been chasing the ball before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents had been having some fruit for three days.",
      "verb": "having"
    },
    {
      "sentence": "The cat had been chasing the mouse since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, i had been reviewing English all day.",
      "verb": "reviewing"
    },
    {
      "sentence": "My brother had been visiting the doctor before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog had been sleeping on the couch before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "The manager had been drinking juice before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the children had been playing volleyball all day.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been washing the office before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "The dog had been catching a treat since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the dog had been eating its food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, tom had been watching the match for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The students had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "My brother had been teaching history before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, the children had been playing soccer for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my parents had been making a meal since this morning.",
      "verb": "making"
    },
    {
      "sentence": "My friend had been fixing the computer all day.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the dog had been catching a bird for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, they had been organizing the bathroom since Monday.",
      "verb": "organizing"
    },
    {
      "sentence": "Tom had been calling my friend before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "I had been seeing the team before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "Sarah had been calling my friend before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "Sarah had been painting a landscape before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "My friend had been arriving to the hospital since yesterday.",
      "verb": "arriving"
    },
    {
      "sentence": "Emma had been practicing mathematics before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the students had been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been running across the field for a month.",
      "verb": "running"
    },
    {
      "sentence": "They had been fixing the door before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the cat had been playing in the yard all week.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been drinking some water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The students had been washing the dishes before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "The children had been repairing the bike before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat had been catching the toy for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "My friend had been reading the lesson for a month.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, my friend had been visiting the doctor since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "Sarah had been finding the ticket before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, the manager had been remembering the plan since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, you had been organizing the room for a month.",
      "verb": "organizing"
    },
    {
      "sentence": "The cat had been playing with the ball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The cat had been catching a bird since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah had been drinking milk before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, he had been learning English for two hours.",
      "verb": "learning"
    },
    {
      "sentence": "My friend had been playing volleyball since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, tom had been listening to jazz for a week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, tom had been listening to a podcast for years.",
      "verb": "listening"
    },
    {
      "sentence": "The dog had been catching the mouse for years.",
      "verb": "catching"
    },
    {
      "sentence": "The manager had been preparing the application all week.",
      "verb": "preparing"
    },
    {
      "sentence": "Tom had been making rice since this morning.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the students had been driving to the office since this morning.",
      "verb": "driving"
    },
    {
      "sentence": "She had been watching a video before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, i had been visiting my parents for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "They had been traveling to the office before the meeting.",
      "verb": "traveling"
    },
    {
      "sentence": "Tom had been running to the library before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the cat had been catching a butterfly all week.",
      "verb": "catching"
    },
    {
      "sentence": "They had been organizing the bathroom before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "You had been cooking soup before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, my friend had been teaching the textbook since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, emma had been baking a salad since yesterday.",
      "verb": "baking"
    },
    {
      "sentence": "They had been buying a present before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The bird had been eating the leftover food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been listening to the radio before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The children had been forgetting the trip since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend had been giving a new house all week.",
      "verb": "giving"
    },
    {
      "sentence": "Our neighbors had been listening to the lecture before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "My friend had been cleaning the room for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister had been playing volleyball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been visiting the manager before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "I had been repairing the computer before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the bird had been catching a treat since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher had been remembering the plan before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, her sister had been creating a presentation all day.",
      "verb": "creating"
    },
    {
      "sentence": "The manager had been listening to classical music all day.",
      "verb": "listening"
    },
    {
      "sentence": "We had been talking to my parents since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the cat had been playing with the ball for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the students had been returning to work for years.",
      "verb": "returning"
    },
    {
      "sentence": "They had been tidying the house before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the cat had been chasing the squirrel for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "The students had been speaking to the client for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird had been catching a treat before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "She had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, sarah had been listening to the news all week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been catching the mouse all week.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the dog had been catching the frisbee for a month.",
      "verb": "catching"
    },
    {
      "sentence": "The cat had been running in circles all week.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been sleeping under the table all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors had been listening to a song for a month.",
      "verb": "listening"
    },
    {
      "sentence": "My parents had been returning downtown all day.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, you had been having a meal since Monday.",
      "verb": "having"
    },
    {
      "sentence": "The dog had been catching the mouse all day.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher had been repairing the fence all day.",
      "verb": "repairing"
    },
    {
      "sentence": "They had been reviewing the lesson since this morning.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the teacher had been buying a new car all week.",
      "verb": "buying"
    },
    {
      "sentence": "The bird had been playing in the yard since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been starting the project before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The dog had been catching a treat for a month.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the teacher had been traveling to the airport for years.",
      "verb": "traveling"
    },
    {
      "sentence": "By noon, tom had been drinking some water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "You had been creating a prototype before the meeting.",
      "verb": "creating"
    },
    {
      "sentence": "They had been meeting the manager all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, sarah had been drawing a landscape for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, our neighbors had been drinking water since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my parents had been playing chess since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "John had been drinking coffee before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "We had been reading science before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The manager had been eating some fruit all week.",
      "verb": "eating"
    },
    {
      "sentence": "John had been fixing the door before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the dog had been sleeping on the bed all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children had been playing volleyball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "John had been visiting the doctor before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, my parents had been cleaning the kitchen for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, my friend had been texting the client for two hours.",
      "verb": "texting"
    },
    {
      "sentence": "The cat had been eating the leftover food for years.",
      "verb": "eating"
    },
    {
      "sentence": "We had been playing video games before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been sleeping in the sun for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team had been winning the software before the meeting.",
      "verb": "winning"
    },
    {
      "sentence": "My brother had been selling the keys before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, my parents had been teaching Spanish all week.",
      "verb": "teaching"
    },
    {
      "sentence": "The manager had been tidying the office before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "Tom had been washing the house before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "Her sister had been designing a plan before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the dog had been catching the mouse for a month.",
      "verb": "catching"
    },
    {
      "sentence": "They had been preparing breakfast before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the dog had been playing in the park since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been reading French for years.",
      "verb": "reading"
    },
    {
      "sentence": "My parents had been walking to work before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, he had been baking a cake for years.",
      "verb": "baking"
    },
    {
      "sentence": "My brother had been building an app for a week.",
      "verb": "building"
    },
    {
      "sentence": "She had been creating a house since this morning.",
      "verb": "creating"
    },
    {
      "sentence": "The dog had been eating its food for years.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, we had been finding some clothes since this morning.",
      "verb": "finding"
    },
    {
      "sentence": "The manager had been drinking some water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the manager had been going to the bank all day.",
      "verb": "going"
    },
    {
      "sentence": "Tom had been practicing Spanish before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat had been chasing its tail all week.",
      "verb": "chasing"
    },
    {
      "sentence": "John had been cooking breakfast before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, my parents had been building a presentation for years.",
      "verb": "building"
    },
    {
      "sentence": "The dog had been eating some food since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, i had been forgetting the situation since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, sarah had been finishing the letter since yesterday.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager had been playing guitar since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, tom had been cleaning the bathroom since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, i had been tidying the garage for two hours.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, sarah had been building a prototype all day.",
      "verb": "building"
    },
    {
      "sentence": "The company had been releasing a new product since yesterday.",
      "verb": "releasing"
    },
    {
      "sentence": "My brother had been submitting the project for two hours.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, my friend had been cleaning the bathroom all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "John had been calling my parents all week.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been emailing my friend for three days.",
      "verb": "emailing"
    },
    {
      "sentence": "The teacher had been drinking a smoothie since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "The company had been launching the championship for two hours.",
      "verb": "launching"
    },
    {
      "sentence": "She had been drinking some water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been chasing the ball since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog had been catching the ball for three days.",
      "verb": "catching"
    },
    {
      "sentence": "The bird had been sleeping in the corner before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors had been repairing the car for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah had been emailing my family for years.",
      "verb": "emailing"
    },
    {
      "sentence": "My friend had been drawing a design before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, john had been eating lunch for a month.",
      "verb": "eating"
    },
    {
      "sentence": "They had been preparing pasta for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog had been chasing its tail before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my brother had been painting an illustration since this morning.",
      "verb": "painting"
    },
    {
      "sentence": "John had been meeting the client for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat had been running in the garden since Monday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the teacher had been seeing the manager for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "You had been completing the project since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "My friend had been repairing the sink since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, john had been preparing breakfast all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma had been arriving to the bank for years.",
      "verb": "arriving"
    },
    {
      "sentence": "John had been baking a meal since this morning.",
      "verb": "baking"
    },
    {
      "sentence": "John had been planning the decision all day.",
      "verb": "planning"
    },
    {
      "sentence": "The cat had been catching the frisbee before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "My brother had been listening to classical music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "We had been sketching the wall before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "The dog had been playing in the yard for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my brother had been driving to the library for years.",
      "verb": "driving"
    },
    {
      "sentence": "The manager had been speaking with the boss for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the company had been releasing a new product all day.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, my parents had been running to the store since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "The students had been speaking to the team before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "John had been painting a poster before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "The dog had been chasing the mouse before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents had been emailing the manager for two hours.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, the teacher had been playing basketball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, they had been selling the ticket for a month.",
      "verb": "selling"
    },
    {
      "sentence": "Tom had been visiting the client since this morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog had been sleeping on the couch for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "The teacher had been calling customer service since this morning.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the cat had been chasing the toy for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the teacher had been playing basketball for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been meeting the manager all day.",
      "verb": "meeting"
    },
    {
      "sentence": "My friend had been talking to a colleague before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the dog had been running in the yard for a month.",
      "verb": "running"
    },
    {
      "sentence": "By noon, our neighbors had been talking to the manager for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the manager had been preparing the presentation all week.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog had been sleeping in the corner before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the bird had been eating a treat for a month.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the bird had been playing with the ball all day.",
      "verb": "playing"
    },
    {
      "sentence": "John had been drinking tea before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, our neighbors had been washing the house for years.",
      "verb": "washing"
    },
    {
      "sentence": "Our neighbors had been talking to the boss before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "The students had been playing chess for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the teacher had been returning to the office for three days.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the students had been repairing the computer for years.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, they had been designing a presentation for a week.",
      "verb": "designing"
    },
    {
      "sentence": "My parents had been forgetting the future all day.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, you had been emailing the boss for three days.",
      "verb": "emailing"
    },
    {
      "sentence": "You had been having a snack for three days.",
      "verb": "having"
    },
    {
      "sentence": "Emma had been watching the match for a month.",
      "verb": "watching"
    },
    {
      "sentence": "They had been getting the ticket before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, my brother had been meeting an old friend for two hours.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, they had been writing the task for a week.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the children had been listening to a song for a week.",
      "verb": "listening"
    },
    {
      "sentence": "John had been reading the material since this morning.",
      "verb": "reading"
    },
    {
      "sentence": "My friend had been texting the team before the meeting.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the bird had been sleeping by the window all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog had been playing in the garden before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been catching the ball since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "They had been having soup before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "The teacher had been listening to music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, sarah had been tidying the dishes since yesterday.",
      "verb": "tidying"
    },
    {
      "sentence": "My parents had been painting a poster before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "The bird had been running across the field before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, my brother had been baking lunch for two hours.",
      "verb": "baking"
    },
    {
      "sentence": "I had been driving to the park since Monday.",
      "verb": "driving"
    },
    {
      "sentence": "The cat had been sleeping on the bed since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, he had been playing guitar since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "The team had been announcing the deal for a week.",
      "verb": "announcing"
    },
    {
      "sentence": "He had been playing video games before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the children had been contacting my parents all week.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the students had been starting the application since this morning.",
      "verb": "starting"
    },
    {
      "sentence": "The bird had been chasing the mouse for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents had been emailing the manager before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "My parents had been sketching the wall before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "The children had been drawing a diagram since Monday.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the students had been selling a book since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "You had been getting the phone for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "The bird had been playing with the ball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been chasing its tail for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager had been meeting the client for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom had been drinking water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "We had been finishing the assignment before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the students had been fixing the car since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the cat had been running in circles for years.",
      "verb": "running"
    },
    {
      "sentence": "You had been sketching a design before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister had been building a house before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The manager had been drawing a portrait before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, emma had been cleaning the kitchen for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "My parents had been calling my friend before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher had been contacting the client for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "My friend had been visiting the manager before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the teacher had been emailing my friend for two hours.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, john had been tidying the clothes all week.",
      "verb": "tidying"
    },
    {
      "sentence": "Tom had been playing chess before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "He had been playing chess since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "You had been speaking with a colleague for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the students had been tidying the room since yesterday.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the dog had been running in the yard for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the teacher had been designing a project since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, they had been preparing a meal since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, sarah had been speaking with a colleague for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "We had been watching the match all day.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the manager had been drinking a smoothie for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister had been watching a documentary before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The children had been calling the teacher before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "Tom had been drawing a diagram before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "The students had been eating pasta before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been selling some clothes before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The company had been developing a new product all day.",
      "verb": "developing"
    },
    {
      "sentence": "The children had been reviewing grammar before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "The children had been making pasta for a week.",
      "verb": "making"
    },
    {
      "sentence": "The bird had been catching the mouse all week.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, her sister had been cooking soup for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend had been visiting my parents all week.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the dog had been running across the field for three days.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been playing in the yard before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "You had been baking a meal before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "The students had been watching TV before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been watching a video since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "They had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The children had been tidying the bathroom before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "The manager had been watching a video before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The dog had been chasing the toy before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog had been catching the frisbee since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "My friend had been sending the presentation since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "John had been tidying the room since Monday.",
      "verb": "tidying"
    },
    {
      "sentence": "The dog had been sleeping on the bed before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, emma had been playing golf for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been cooking cookies before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "John had been repairing the door for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, we had been designing an app for a week.",
      "verb": "designing"
    },
    {
      "sentence": "The students had been flying to the park before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, she had been talking to the professor for years.",
      "verb": "talking"
    },
    {
      "sentence": "She had been repairing the computer for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the manager had been visiting the team since this morning.",
      "verb": "visiting"
    },
    {
      "sentence": "We had been seeing an old friend before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "John had been reviewing science before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, she had been listening to a podcast for a month.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my parents had been deciding on the vacation for a week.",
      "verb": "deciding"
    },
    {
      "sentence": "The team had been launching a new product since Monday.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, the manager had been choosing a laptop since yesterday.",
      "verb": "choosing"
    },
    {
      "sentence": "The children had been reading history for three days.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been developing the results for three days.",
      "verb": "developing"
    },
    {
      "sentence": "By noon, they had been watching a show for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The manager had been listening to a song all week.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister had been returning to the library for years.",
      "verb": "returning"
    },
    {
      "sentence": "My friend had been designing a website before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the cat had been playing with the ball since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been tidying the dishes since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the students had been forgetting the situation for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "We had been playing golf before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "We had been texting the office for three days.",
      "verb": "texting"
    },
    {
      "sentence": "Sarah had been emailing my family before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "He had been calling the office since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, tom had been contacting the teacher since this morning.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the cat had been catching a bird for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, they had been fixing the door all week.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, our neighbors had been building a project since this morning.",
      "verb": "building"
    },
    {
      "sentence": "The bird had been sleeping in the sun since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog had been catching a butterfly since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "He had been watching the match for a week.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher had been coming to the store all week.",
      "verb": "coming"
    },
    {
      "sentence": "Our neighbors had been washing the bathroom before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, we had been preparing a salad for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the dog had been chasing its tail all day.",
      "verb": "chasing"
    },
    {
      "sentence": "The team had been launching a new product for three days.",
      "verb": "launching"
    },
    {
      "sentence": "My parents had been playing video games for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been visiting my grandmother for years.",
      "verb": "visiting"
    },
    {
      "sentence": "Sarah had been buying a laptop before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "My friend had been baking a meal before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "The cat had been catching a bird since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the students had been playing tennis since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been reviewing the material for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird had been running across the field all day.",
      "verb": "running"
    },
    {
      "sentence": "My parents had been fixing the bike since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "John had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The company had been announcing the results for a month.",
      "verb": "announcing"
    },
    {
      "sentence": "I had been listening to a song for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Tom had been buying some clothes before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The manager had been coming to the office before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "By noon, the cat had been chasing the other pets since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "We had been texting the teacher before the meeting.",
      "verb": "texting"
    },
    {
      "sentence": "The cat had been playing with the toy since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been eating the leftover food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "We had been texting the teacher for three days.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the students had been eating pizza for years.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the students had been watching football for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "The team had been developing the project before the meeting.",
      "verb": "developing"
    },
    {
      "sentence": "The children had been flying to the library for a month.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher had been coming to work for a week.",
      "verb": "coming"
    },
    {
      "sentence": "We had been choosing a present before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "Her sister had been teaching English all day.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister had been playing volleyball since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been flying to the airport for three days.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, the dog had been chasing the mouse all week.",
      "verb": "chasing"
    },
    {
      "sentence": "He had been designing a model for a month.",
      "verb": "designing"
    },
    {
      "sentence": "Our neighbors had been making cookies before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "We had been fixing the car for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "They had been washing the kitchen before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "Emma had been designing an app before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "The cat had been catching a butterfly all week.",
      "verb": "catching"
    },
    {
      "sentence": "The children had been painting a design all day.",
      "verb": "painting"
    },
    {
      "sentence": "The bird had been playing in the garden before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "You had been organizing the clothes before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird had been eating its dinner for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The manager had been speaking to a colleague for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been going to the market for a week.",
      "verb": "going"
    },
    {
      "sentence": "He had been having a meal before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "They had been giving a new car all week.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the students had been listening to the lecture since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "I had been sending the report for two hours.",
      "verb": "sending"
    },
    {
      "sentence": "Our neighbors had been talking to my parents for a month.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, john had been completing the project for three days.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, you had been selling the keys for years.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, you had been driving downtown for three days.",
      "verb": "driving"
    },
    {
      "sentence": "Tom had been finding the phone before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "She had been buying flowers all day.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the children had been eating breakfast all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, she had been planning the birthday party for years.",
      "verb": "planning"
    },
    {
      "sentence": "The teacher had been drawing a landscape before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the children had been drinking coffee since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been catching a bird for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "Emma had been considering the decision all day.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, our neighbors had been playing basketball all day.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been meeting the client since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the team had been launching the contract for a month.",
      "verb": "launching"
    },
    {
      "sentence": "My parents had been watching football all week.",
      "verb": "watching"
    },
    {
      "sentence": "The children had been creating a presentation for a month.",
      "verb": "creating"
    },
    {
      "sentence": "Tom had been planning the trip since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, my parents had been fixing the fence for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog had been running in the garden for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the manager had been remembering the future since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, emma had been creating a model for a week.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the cat had been chasing its tail for years.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend had been listening to an audiobook before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, she had been fixing the door all day.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister had been drawing a diagram before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "They had been submitting the proposal before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "He had been listening to classical music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been organizing the bathroom before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "The students had been selling a laptop before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The children had been emailing the teacher for years.",
      "verb": "emailing"
    },
    {
      "sentence": "The dog had been playing with the other pets before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The company had been announcing the championship for three days.",
      "verb": "announcing"
    },
    {
      "sentence": "By noon, the teacher had been learning French for two hours.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, she had been watching a series since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been running in the park all day.",
      "verb": "running"
    },
    {
      "sentence": "The students had been playing video games before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "I had been practicing French before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat had been catching a treat all day.",
      "verb": "catching"
    },
    {
      "sentence": "The cat had been catching the toy before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "The team had been announcing the championship before the meeting.",
      "verb": "announcing"
    },
    {
      "sentence": "My parents had been arriving to the hospital for a week.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, john had been fixing the sink for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "The team had been launching the deal all week.",
      "verb": "launching"
    },
    {
      "sentence": "Tom had been repairing the machine for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors had been submitting the project before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "Our neighbors had been selling groceries before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the cat had been playing with the toy for years.",
      "verb": "playing"
    },
    {
      "sentence": "I had been repairing the sink before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the bird had been playing with its owner for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been catching the toy for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors had been listening to a podcast before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been sleeping in the sun for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The company had been developing the results before the meeting.",
      "verb": "developing"
    },
    {
      "sentence": "By noon, the teacher had been finding a book for years.",
      "verb": "finding"
    },
    {
      "sentence": "Our neighbors had been painting a diagram before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "Her sister had been sketching a design all day.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, the cat had been playing with the ball all day.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been running across the field before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Emma had been eating a salad before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the cat had been running through the grass all week.",
      "verb": "running"
    },
    {
      "sentence": "Tom had been playing tennis for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been running in the garden for years.",
      "verb": "running"
    },
    {
      "sentence": "The bird had been chasing the squirrel for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "I had been planning the decision before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "My friend had been tidying the car since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the cat had been eating a treat all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, he had been studying the lesson all week.",
      "verb": "studying"
    },
    {
      "sentence": "My friend had been fixing the roof before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "They had been repairing the sink for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors had been playing golf before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been learning mathematics before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, i had been playing golf for three days.",
      "verb": "playing"
    },
    {
      "sentence": "She had been finding the ticket before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, my friend had been building a website for three days.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors had been drinking milk before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been chasing the ball before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "The students had been making dinner before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the team had been launching the championship for two hours.",
      "verb": "launching"
    },
    {
      "sentence": "Her sister had been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher had been watching a video for a month.",
      "verb": "watching"
    },
    {
      "sentence": "I had been playing guitar since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my brother had been washing the clothes since this morning.",
      "verb": "washing"
    },
    {
      "sentence": "Our neighbors had been washing the house since Monday.",
      "verb": "washing"
    },
    {
      "sentence": "Sarah had been sketching a landscape for years.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister had been talking to my friend for a week.",
      "verb": "talking"
    },
    {
      "sentence": "He had been listening to music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, john had been playing the piano since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "The children had been visiting my parents since this morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The children had been making soup for two hours.",
      "verb": "making"
    },
    {
      "sentence": "My parents had been playing the piano all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, john had been preparing lunch all week.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, they had been texting the doctor for three days.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the cat had been eating its food all day.",
      "verb": "eating"
    },
    {
      "sentence": "She had been eating a salad before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister had been meeting the team before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "We had been considering the trip before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the dog had been sleeping by the window for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "We had been speaking to the client since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors had been watching a movie for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the children had been texting my family for three days.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, my friend had been building a website since yesterday.",
      "verb": "building"
    },
    {
      "sentence": "The manager had been watching a series before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher had been drinking water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my friend had been forgetting the future all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend had been playing video games before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been tidying the office for a week.",
      "verb": "tidying"
    },
    {
      "sentence": "They had been painting the wall since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the cat had been playing in the garden for years.",
      "verb": "playing"
    },
    {
      "sentence": "John had been tidying the office before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "The students had been meeting my family before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog had been running in the park before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "You had been washing the office before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "The manager had been starting the project before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, he had been repairing the sink for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "We had been meeting the manager before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "I had been organizing the garage all day.",
      "verb": "organizing"
    },
    {
      "sentence": "We had been finding a new car since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "My parents had been playing volleyball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been practicing the chapter for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, you had been completing the email for a week.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the bird had been playing in the garden all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been sketching an illustration for years.",
      "verb": "sketching"
    },
    {
      "sentence": "The students had been making cookies since Monday.",
      "verb": "making"
    },
    {
      "sentence": "By noon, they had been eating pizza for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the cat had been sleeping by the window for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog had been chasing its tail since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the dog had been playing in the garden since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister had been speaking to the manager before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the teacher had been watching a video for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The dog had been playing in the park before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been emailing my friend before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "We had been seeing the manager since Monday.",
      "verb": "seeing"
    },
    {
      "sentence": "He had been organizing the garage since yesterday.",
      "verb": "organizing"
    },
    {
      "sentence": "By noon, the children had been repairing the machine all week.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma had been baking a salad for a month.",
      "verb": "baking"
    },
    {
      "sentence": "Our neighbors had been drinking milk since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, her sister had been getting some clothes for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, we had been watching the game since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "They had been drinking tea before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird had been eating its dinner before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Emma had been painting a diagram for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, i had been contacting the team for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "They had been seeing the teacher for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "By noon, i had been watching the news since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been catching a butterfly for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Emma had been having lunch before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "By noon, our neighbors had been contacting the manager for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the students had been practicing French for a week.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, my parents had been having dinner for a week.",
      "verb": "having"
    },
    {
      "sentence": "By noon, my brother had been visiting the neighbors since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the students had been seeing the team for years.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird had been running in the park before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Her sister had been completing the project since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "My brother had been speaking with my family since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "She had been speaking with the client before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat had been running in circles before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the manager had been preparing a meal since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, her sister had been leaving to the park since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "You had been repairing the fence for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher had been fixing the car before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents had been buying flowers before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The cat had been chasing the other pets before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat had been playing in the park since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "They had been playing the piano for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been playing with the ball for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The students had been repairing the bike for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, emma had been walking home for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "My brother had been visiting an old friend before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the dog had been playing with its owner since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, sarah had been sending the contract since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, my brother had been painting a picture all week.",
      "verb": "painting"
    },
    {
      "sentence": "I had been having a meal before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "The children had been playing tennis before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the dog had been catching the frisbee all week.",
      "verb": "catching"
    },
    {
      "sentence": "John had been learning vocabulary before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "They had been listening to a podcast before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "They had been organizing the bathroom all day.",
      "verb": "organizing"
    },
    {
      "sentence": "By noon, sarah had been meeting an old friend since Monday.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, john had been painting a poster all week.",
      "verb": "painting"
    },
    {
      "sentence": "The team had been launching the contract before the meeting.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, they had been meeting my parents since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom had been listening to classical music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the teacher had been painting a portrait for years.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, sarah had been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "They had been sending the presentation for a month.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, emma had been preparing soup for years.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, we had been fixing the sink since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog had been chasing the toy for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "We had been speaking with my family before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The team had been winning the championship since this morning.",
      "verb": "winning"
    },
    {
      "sentence": "By noon, the bird had been catching a treat for a month.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, my brother had been drinking coffee since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, emma had been baking soup all week.",
      "verb": "baking"
    },
    {
      "sentence": "She had been watching the match before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been playing with the other pets all week.",
      "verb": "playing"
    },
    {
      "sentence": "The manager had been choosing a new car before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "Tom had been watching a show since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, my parents had been repairing the fence since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "The company had been announcing the results before the meeting.",
      "verb": "announcing"
    },
    {
      "sentence": "Tom had been talking to my family since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "Sarah had been submitting the letter before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "The children had been playing soccer since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, we had been speaking to the boss since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents had been listening to a podcast before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "She had been washing the bathroom before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "I had been talking to the neighbors since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, he had been speaking to a colleague all day.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, my parents had been organizing the kitchen for two hours.",
      "verb": "organizing"
    },
    {
      "sentence": "Our neighbors had been meeting an old friend for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the team had been winning the championship all week.",
      "verb": "winning"
    },
    {
      "sentence": "By noon, the teacher had been watching TV since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been catching a treat before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "My brother had been repairing the computer for years.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, our neighbors had been selling groceries since this morning.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the manager had been designing a project since this morning.",
      "verb": "designing"
    },
    {
      "sentence": "The bird had been sleeping all day before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children had been watching the game for three days.",
      "verb": "watching"
    },
    {
      "sentence": "They had been fixing the sink since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "They had been cooking pasta before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "They had been speaking with a colleague since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "She had been writing the application since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "The cat had been sleeping under the table since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, she had been walking to work since this morning.",
      "verb": "walking"
    },
    {
      "sentence": "Emma had been visiting the doctor all day.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird had been catching the toy all day.",
      "verb": "catching"
    },
    {
      "sentence": "The bird had been running in the yard for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, my parents had been getting the ticket all week.",
      "verb": "getting"
    },
    {
      "sentence": "The manager had been cleaning the dishes since yesterday.",
      "verb": "cleaning"
    },
    {
      "sentence": "He had been seeing the manager before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "By noon, you had been having pizza since this morning.",
      "verb": "having"
    },
    {
      "sentence": "John had been choosing groceries all week.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, john had been completing the email all week.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the dog had been chasing the other pets since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "They had been deciding on the vacation all day.",
      "verb": "deciding"
    },
    {
      "sentence": "By noon, they had been remembering the trip since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, my parents had been finishing the contract all day.",
      "verb": "finishing"
    },
    {
      "sentence": "He had been speaking with my family since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Emma had been drinking some water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager had been preparing the contract all week.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma had been building a prototype all week.",
      "verb": "building"
    },
    {
      "sentence": "Emma had been speaking to the boss since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "They had been drinking tea for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been drinking juice all day.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, they had been washing the bathroom since this morning.",
      "verb": "washing"
    },
    {
      "sentence": "The children had been repairing the roof before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "She had been painting the wall since this morning.",
      "verb": "painting"
    },
    {
      "sentence": "Emma had been finding the phone before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, the bird had been chasing the toy for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, her sister had been planning the situation for a week.",
      "verb": "planning"
    },
    {
      "sentence": "I had been fixing the fence before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, i had been understanding grammar for years.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, we had been buying a present since this morning.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the dog had been eating the leftover food all week.",
      "verb": "eating"
    },
    {
      "sentence": "The children had been understanding vocabulary since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "My brother had been reviewing science before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the dog had been running in the park for three days.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been eating the leftover food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the teacher had been speaking with the manager for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "Sarah had been making dinner all day.",
      "verb": "making"
    },
    {
      "sentence": "By noon, she had been finding the phone since yesterday.",
      "verb": "finding"
    },
    {
      "sentence": "He had been sketching a landscape for three days.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, you had been drinking coffee for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been chasing the squirrel for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "The company had been winning the update since Monday.",
      "verb": "winning"
    },
    {
      "sentence": "The students had been calling the teacher before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, she had been repairing the machine for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the bird had been chasing the squirrel for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "The students had been studying French since yesterday.",
      "verb": "studying"
    },
    {
      "sentence": "Emma had been playing golf before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been watching a series since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The manager had been forgetting the decision before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah had been sketching a poster since this morning.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, the bird had been chasing its tail all day.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The students had been watching football before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The company had been releasing the results for three days.",
      "verb": "releasing"
    },
    {
      "sentence": "The students had been flying to the store before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "Her sister had been painting a picture all week.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, they had been drinking juice since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The company had been releasing the software for two hours.",
      "verb": "releasing"
    },
    {
      "sentence": "They had been building a project since yesterday.",
      "verb": "building"
    },
    {
      "sentence": "By noon, her sister had been having pizza since yesterday.",
      "verb": "having"
    },
    {
      "sentence": "By noon, she had been repairing the door for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "John had been having lunch all day.",
      "verb": "having"
    },
    {
      "sentence": "Her sister had been flying to the library since Monday.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, the students had been watching TV for a month.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, john had been drinking some water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been chasing the toy for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors had been watching the news for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "The children had been visiting my friend since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "John had been forgetting the future before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "They had been speaking with the doctor all week.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, her sister had been leaving to work for three days.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the cat had been chasing the toy since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the bird had been catching the toy for years.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the cat had been playing with the toy for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the students had been calling my friend for three days.",
      "verb": "calling"
    },
    {
      "sentence": "Emma had been having pasta all day.",
      "verb": "having"
    },
    {
      "sentence": "By noon, our neighbors had been cleaning the house all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The children had been drinking a smoothie since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird had been eating its breakfast since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "I had been drinking milk before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been going to school all day.",
      "verb": "going"
    },
    {
      "sentence": "By noon, my brother had been meeting my friend for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "The teacher had been receiving the task for years.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah had been writing the email for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, you had been repairing the sink since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "The children had been tidying the bathroom for years.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, her sister had been organizing the room for two hours.",
      "verb": "organizing"
    },
    {
      "sentence": "The manager had been tidying the kitchen for three days.",
      "verb": "tidying"
    },
    {
      "sentence": "I had been forgetting the problem before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tom had been teaching the lesson all day.",
      "verb": "teaching"
    },
    {
      "sentence": "My brother had been painting a picture for years.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the bird had been catching the ball for years.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the company had been launching the results for two hours.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, my friend had been planning the options for a month.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, tom had been playing guitar since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been considering the future since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "We had been watching a documentary for a month.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah had been contacting my parents for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the dog had been catching the ball for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Emma had been watching football before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, tom had been repairing the roof for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the dog had been catching a butterfly all week.",
      "verb": "catching"
    },
    {
      "sentence": "The bird had been running in circles before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "She had been tidying the dishes for three days.",
      "verb": "tidying"
    },
    {
      "sentence": "I had been sketching a poster since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, the dog had been chasing the squirrel since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "We had been creating a project for a month.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the company had been completing the update all day.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the dog had been catching a bird since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, my brother had been sketching a picture since this morning.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, my brother had been selling the keys since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "They had been painting a design before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, they had been watching a show all day.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been organizing the dishes before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "The students had been receiving the email since Monday.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents had been sending the project for three days.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, the manager had been drinking water for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, i had been painting a diagram for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "The dog had been chasing its tail all week.",
      "verb": "chasing"
    },
    {
      "sentence": "My brother had been making pasta before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the cat had been running in the park for three days.",
      "verb": "running"
    },
    {
      "sentence": "She had been planning the decision since this morning.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, i had been drawing an illustration all day.",
      "verb": "drawing"
    },
    {
      "sentence": "They had been painting a picture all week.",
      "verb": "painting"
    },
    {
      "sentence": "The cat had been eating some food all day.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the cat had been sleeping on the couch since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "You had been seeing the client before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "By noon, tom had been calling my friend since Monday.",
      "verb": "calling"
    },
    {
      "sentence": "He had been sketching a poster for years.",
      "verb": "sketching"
    },
    {
      "sentence": "The company had been completing the championship before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "The bird had been running in the park all day.",
      "verb": "running"
    },
    {
      "sentence": "The dog had been sleeping by the window before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah had been drinking juice since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "John had been having a snack all day.",
      "verb": "having"
    },
    {
      "sentence": "The dog had been running through the grass before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the dog had been sleeping by the window all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "We had been considering the options for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "The dog had been eating its food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The bird had been catching the ball since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the bird had been playing with the other pets since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, emma had been listening to a podcast for three days.",
      "verb": "listening"
    },
    {
      "sentence": "My brother had been giving a laptop for three days.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the cat had been running across the field since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been playing with its owner before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, emma had been listening to the lecture all week.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors had been painting a portrait before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "We had been baking rice before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "The teacher had been speaking to the teacher before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, her sister had been completing the contract since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, our neighbors had been tidying the garage for a week.",
      "verb": "tidying"
    },
    {
      "sentence": "The manager had been drawing a diagram before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "My brother had been speaking to the doctor before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, my parents had been sketching a poster for a month.",
      "verb": "sketching"
    },
    {
      "sentence": "Our neighbors had been speaking with the professor all day.",
      "verb": "speaking"
    },
    {
      "sentence": "Emma had been texting the office since Monday.",
      "verb": "texting"
    },
    {
      "sentence": "The team had been winning the contract before the meeting.",
      "verb": "winning"
    },
    {
      "sentence": "Her sister had been getting a book for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, they had been drinking some water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "The children had been remembering the future before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, my friend had been speaking to my parents for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher had been thinking about the meeting for two hours.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, my parents had been emailing my family for a month.",
      "verb": "emailing"
    },
    {
      "sentence": "The cat had been eating its dinner before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Emma had been going to school since yesterday.",
      "verb": "going"
    },
    {
      "sentence": "The manager had been building a plan all week.",
      "verb": "building"
    },
    {
      "sentence": "My brother had been reading the chapter all day.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, you had been considering the vacation all week.",
      "verb": "considering"
    },
    {
      "sentence": "The children had been fixing the car before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the team had been completing a new product for a week.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the dog had been playing with the toy all day.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher had been speaking to the client since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher had been texting my friend for years.",
      "verb": "texting"
    },
    {
      "sentence": "The company had been winning the results before the meeting.",
      "verb": "winning"
    },
    {
      "sentence": "The team had been announcing the results before the meeting.",
      "verb": "announcing"
    },
    {
      "sentence": "The dog had been eating a treat before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "We had been repairing the sink all week.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors had been tidying the dishes before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "The bird had been catching the ball before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "My friend had been eating dinner before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "You had been deciding on the options before the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "The cat had been playing in the park before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, john had been repairing the roof for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog had been catching the frisbee before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, john had been speaking with the boss for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, our neighbors had been cleaning the car for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother had been meeting the neighbors since Monday.",
      "verb": "meeting"
    },
    {
      "sentence": "I had been seeing the doctor for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "My friend had been watching a documentary for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, emma had been meeting an old friend all week.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah had been finishing the report before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "I had been designing an app all week.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, they had been drinking water since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the students had been drawing a poster all week.",
      "verb": "drawing"
    },
    {
      "sentence": "The teacher had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been listening to music for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "She had been planning the problem all day.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the bird had been running in circles all day.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the manager had been watching TV for a month.",
      "verb": "watching"
    },
    {
      "sentence": "I had been cooking lunch before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "I had been choosing a new house since yesterday.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird had been catching a treat for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "You had been sketching a poster for years.",
      "verb": "sketching"
    },
    {
      "sentence": "He had been drinking some water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the students had been finding a new house for a month.",
      "verb": "finding"
    },
    {
      "sentence": "My brother had been traveling downtown before the meeting.",
      "verb": "traveling"
    },
    {
      "sentence": "John had been practicing for the exam for a week.",
      "verb": "practicing"
    },
    {
      "sentence": "The bird had been chasing the other pets for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "The children had been tidying the room for three days.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the cat had been chasing its tail for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the bird had been running in the garden for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, they had been painting a poster since Monday.",
      "verb": "painting"
    },
    {
      "sentence": "Tom had been talking to my friend before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, tom had been planning the situation for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "Tom had been having a meal for a month.",
      "verb": "having"
    },
    {
      "sentence": "My brother had been meeting the doctor before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "She had been washing the car before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "Sarah had been watching a series since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been meeting the team before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "She had been drinking tea since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my brother had been listening to classical music for years.",
      "verb": "listening"
    },
    {
      "sentence": "You had been reading grammar before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the team had been developing the results all day.",
      "verb": "developing"
    },
    {
      "sentence": "By noon, the manager had been forgetting the options since this morning.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the cat had been chasing the ball for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, our neighbors had been making a cake for years.",
      "verb": "making"
    },
    {
      "sentence": "The company had been releasing the update all day.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, they had been listening to the radio all week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, she had been making a cake for three days.",
      "verb": "making"
    },
    {
      "sentence": "The children had been seeing the team before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister had been drinking juice since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been catching the toy for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, she had been finishing the project all day.",
      "verb": "finishing"
    },
    {
      "sentence": "John had been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the team had been developing the software for a week.",
      "verb": "developing"
    },
    {
      "sentence": "John had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, her sister had been designing a website for a month.",
      "verb": "designing"
    },
    {
      "sentence": "Sarah had been remembering the options before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, you had been listening to the lecture since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "They had been listening to the news since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been sleeping in the corner for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom had been eating a sandwich before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "He had been starting the task before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The dog had been eating the leftover food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah had been meeting the client for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager had been speaking with the teacher before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The children had been choosing a gift all day.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, emma had been contacting the office all day.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager had been building a presentation before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "They had been speaking with a colleague for years.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, sarah had been deciding on the future for a week.",
      "verb": "deciding"
    },
    {
      "sentence": "My brother had been baking soup before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "He had been drinking coffee for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother had been speaking with the client for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "We had been calling the office before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "He had been eating breakfast before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah had been going home for years.",
      "verb": "going"
    },
    {
      "sentence": "Tom had been texting the teacher since this morning.",
      "verb": "texting"
    },
    {
      "sentence": "Sarah had been thinking about the vacation for a week.",
      "verb": "thinking"
    },
    {
      "sentence": "The students had been visiting the team before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister had been completing the document for a month.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister had been eating some fruit since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister had been playing guitar since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister had been seeing the teacher before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "John had been fixing the sink for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "I had been visiting my parents for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "John had been designing a prototype before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, i had been tidying the room for two hours.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, tom had been having a snack for years.",
      "verb": "having"
    },
    {
      "sentence": "My parents had been buying a present before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "Our neighbors had been deciding on the birthday party since yesterday.",
      "verb": "deciding"
    },
    {
      "sentence": "By noon, the cat had been chasing the ball for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents had been listening to a song before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "I had been learning the chapter since yesterday.",
      "verb": "learning"
    },
    {
      "sentence": "The dog had been eating its breakfast since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "We had been sending the project before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "The bird had been eating its breakfast before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "He had been submitting the presentation all day.",
      "verb": "submitting"
    },
    {
      "sentence": "They had been giving a laptop before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "We had been reading science all week.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah had been watching football for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The company had been developing the update all week.",
      "verb": "developing"
    },
    {
      "sentence": "The company had been launching the project since yesterday.",
      "verb": "launching"
    },
    {
      "sentence": "The bird had been catching the ball for years.",
      "verb": "catching"
    },
    {
      "sentence": "John had been repairing the sink before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "They had been creating a model for years.",
      "verb": "creating"
    },
    {
      "sentence": "Tom had been washing the room since this morning.",
      "verb": "washing"
    },
    {
      "sentence": "You had been sketching a diagram before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "I had been studying history for a week.",
      "verb": "studying"
    },
    {
      "sentence": "The students had been listening to jazz before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The dog had been catching the mouse before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "He had been tidying the car all day.",
      "verb": "tidying"
    },
    {
      "sentence": "The students had been thinking about the event before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, tom had been watching TV for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The students had been planning the problem for a month.",
      "verb": "planning"
    },
    {
      "sentence": "John had been organizing the house before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "Her sister had been cleaning the office before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister had been tidying the office since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the bird had been eating a treat since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "They had been considering the vacation for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "John had been receiving the document all week.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, he had been watching a documentary for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, they had been sketching a landscape for three days.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, emma had been getting a new house for years.",
      "verb": "getting"
    },
    {
      "sentence": "The company had been developing a new product all week.",
      "verb": "developing"
    },
    {
      "sentence": "My parents had been baking a cake for years.",
      "verb": "baking"
    },
    {
      "sentence": "By noon, i had been seeing my grandmother for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "The teacher had been seeing the team for a month.",
      "verb": "seeing"
    },
    {
      "sentence": "Tom had been baking cookies for a week.",
      "verb": "baking"
    },
    {
      "sentence": "The students had been visiting the doctor before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, her sister had been playing soccer for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the students had been receiving the letter since this morning.",
      "verb": "receiving"
    },
    {
      "sentence": "You had been listening to the lecture before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been catching the toy before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the company had been completing the contract since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "The dog had been playing in the garden for years.",
      "verb": "playing"
    },
    {
      "sentence": "The manager had been visiting the teacher before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog had been running across the field for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, we had been drinking tea all day.",
      "verb": "drinking"
    },
    {
      "sentence": "The company had been releasing the project before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, they had been playing football for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher had been talking to my family before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the dog had been playing with its owner for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the teacher had been watching a show all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the children had been watching a video for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, we had been teaching English for years.",
      "verb": "teaching"
    },
    {
      "sentence": "Our neighbors had been fixing the bike all day.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat had been running through the grass for a month.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the students had been designing a project all day.",
      "verb": "designing"
    },
    {
      "sentence": "The bird had been chasing the toy since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog had been running in circles for a week.",
      "verb": "running"
    },
    {
      "sentence": "Emma had been sending the assignment for a month.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister had been meeting the manager since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the students had been listening to jazz for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah had been washing the garage for a week.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, the students had been understanding mathematics since yesterday.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog had been eating its dinner before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The children had been playing soccer since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been eating the leftover food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, they had been creating a project since Monday.",
      "verb": "creating"
    },
    {
      "sentence": "My friend had been having breakfast all day.",
      "verb": "having"
    },
    {
      "sentence": "We had been getting a gift before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "Emma had been baking a salad before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "My brother had been preparing a salad before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the children had been writing the document for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, they had been forgetting the options since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "They had been having some fruit before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "The cat had been eating some food all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the bird had been sleeping under the table all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "We had been having a sandwich before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "By noon, the dog had been catching a butterfly for years.",
      "verb": "catching"
    },
    {
      "sentence": "Tom had been washing the bathroom before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, the bird had been playing in the yard since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the students had been preparing the report for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the dog had been playing in the park for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been sketching a diagram for two hours.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, the dog had been running across the field for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Emma had been organizing the car before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "Her sister had been eating a sandwich all day.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher had been completing the contract for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "My parents had been contacting my parents since this morning.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, they had been baking dinner since this morning.",
      "verb": "baking"
    },
    {
      "sentence": "They had been buying a new house for a week.",
      "verb": "buying"
    },
    {
      "sentence": "The children had been sketching a design for two hours.",
      "verb": "sketching"
    },
    {
      "sentence": "The dog had been chasing the squirrel before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah had been drinking water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager had been texting the client all week.",
      "verb": "texting"
    },
    {
      "sentence": "John had been getting some clothes for years.",
      "verb": "getting"
    },
    {
      "sentence": "Emma had been drinking some water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "The students had been getting the keys all day.",
      "verb": "getting"
    },
    {
      "sentence": "My friend had been washing the office before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "He had been contacting my parents for years.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents had been speaking to my family before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, my brother had been drinking coffee all week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the cat had been running in the garden since this morning.",
      "verb": "running"
    },
    {
      "sentence": "The dog had been catching a bird before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "I had been speaking to my friend for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird had been catching the frisbee for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Tom had been making rice before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "Sarah had been reading grammar all day.",
      "verb": "reading"
    },
    {
      "sentence": "Our neighbors had been finishing the presentation since Monday.",
      "verb": "finishing"
    },
    {
      "sentence": "Sarah had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "You had been building a house before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The children had been remembering the birthday party since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "The company had been completing the software since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the cat had been catching the ball since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "You had been calling the office before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "The manager had been flying to the beach since this morning.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, my friend had been drinking tea for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been playing in the garden for years.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been playing tennis for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The cat had been eating its dinner all day.",
      "verb": "eating"
    },
    {
      "sentence": "The dog had been sleeping all day before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, my friend had been drinking juice for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "The team had been winning the update for two hours.",
      "verb": "winning"
    },
    {
      "sentence": "They had been speaking with my family before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat had been playing with the toy all week.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been catching a butterfly all week.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the children had been painting the wall since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "My friend had been creating a model for years.",
      "verb": "creating"
    },
    {
      "sentence": "My friend had been listening to classical music for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been catching a butterfly for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "She had been having a meal for a month.",
      "verb": "having"
    },
    {
      "sentence": "By noon, john had been drinking coffee for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister had been baking a cake for two hours.",
      "verb": "baking"
    },
    {
      "sentence": "Her sister had been reviewing English since this morning.",
      "verb": "reviewing"
    },
    {
      "sentence": "The manager had been giving the keys for three days.",
      "verb": "giving"
    },
    {
      "sentence": "He had been writing the email since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the bird had been catching the mouse for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, you had been eating breakfast since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "My parents had been making a meal before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, her sister had been finishing the contract for two hours.",
      "verb": "finishing"
    },
    {
      "sentence": "My parents had been eating pasta before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, we had been seeing the manager since yesterday.",
      "verb": "seeing"
    },
    {
      "sentence": "She had been studying history before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The students had been designing a house since Monday.",
      "verb": "designing"
    },
    {
      "sentence": "Her sister had been repairing the bike for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the team had been winning the project all day.",
      "verb": "winning"
    },
    {
      "sentence": "The bird had been playing in the yard before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "He had been going downtown before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "By noon, we had been listening to an audiobook all week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, i had been tidying the dishes for a month.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, my brother had been submitting the presentation for a month.",
      "verb": "submitting"
    },
    {
      "sentence": "You had been contacting the client for years.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents had been remembering the options for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the students had been drawing a design all day.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, we had been writing the application all day.",
      "verb": "writing"
    },
    {
      "sentence": "The teacher had been washing the clothes before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "You had been repairing the fence before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher had been coming to the gym since this morning.",
      "verb": "coming"
    },
    {
      "sentence": "Her sister had been understanding the notes since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog had been eating some food since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "The bird had been playing with the toy since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been sketching a diagram all week.",
      "verb": "sketching"
    },
    {
      "sentence": "John had been drawing the wall before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "He had been listening to jazz for years.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the dog had been eating quickly for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the company had been launching the update for three days.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, the team had been winning the championship for three days.",
      "verb": "winning"
    },
    {
      "sentence": "By noon, the dog had been playing in the yard all week.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah had been watching the news since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah had been forgetting the plan before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the dog had been eating some food since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "The dog had been chasing birds in the garden since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents had been emailing customer service all day.",
      "verb": "emailing"
    },
    {
      "sentence": "He had been designing a prototype all day.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, my friend had been fixing the computer for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, tom had been playing the piano since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "She had been having pasta for three days.",
      "verb": "having"
    },
    {
      "sentence": "Her sister had been cooking cookies before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The cat had been catching the ball since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "The students had been talking to the neighbors before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "My friend had been fixing the machine for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, my friend had been speaking to the boss for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird had been running in the garden since Monday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, he had been building a website all day.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the team had been announcing the update for a month.",
      "verb": "announcing"
    },
    {
      "sentence": "John had been drawing a design before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "She had been listening to the radio for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The children had been drinking some water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the students had been fixing the sink for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "Sarah had been listening to jazz before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been running in the garden all week.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the dog had been chasing its tail for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "He had been making dinner before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "Tom had been understanding the chapter for years.",
      "verb": "understanding"
    },
    {
      "sentence": "She had been tidying the office all week.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, you had been visiting the manager all week.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird had been playing in the garden for three days.",
      "verb": "playing"
    },
    {
      "sentence": "She had been creating a prototype for three days.",
      "verb": "creating"
    },
    {
      "sentence": "John had been making pasta before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, emma had been washing the bathroom since yesterday.",
      "verb": "washing"
    },
    {
      "sentence": "She had been listening to music all day.",
      "verb": "listening"
    },
    {
      "sentence": "The students had been thinking about the vacation before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "John had been preparing the presentation since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, her sister had been drawing a portrait since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "They had been considering the birthday party before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Tom had been reviewing science before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the students had been visiting the client all week.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog had been chasing its tail for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the bird had been catching the toy for a month.",
      "verb": "catching"
    },
    {
      "sentence": "They had been texting the manager before the meeting.",
      "verb": "texting"
    },
    {
      "sentence": "Tom had been understanding French for years.",
      "verb": "understanding"
    },
    {
      "sentence": "The cat had been eating its dinner for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, our neighbors had been listening to jazz for a week.",
      "verb": "listening"
    },
    {
      "sentence": "You had been speaking with my family for years.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister had been starting the proposal for a week.",
      "verb": "starting"
    },
    {
      "sentence": "Tom had been baking cookies before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "My parents had been making lunch before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "Our neighbors had been selling a present for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "The bird had been playing with its owner since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The company had been releasing a new product before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "He had been reading science before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "She had been speaking with my parents all week.",
      "verb": "speaking"
    },
    {
      "sentence": "They had been watching the news for a week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, my parents had been making a cake since this morning.",
      "verb": "making"
    },
    {
      "sentence": "The students had been eating pasta all week.",
      "verb": "eating"
    },
    {
      "sentence": "The team had been completing the project before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the bird had been eating some food since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been painting the wall before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "Our neighbors had been drawing an illustration all day.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat had been catching the ball for years.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister had been visiting the teacher for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, tom had been preparing rice since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "Tom had been drinking some water for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been sleeping in the sun for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The cat had been sleeping on the bed before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the bird had been chasing birds in the garden since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "They had been speaking with the neighbors for two hours.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents had been visiting an old friend before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, emma had been playing volleyball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my parents had been drawing a picture since this morning.",
      "verb": "drawing"
    },
    {
      "sentence": "You had been preparing the report for years.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, i had been getting a new house since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "The cat had been running across the field for three days.",
      "verb": "running"
    },
    {
      "sentence": "The students had been drawing a poster for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "John had been preparing rice all week.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, our neighbors had been leaving to the bank all week.",
      "verb": "leaving"
    },
    {
      "sentence": "My parents had been walking to the gym before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "My brother had been playing golf since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been meeting my parents since this morning.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat had been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By noon, you had been having a meal since yesterday.",
      "verb": "having"
    },
    {
      "sentence": "My friend had been having some fruit for a month.",
      "verb": "having"
    },
    {
      "sentence": "By noon, the teacher had been drinking juice for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been running in circles for a month.",
      "verb": "running"
    },
    {
      "sentence": "By noon, we had been drinking milk for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the company had been developing the contract for a week.",
      "verb": "developing"
    },
    {
      "sentence": "They had been running to the airport for a week.",
      "verb": "running"
    },
    {
      "sentence": "The company had been launching a new product before the meeting.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, the bird had been playing with the toy since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "The children had been finding flowers for two hours.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, he had been fixing the computer for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, emma had been cooking breakfast for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "The cat had been sleeping under the table for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird had been eating its dinner for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the cat had been chasing the squirrel for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "The team had been launching a new product before the meeting.",
      "verb": "launching"
    },
    {
      "sentence": "Her sister had been listening to music for years.",
      "verb": "listening"
    },
    {
      "sentence": "I had been seeing my grandmother since yesterday.",
      "verb": "seeing"
    },
    {
      "sentence": "Our neighbors had been submitting the document before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, the manager had been listening to a song for three days.",
      "verb": "listening"
    },
    {
      "sentence": "I had been reading Spanish for a month.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the cat had been playing with the toy since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been eating its breakfast for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, we had been speaking with the doctor for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, emma had been watching the game all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, emma had been cooking pasta for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, tom had been meeting the client since this morning.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the dog had been playing in the park for years.",
      "verb": "playing"
    },
    {
      "sentence": "We had been playing volleyball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been eating its food for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The dog had been sleeping all day for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, my brother had been thinking about the future all day.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the children had been watching the game since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "My friend had been coming to the park before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "Sarah had been speaking to the manager before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the dog had been chasing the squirrel for years.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, my brother had been understanding history since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, my friend had been playing soccer since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my parents had been playing golf for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been playing in the park before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been sending the task before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "The bird had been eating quickly all day.",
      "verb": "eating"
    },
    {
      "sentence": "The dog had been running in the garden before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Sarah had been having dinner before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "By noon, john had been understanding vocabulary all week.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the teacher had been visiting my parents since this morning.",
      "verb": "visiting"
    },
    {
      "sentence": "They had been watching a show for three days.",
      "verb": "watching"
    },
    {
      "sentence": "She had been remembering the future for two hours.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog had been catching a treat before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "My parents had been watching the news since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The dog had been chasing its tail for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat had been playing in the garden before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been cooking rice before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah had been getting groceries since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, you had been drawing a landscape for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "Tom had been meeting the teacher before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, my brother had been cooking cookies for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "You had been drinking juice before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher had been practicing for the exam for a week.",
      "verb": "practicing"
    },
    {
      "sentence": "You had been making a meal before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "The cat had been catching a bird before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, they had been organizing the house for two hours.",
      "verb": "organizing"
    },
    {
      "sentence": "John had been creating a house since this morning.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, my friend had been washing the bathroom since this morning.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, our neighbors had been forgetting the trip since this morning.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend had been repairing the car for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend had been giving a book before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "The dog had been playing with the ball all day.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been emailing the client before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "My parents had been building a website for a week.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the bird had been chasing the ball all week.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the company had been developing the results since yesterday.",
      "verb": "developing"
    },
    {
      "sentence": "I had been contacting the boss for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, she had been planning the situation for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "The bird had been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "John had been watching the news for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "My parents had been visiting the doctor all day.",
      "verb": "visiting"
    },
    {
      "sentence": "Sarah had been giving groceries since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "He had been texting my parents since Monday.",
      "verb": "texting"
    },
    {
      "sentence": "We had been walking to school since this morning.",
      "verb": "walking"
    },
    {
      "sentence": "My brother had been writing the contract before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, you had been going to the office for a month.",
      "verb": "going"
    },
    {
      "sentence": "By noon, sarah had been talking to the doctor since this morning.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the manager had been speaking to my family since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager had been planning the meeting before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, my friend had been walking to the store all week.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, my brother had been repairing the roof since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "Tom had been drinking coffee all day.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend had been sending the document all day.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, you had been watching a documentary since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "Emma had been emailing my parents for a week.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, the company had been developing the contract for a month.",
      "verb": "developing"
    },
    {
      "sentence": "We had been speaking with my friend before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "You had been texting the client since this morning.",
      "verb": "texting"
    },
    {
      "sentence": "Sarah had been giving a new car since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the bird had been catching a butterfly all day.",
      "verb": "catching"
    },
    {
      "sentence": "The dog had been running across the field all day.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors had been having lunch for a month.",
      "verb": "having"
    },
    {
      "sentence": "I had been emailing the team before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, the team had been completing a new product all day.",
      "verb": "completing"
    },
    {
      "sentence": "You had been leaving downtown since yesterday.",
      "verb": "leaving"
    },
    {
      "sentence": "He had been completing the task for a month.",
      "verb": "completing"
    },
    {
      "sentence": "She had been repairing the fence all day.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, sarah had been eating a salad for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the dog had been running across the field since Monday.",
      "verb": "running"
    },
    {
      "sentence": "Tom had been buying a book before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the bird had been running in the park all week.",
      "verb": "running"
    },
    {
      "sentence": "The bird had been sleeping on the couch before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the cat had been catching a treat all day.",
      "verb": "catching"
    },
    {
      "sentence": "We had been reading Spanish all week.",
      "verb": "reading"
    },
    {
      "sentence": "She had been playing basketball all week.",
      "verb": "playing"
    },
    {
      "sentence": "The students had been completing the document for three days.",
      "verb": "completing"
    },
    {
      "sentence": "The cat had been running through the grass before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, our neighbors had been watching TV all week.",
      "verb": "watching"
    },
    {
      "sentence": "They had been flying to the office before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "I had been drinking a smoothie before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been teaching history before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "The team had been completing the results for three days.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, my friend had been completing the presentation for years.",
      "verb": "completing"
    },
    {
      "sentence": "The bird had been catching a bird since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, her sister had been drinking tea for years.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been eating a meal all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, they had been having a meal since this morning.",
      "verb": "having"
    },
    {
      "sentence": "By noon, her sister had been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, her sister had been getting a book for a week.",
      "verb": "getting"
    },
    {
      "sentence": "Tom had been remembering the problem before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog had been eating its breakfast before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, i had been playing golf for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been chasing the squirrel since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the children had been cleaning the garage since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been fixing the roof for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "You had been seeing my family before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird had been sleeping under the table for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The teacher had been running to school before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, he had been playing volleyball for years.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been watching a video before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been eating its breakfast since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The cat had been eating quickly before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been cleaning the clothes before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the dog had been sleeping in the sun for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "The company had been completing the deal before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister had been selling some clothes all day.",
      "verb": "selling"
    },
    {
      "sentence": "The cat had been chasing its tail since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "Tom had been understanding science before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the bird had been sleeping in the corner for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the children had been visiting the neighbors for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher had been preparing the letter before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird had been chasing the other pets before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, our neighbors had been building a house all week.",
      "verb": "building"
    },
    {
      "sentence": "Her sister had been meeting the client before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "They had been drinking milk before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "We had been having dinner before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "Our neighbors had been arriving to the park before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "Our neighbors had been contacting the manager before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "I had been listening to an audiobook for a month.",
      "verb": "listening"
    },
    {
      "sentence": "The cat had been running in the yard before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "The students had been playing soccer before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my friend had been watching a movie all week.",
      "verb": "watching"
    },
    {
      "sentence": "The bird had been playing with the ball since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been watching a documentary before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been catching a treat for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, john had been cleaning the garage for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been starting the assignment for a week.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, the bird had been eating quickly for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been deciding on the decision before the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "I had been building a website for years.",
      "verb": "building"
    },
    {
      "sentence": "My friend had been learning vocabulary before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, the dog had been eating its food for a week.",
      "verb": "eating"
    },
    {
      "sentence": "The children had been building a website before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "He had been fixing the roof before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird had been running in circles all day.",
      "verb": "running"
    },
    {
      "sentence": "My brother had been sketching a design before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma had been visiting the neighbors all day.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird had been sleeping on the bed all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog had been playing in the park all week.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been drawing a diagram before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister had been submitting the presentation since this morning.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, emma had been washing the office all week.",
      "verb": "washing"
    },
    {
      "sentence": "He had been designing a plan for a month.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the cat had been catching a bird all day.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher had been drinking water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend had been meeting my grandmother for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the dog had been chasing the mouse for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the manager had been playing guitar for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my brother had been sending the assignment for a month.",
      "verb": "sending"
    },
    {
      "sentence": "I had been repairing the door all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, my brother had been watching a video for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the manager had been finishing the document since yesterday.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, her sister had been forgetting the meeting for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the cat had been sleeping on the couch for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah had been speaking to my family before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager had been emailing the team for three days.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, my parents had been designing a project for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "We had been eating a snack before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "She had been selling the keys before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The children had been cleaning the house for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the bird had been chasing the ball for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, you had been seeing an old friend for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "The manager had been drawing a landscape before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, i had been planning the problem since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the manager had been speaking with the manager for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "I had been playing video games since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been sleeping in the sun for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom had been watching the news since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "John had been repairing the car all week.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, my parents had been texting the boss since yesterday.",
      "verb": "texting"
    },
    {
      "sentence": "Tom had been visiting my grandmother for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the bird had been running through the grass all week.",
      "verb": "running"
    },
    {
      "sentence": "I had been emailing the manager before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird had been eating a treat for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "I had been listening to an audiobook before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "We had been repairing the sink before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, i had been washing the car since Monday.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, the bird had been chasing the other pets since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "We had been making soup before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "The dog had been running in circles before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "We had been selling some clothes for three days.",
      "verb": "selling"
    },
    {
      "sentence": "We had been submitting the report before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "Emma had been buying some clothes since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "My parents had been starting the proposal since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, our neighbors had been baking a cake since Monday.",
      "verb": "baking"
    },
    {
      "sentence": "By noon, we had been contacting the team for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, tom had been playing the piano all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, sarah had been watching a documentary for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been playing in the yard for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been playing in the yard for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "You had been running downtown for three days.",
      "verb": "running"
    },
    {
      "sentence": "The cat had been catching the toy since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "My friend had been eating a salad for a week.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister had been thinking about the plan for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "My brother had been having lunch before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "My friend had been sketching a picture before the meeting.",
      "verb": "sketching"
    },
    {
      "sentence": "The cat had been eating some food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the teacher had been drinking tea all day.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend had been submitting the document before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, john had been designing a house for a month.",
      "verb": "designing"
    },
    {
      "sentence": "The teacher had been arriving to the store before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "I had been sketching a landscape all week.",
      "verb": "sketching"
    },
    {
      "sentence": "The manager had been texting the teacher for a week.",
      "verb": "texting"
    },
    {
      "sentence": "The bird had been running in the yard before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "The company had been launching the deal before the meeting.",
      "verb": "launching"
    },
    {
      "sentence": "She had been listening to a song before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The cat had been running in the park before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "The dog had been catching the toy before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the students had been planning the options since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "The company had been winning the championship before the meeting.",
      "verb": "winning"
    },
    {
      "sentence": "By noon, i had been preparing a meal all day.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the company had been launching the championship all week.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, the dog had been catching the mouse for years.",
      "verb": "catching"
    },
    {
      "sentence": "You had been cooking lunch for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, john had been forgetting the decision all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "The manager had been submitting the presentation since yesterday.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, sarah had been building an app since this morning.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the children had been calling the office since this morning.",
      "verb": "calling"
    },
    {
      "sentence": "We had been giving a book for a week.",
      "verb": "giving"
    },
    {
      "sentence": "Emma had been watching the news for a week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the cat had been running across the field since Monday.",
      "verb": "running"
    },
    {
      "sentence": "You had been traveling to the store before the meeting.",
      "verb": "traveling"
    },
    {
      "sentence": "By noon, we had been teaching science for a week.",
      "verb": "teaching"
    },
    {
      "sentence": "The bird had been catching a butterfly since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "The manager had been drawing a design all day.",
      "verb": "drawing"
    },
    {
      "sentence": "She had been listening to jazz for a month.",
      "verb": "listening"
    },
    {
      "sentence": "She had been completing the project before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "My parents had been considering the meeting before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, sarah had been drinking some water since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents had been repairing the fence for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird had been running in the yard all week.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the cat had been sleeping in the corner for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, emma had been repairing the sink since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the bird had been eating a treat since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher had been planning the birthday party before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "My parents had been preparing soup since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "My brother had been completing the project all day.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the dog had been sleeping in the sun since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "I had been fixing the sink for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, she had been creating a website since Monday.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the teacher had been reviewing the notes since yesterday.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the children had been listening to an audiobook all day.",
      "verb": "listening"
    },
    {
      "sentence": "Tom had been creating a model before the meeting.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, my parents had been drinking tea for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been playing with the other pets since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been catching the ball all week.",
      "verb": "catching"
    },
    {
      "sentence": "My parents had been having pasta for years.",
      "verb": "having"
    },
    {
      "sentence": "The children had been giving some clothes before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "My parents had been playing basketball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "He had been walking to the airport before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "Our neighbors had been drawing a picture before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "I had been tidying the car before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "Emma had been drinking water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been having a meal for years.",
      "verb": "having"
    },
    {
      "sentence": "By noon, the dog had been playing with the ball since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been eating breakfast since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The cat had been eating its food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the dog had been catching a bird for a month.",
      "verb": "catching"
    },
    {
      "sentence": "I had been contacting the office since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, they had been meeting an old friend for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, she had been making rice all day.",
      "verb": "making"
    },
    {
      "sentence": "By noon, john had been seeing the manager for a month.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister had been calling the team for three days.",
      "verb": "calling"
    },
    {
      "sentence": "The cat had been chasing the toy for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "Tom had been talking to a colleague before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "John had been going to the airport before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "The children had been sketching a design all week.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, he had been texting customer service all week.",
      "verb": "texting"
    },
    {
      "sentence": "The dog had been catching the ball before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "We had been preparing a salad before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The team had been completing the contract since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "You had been calling the manager before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, she had been building an app since this morning.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the bird had been sleeping in the sun all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The company had been completing the software for years.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister had been seeing an old friend since yesterday.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog had been sleeping under the table all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the manager had been cleaning the car since this morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "I had been speaking to the teacher for years.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been tidying the kitchen before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "I had been sketching a landscape for three days.",
      "verb": "sketching"
    },
    {
      "sentence": "The manager had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, they had been returning to the store for a week.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the cat had been running in the park for years.",
      "verb": "running"
    },
    {
      "sentence": "By noon, john had been making cookies for a month.",
      "verb": "making"
    },
    {
      "sentence": "The children had been going home before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "The dog had been chasing birds in the garden for years.",
      "verb": "chasing"
    },
    {
      "sentence": "Tom had been speaking to the client for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, sarah had been talking to the client for a month.",
      "verb": "talking"
    },
    {
      "sentence": "My parents had been building a website for three days.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the students had been reading history for a week.",
      "verb": "reading"
    },
    {
      "sentence": "The dog had been eating its dinner all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, my parents had been repairing the fence for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah had been drawing an illustration before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat had been chasing the squirrel for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "I had been choosing a laptop before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "She had been painting a design before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "We had been planning the problem before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been preparing rice since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird had been sleeping under the table for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "We had been baking soup since yesterday.",
      "verb": "baking"
    },
    {
      "sentence": "By noon, her sister had been visiting an old friend for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "The students had been fixing the sink for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, my brother had been fixing the fence for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "The children had been playing golf for a month.",
      "verb": "playing"
    },
    {
      "sentence": "You had been listening to the news before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, her sister had been remembering the situation all week.",
      "verb": "remembering"
    },
    {
      "sentence": "John had been designing a plan since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "We had been repairing the bike before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, her sister had been completing the letter since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the team had been developing the contract since this morning.",
      "verb": "developing"
    },
    {
      "sentence": "Sarah had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been eating its breakfast for a month.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah had been listening to the news for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been seeing my family before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird had been catching the mouse before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "The bird had been chasing birds in the garden for years.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the bird had been running across the field all day.",
      "verb": "running"
    },
    {
      "sentence": "The students had been eating a meal before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "You had been watching a series for years.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, my parents had been cooking cookies since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah had been preparing dinner all week.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, i had been fixing the fence for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, emma had been considering the options all day.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, she had been arriving to the beach for two hours.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, i had been repairing the machine since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "Her sister had been talking to my parents before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "My friend had been painting a picture all day.",
      "verb": "painting"
    },
    {
      "sentence": "John had been thinking about the vacation before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the bird had been playing in the park all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been submitting the project for a month.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, my parents had been playing the piano all day.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, they had been tidying the house since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the students had been making a salad for a month.",
      "verb": "making"
    },
    {
      "sentence": "The students had been running home before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "The team had been announcing the software before the meeting.",
      "verb": "announcing"
    },
    {
      "sentence": "Our neighbors had been buying a present before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "Her sister had been eating a meal before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, i had been having pasta all day.",
      "verb": "having"
    },
    {
      "sentence": "They had been giving a present since this morning.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, my friend had been baking cookies since this morning.",
      "verb": "baking"
    },
    {
      "sentence": "By noon, the children had been making a cake for years.",
      "verb": "making"
    },
    {
      "sentence": "You had been playing volleyball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "I had been writing the application all day.",
      "verb": "writing"
    },
    {
      "sentence": "The manager had been selling flowers before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The bird had been running in circles since this morning.",
      "verb": "running"
    },
    {
      "sentence": "John had been listening to classical music since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister had been watching the game all week.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been cleaning the car for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "Our neighbors had been choosing a book before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, the cat had been sleeping in the sun all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children had been giving a book since this morning.",
      "verb": "giving"
    },
    {
      "sentence": "Sarah had been eating breakfast all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the students had been receiving the presentation all week.",
      "verb": "receiving"
    },
    {
      "sentence": "Our neighbors had been choosing a present before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "The cat had been playing in the yard for three days.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been chasing birds in the garden before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "They had been tidying the car before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the bird had been sleeping on the bed all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the teacher had been tidying the bathroom for two hours.",
      "verb": "tidying"
    },
    {
      "sentence": "My friend had been studying mathematics since this morning.",
      "verb": "studying"
    },
    {
      "sentence": "The teacher had been listening to the lecture before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "My parents had been understanding the material before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the dog had been chasing the other pets all day.",
      "verb": "chasing"
    },
    {
      "sentence": "John had been texting customer service all week.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the cat had been catching the toy for years.",
      "verb": "catching"
    },
    {
      "sentence": "He had been fixing the sink before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird had been sleeping under the table before the meeting.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom had been playing video games before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "She had been coming to the hospital before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "The dog had been sleeping under the table for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, she had been fixing the sink since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, my brother had been reading science for three days.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, we had been tidying the room since Monday.",
      "verb": "tidying"
    },
    {
      "sentence": "I had been painting a poster since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the students had been cooking cookies for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "John had been buying a present before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "My parents had been finding a new house since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, i had been listening to classical music all day.",
      "verb": "listening"
    },
    {
      "sentence": "He had been emailing the teacher since Monday.",
      "verb": "emailing"
    },
    {
      "sentence": "He had been preparing breakfast since this morning.",
      "verb": "preparing"
    },
    {
      "sentence": "John had been traveling downtown before the meeting.",
      "verb": "traveling"
    },
    {
      "sentence": "The manager had been watching a movie before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, her sister had been listening to classical music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Emma had been repairing the computer before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, they had been fixing the bike for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat had been playing with the toy for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been cooking rice for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, the children had been painting an illustration for years.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the teacher had been listening to the radio all day.",
      "verb": "listening"
    },
    {
      "sentence": "My friend had been returning to the library before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "Tom had been flying to the store before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, the dog had been running around the house all day.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the company had been developing the results since this morning.",
      "verb": "developing"
    },
    {
      "sentence": "By noon, my brother had been repairing the sink all day.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the cat had been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Sarah had been speaking to a colleague since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom had been watching the news before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The manager had been emailing my parents before the meeting.",
      "verb": "emailing"
    },
    {
      "sentence": "The children had been understanding Spanish before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "Her sister had been drawing a landscape for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the bird had been running in circles for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By noon, john had been playing volleyball since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been speaking with my family for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother had been speaking to the professor before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, we had been meeting my friend for years.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom had been seeing my grandmother for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "She had been texting the team since Monday.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the company had been winning a new product since this morning.",
      "verb": "winning"
    },
    {
      "sentence": "By noon, the manager had been talking to the doctor for years.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the manager had been watching football all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the cat had been eating some food all day.",
      "verb": "eating"
    },
    {
      "sentence": "You had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the cat had been catching the toy all week.",
      "verb": "catching"
    },
    {
      "sentence": "John had been speaking to the teacher before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat had been catching the toy all day.",
      "verb": "catching"
    },
    {
      "sentence": "The company had been developing the project for a week.",
      "verb": "developing"
    },
    {
      "sentence": "They had been cooking a meal before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, i had been drinking juice all week.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog had been chasing the squirrel for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager had been preparing rice before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The manager had been seeing the teacher before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog had been sleeping on the couch since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "He had been texting the manager since this morning.",
      "verb": "texting"
    },
    {
      "sentence": "She had been cooking soup before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The manager had been building a project since Monday.",
      "verb": "building"
    },
    {
      "sentence": "She had been flying to the beach before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "Our neighbors had been writing the contract since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been seeing an old friend since Monday.",
      "verb": "seeing"
    },
    {
      "sentence": "My brother had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the team had been winning the project for three days.",
      "verb": "winning"
    },
    {
      "sentence": "He had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the company had been announcing the deal since Monday.",
      "verb": "announcing"
    },
    {
      "sentence": "Our neighbors had been cooking soup since this morning.",
      "verb": "cooking"
    },
    {
      "sentence": "Our neighbors had been forgetting the meeting for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend had been playing the piano since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been listening to classical music since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the dog had been running through the grass for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the children had been choosing a new house for years.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents had been buying flowers since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "Sarah had been painting a landscape since this morning.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, he had been traveling to the beach for three days.",
      "verb": "traveling"
    },
    {
      "sentence": "By noon, the bird had been chasing the ball for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "He had been baking rice before the meeting.",
      "verb": "baking"
    },
    {
      "sentence": "The dog had been sleeping in the sun for a week.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, the bird had been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the students had been creating a presentation for three days.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, my brother had been playing soccer all day.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been playing chess before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, they had been creating a plan for three days.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the teacher had been repairing the door all day.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents had been seeing the teacher before the meeting.",
      "verb": "seeing"
    },
    {
      "sentence": "The teacher had been studying the notes before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "Emma had been deciding on the future before the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "My friend had been planning the event for years.",
      "verb": "planning"
    },
    {
      "sentence": "The dog had been running in the garden since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, my parents had been making soup since this morning.",
      "verb": "making"
    },
    {
      "sentence": "The children had been receiving the email for a month.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend had been texting the manager before the meeting.",
      "verb": "texting"
    },
    {
      "sentence": "We had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "The cat had been catching a butterfly before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "Emma had been contacting my family since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister had been playing chess for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been writing the email since this morning.",
      "verb": "writing"
    },
    {
      "sentence": "Emma had been visiting the client before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom had been getting some clothes for a week.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the company had been releasing the contract for a week.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, the company had been releasing the results since yesterday.",
      "verb": "releasing"
    },
    {
      "sentence": "My parents had been meeting my parents before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "They had been talking to my family for years.",
      "verb": "talking"
    },
    {
      "sentence": "The teacher had been fixing the bike for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird had been sleeping by the window all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "The cat had been playing with the other pets since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The children had been playing the piano before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, we had been playing video games for a month.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the manager had been cleaning the bathroom for years.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother had been repairing the roof for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents had been watching football for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the students had been listening to the lecture since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "The team had been launching the deal all day.",
      "verb": "launching"
    },
    {
      "sentence": "By noon, i had been starting the presentation for a week.",
      "verb": "starting"
    },
    {
      "sentence": "John had been contacting my parents for years.",
      "verb": "contacting"
    },
    {
      "sentence": "The bird had been playing with the toy before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been organizing the house for a week.",
      "verb": "organizing"
    },
    {
      "sentence": "Our neighbors had been flying home since Monday.",
      "verb": "flying"
    },
    {
      "sentence": "He had been having soup for a month.",
      "verb": "having"
    },
    {
      "sentence": "She had been making breakfast all day.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the cat had been running in circles for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, her sister had been visiting the doctor since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "The manager had been deciding on the trip for three days.",
      "verb": "deciding"
    },
    {
      "sentence": "My friend had been fixing the fence all week.",
      "verb": "fixing"
    },
    {
      "sentence": "The students had been teaching mathematics before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, he had been watching a show since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher had been teaching the material since this morning.",
      "verb": "teaching"
    },
    {
      "sentence": "The bird had been eating some food before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, they had been speaking to the boss for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors had been playing volleyball for three days.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher had been teaching grammar all week.",
      "verb": "teaching"
    },
    {
      "sentence": "My friend had been watching the match before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "My parents had been eating a sandwich for a week.",
      "verb": "eating"
    },
    {
      "sentence": "He had been painting a landscape for three days.",
      "verb": "painting"
    },
    {
      "sentence": "The cat had been playing in the yard for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been deciding on the event before the meeting.",
      "verb": "deciding"
    },
    {
      "sentence": "John had been listening to a song for years.",
      "verb": "listening"
    },
    {
      "sentence": "The students had been having soup before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "The students had been buying a gift all week.",
      "verb": "buying"
    },
    {
      "sentence": "The children had been making soup all day.",
      "verb": "making"
    },
    {
      "sentence": "By noon, she had been visiting the team since this morning.",
      "verb": "visiting"
    },
    {
      "sentence": "They had been remembering the situation before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird had been eating a treat before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, emma had been having pasta all day.",
      "verb": "having"
    },
    {
      "sentence": "By noon, you had been baking dinner since this morning.",
      "verb": "baking"
    },
    {
      "sentence": "The students had been drinking a smoothie for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the dog had been sleeping in the sun for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "They had been reviewing the material before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "John had been building a house for two hours.",
      "verb": "building"
    },
    {
      "sentence": "The cat had been catching the mouse for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors had been designing a project for a month.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the children had been sketching a picture since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "The teacher had been speaking with the neighbors all week.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister had been listening to classical music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been sleeping on the couch since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "Her sister had been creating a plan before the meeting.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the bird had been sleeping in the corner for a week.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah had been contacting the office for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the bird had been eating its food all week.",
      "verb": "eating"
    },
    {
      "sentence": "The company had been completing the contract for three days.",
      "verb": "completing"
    },
    {
      "sentence": "Emma had been washing the room before the meeting.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, the dog had been eating quickly all week.",
      "verb": "eating"
    },
    {
      "sentence": "My friend had been eating some fruit before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The cat had been eating a treat for years.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the teacher had been finishing the presentation all week.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, i had been driving to work for a month.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, my brother had been talking to the manager for a week.",
      "verb": "talking"
    },
    {
      "sentence": "Emma had been buying the phone before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "I had been listening to music since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "Tom had been painting a picture for years.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, my friend had been speaking with my parents all week.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, she had been teaching grammar all week.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister had been drinking a smoothie since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The children had been seeing my parents all day.",
      "verb": "seeing"
    },
    {
      "sentence": "My brother had been watching a movie before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "We had been painting the wall since Monday.",
      "verb": "painting"
    },
    {
      "sentence": "They had been drinking a smoothie for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, we had been getting the ticket since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "Our neighbors had been drinking water for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, john had been choosing the ticket since this morning.",
      "verb": "choosing"
    },
    {
      "sentence": "The dog had been eating the leftover food all week.",
      "verb": "eating"
    },
    {
      "sentence": "He had been designing a prototype all week.",
      "verb": "designing"
    },
    {
      "sentence": "The students had been speaking to my friend before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been drinking tea before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher had been teaching English before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "My brother had been designing an app before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, my parents had been sketching a design since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "The bird had been running in the garden before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, our neighbors had been playing tennis for years.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister had been running to the store before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "My parents had been listening to the lecture since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the company had been releasing the software all day.",
      "verb": "releasing"
    },
    {
      "sentence": "The teacher had been thinking about the problem all week.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma had been speaking with the neighbors before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "He had been listening to a song all week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been playing in the garden all day.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been eating its breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "The team had been winning the championship all week.",
      "verb": "winning"
    },
    {
      "sentence": "The children had been watching a series since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "John had been painting a picture before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the team had been developing the championship for a month.",
      "verb": "developing"
    },
    {
      "sentence": "The bird had been chasing birds in the garden before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister had been leaving to the store before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "We had been having a snack before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "The cat had been catching the mouse before the meeting.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah had been teaching for the exam before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, they had been seeing my parents for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "By noon, she had been talking to my friend all day.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the dog had been sleeping under the table for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird had been running in the yard for years.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the children had been speaking to the professor for years.",
      "verb": "speaking"
    },
    {
      "sentence": "The team had been releasing the results before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "You had been receiving the email before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "My brother had been creating an app before the meeting.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the cat had been chasing the mouse all day.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the children had been texting my family since yesterday.",
      "verb": "texting"
    },
    {
      "sentence": "Our neighbors had been watching a show before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, tom had been watching a movie all week.",
      "verb": "watching"
    },
    {
      "sentence": "The dog had been eating quickly before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, she had been fixing the fence for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom had been drinking milk before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, they had been preparing the task all week.",
      "verb": "preparing"
    },
    {
      "sentence": "The children had been contacting my parents since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, her sister had been cooking cookies for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah had been having a meal before the meeting.",
      "verb": "having"
    },
    {
      "sentence": "By noon, my friend had been writing the proposal since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "We had been choosing the ticket before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "Tom had been painting a poster before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "The teacher had been drawing the wall for a week.",
      "verb": "drawing"
    },
    {
      "sentence": "They had been meeting my grandmother all day.",
      "verb": "meeting"
    },
    {
      "sentence": "The children had been building a prototype before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The bird had been chasing the ball before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, my brother had been painting a design for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the cat had been running through the grass for three days.",
      "verb": "running"
    },
    {
      "sentence": "By noon, she had been seeing the manager all day.",
      "verb": "seeing"
    },
    {
      "sentence": "She had been meeting my parents before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The students had been drinking some water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The students had been sending the contract for three days.",
      "verb": "sending"
    },
    {
      "sentence": "She had been meeting my parents for years.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, our neighbors had been fixing the door for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, he had been finding some clothes for three days.",
      "verb": "finding"
    },
    {
      "sentence": "The cat had been running in the garden before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Her sister had been drinking milk all week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, i had been fixing the computer all day.",
      "verb": "fixing"
    },
    {
      "sentence": "We had been designing a presentation before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, her sister had been creating a model since Monday.",
      "verb": "creating"
    },
    {
      "sentence": "By noon, the dog had been running in the park for years.",
      "verb": "running"
    },
    {
      "sentence": "By noon, she had been understanding grammar all week.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the manager had been cleaning the house since this morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "You had been sending the letter all day.",
      "verb": "sending"
    },
    {
      "sentence": "Tom had been getting a new house before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "John had been preparing the assignment since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "We had been finding a laptop before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, she had been playing football all day.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been sleeping in the sun for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, john had been sending the assignment all day.",
      "verb": "sending"
    },
    {
      "sentence": "Tom had been tidying the office before the meeting.",
      "verb": "tidying"
    },
    {
      "sentence": "The bird had been playing with the toy for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been eating the leftover food for years.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, her sister had been building an app since this morning.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the manager had been washing the garage since this morning.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, tom had been practicing Spanish for three days.",
      "verb": "practicing"
    },
    {
      "sentence": "Our neighbors had been fixing the roof for years.",
      "verb": "fixing"
    },
    {
      "sentence": "Sarah had been playing basketball for three days.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been making a salad for two hours.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the students had been arriving to the market since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, john had been studying Spanish for years.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, john had been washing the car since Monday.",
      "verb": "washing"
    },
    {
      "sentence": "My friend had been eating pizza all day.",
      "verb": "eating"
    },
    {
      "sentence": "The team had been releasing the championship for a month.",
      "verb": "releasing"
    },
    {
      "sentence": "He had been drinking a smoothie for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "We had been fixing the fence before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother had been drawing a design before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister had been listening to music since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, they had been cooking breakfast since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "They had been preparing the letter before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "You had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the dog had been catching the ball since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the bird had been eating its dinner for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, she had been cooking breakfast for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird had been eating some food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "She had been speaking with the teacher for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the students had been repairing the car since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, i had been drinking juice for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat had been chasing the squirrel before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors had been creating a project for years.",
      "verb": "creating"
    },
    {
      "sentence": "Sarah had been finding a present before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "She had been finding flowers before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "Sarah had been talking to the professor since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the dog had been playing with the toy for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, emma had been sketching an illustration since this morning.",
      "verb": "sketching"
    },
    {
      "sentence": "By noon, emma had been starting the document since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "Tom had been teaching history since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "The cat had been catching a bird for three days.",
      "verb": "catching"
    },
    {
      "sentence": "By noon, the cat had been running through the grass since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, we had been listening to the lecture for years.",
      "verb": "listening"
    },
    {
      "sentence": "The children had been thinking about the options all day.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the dog had been running across the field since this morning.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the manager had been meeting my parents since this morning.",
      "verb": "meeting"
    },
    {
      "sentence": "He had been watching a series before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, she had been watching football for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "The team had been releasing the championship before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, sarah had been listening to jazz for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, sarah had been talking to the client for a week.",
      "verb": "talking"
    },
    {
      "sentence": "We had been playing guitar all day.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, we had been drinking coffee all day.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the students had been buying a new house for three days.",
      "verb": "buying"
    },
    {
      "sentence": "The manager had been getting a book before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "Her sister had been fixing the fence before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, her sister had been giving the keys for years.",
      "verb": "giving"
    },
    {
      "sentence": "The bird had been sleeping by the window for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "By noon, my friend had been creating a plan for a week.",
      "verb": "creating"
    },
    {
      "sentence": "The dog had been running in the park for a week.",
      "verb": "running"
    },
    {
      "sentence": "The teacher had been eating soup all week.",
      "verb": "eating"
    },
    {
      "sentence": "My brother had been watching a documentary before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The bird had been eating quickly before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The manager had been playing video games for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, her sister had been running to the market all week.",
      "verb": "running"
    },
    {
      "sentence": "Tom had been calling the office for three days.",
      "verb": "calling"
    },
    {
      "sentence": "The students had been speaking to my family before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat had been eating some food for years.",
      "verb": "eating"
    },
    {
      "sentence": "The cat had been playing with the other pets before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the teacher had been drinking juice since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the team had been completing the software for a month.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, our neighbors had been eating pizza all week.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors had been watching a movie before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the teacher had been driving downtown for years.",
      "verb": "driving"
    },
    {
      "sentence": "The children had been fixing the roof for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the children had been contacting customer service since yesterday.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, she had been visiting my grandmother for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "The children had been watching TV since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "My parents had been eating soup before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "My parents had been washing the bathroom for a month.",
      "verb": "washing"
    },
    {
      "sentence": "By noon, emma had been selling flowers for a week.",
      "verb": "selling"
    },
    {
      "sentence": "The bird had been catching a treat since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister had been repairing the door for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "You had been tidying the clothes for a month.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat had been playing in the park for years.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been eating the leftover food for a week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the children had been watching TV for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "My parents had been leaving to the beach before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the cat had been chasing the toy since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager had been watching a series all day.",
      "verb": "watching"
    },
    {
      "sentence": "The students had been playing golf before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "They had been drawing a design before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the children had been eating a sandwich all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the dog had been chasing the toy all day.",
      "verb": "chasing"
    },
    {
      "sentence": "The team had been releasing the project before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "By noon, the children had been cleaning the house all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog had been sleeping on the couch for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother had been contacting the manager for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "The children had been repairing the computer before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "We had been talking to the client all day.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, she had been fixing the door for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the bird had been playing in the park for three days.",
      "verb": "playing"
    },
    {
      "sentence": "The team had been releasing the software before the meeting.",
      "verb": "releasing"
    },
    {
      "sentence": "The manager had been eating soup all week.",
      "verb": "eating"
    },
    {
      "sentence": "The manager had been making rice since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "The company had been completing a new product all week.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, we had been watching a documentary all day.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister had been forgetting the meeting before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, they had been deciding on the birthday party for two hours.",
      "verb": "deciding"
    },
    {
      "sentence": "My friend had been visiting my family before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, he had been watching a video for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The students had been running downtown before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "They had been fixing the machine for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "The students had been speaking with the manager before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, she had been painting a landscape all week.",
      "verb": "painting"
    },
    {
      "sentence": "The bird had been catching the frisbee all week.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah had been studying the notes for three days.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the teacher had been practicing Spanish since this morning.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the team had been releasing the championship for a month.",
      "verb": "releasing"
    },
    {
      "sentence": "Emma had been speaking with the neighbors for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "I had been drinking water before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma had been designing a house before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "They had been baking a salad for a week.",
      "verb": "baking"
    },
    {
      "sentence": "Emma had been designing a website since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "They had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been repairing the roof before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird had been chasing the squirrel before the meeting.",
      "verb": "chasing"
    },
    {
      "sentence": "By noon, the children had been listening to a podcast all day.",
      "verb": "listening"
    },
    {
      "sentence": "My parents had been repairing the sink before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat had been eating its breakfast before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "He had been traveling to the airport for years.",
      "verb": "traveling"
    },
    {
      "sentence": "He had been submitting the presentation before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, my parents had been watching a video since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, you had been flying to school for years.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, you had been tidying the bathroom for two hours.",
      "verb": "tidying"
    },
    {
      "sentence": "By noon, the cat had been sleeping by the window all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "I had been watching a series before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "We had been thinking about the problem all day.",
      "verb": "thinking"
    },
    {
      "sentence": "My friend had been repairing the door for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher had been watching a video for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "My friend had been texting customer service for three days.",
      "verb": "texting"
    },
    {
      "sentence": "By noon, the bird had been running around the house for a month.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the students had been playing the piano for years.",
      "verb": "playing"
    },
    {
      "sentence": "I had been watching the game all week.",
      "verb": "watching"
    },
    {
      "sentence": "You had been designing an app since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "We had been repairing the car before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager had been drinking some water for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher had been choosing a new car before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "We had been talking to my family before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister had been organizing the kitchen before the meeting.",
      "verb": "organizing"
    },
    {
      "sentence": "By noon, the students had been speaking with the manager for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been fixing the fence before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "He had been arriving to the airport all week.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, you had been speaking to the team for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat had been eating its breakfast since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "She had been finishing the presentation for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the dog had been sleeping by the window all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma had been repairing the sink before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "John had been listening to an audiobook before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "They had been receiving the task before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend had been designing a model before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the manager had been finding groceries for a month.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, john had been eating dinner for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher had been finding a new house before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "The students had been listening to jazz for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The company had been winning the update before the meeting.",
      "verb": "winning"
    },
    {
      "sentence": "My brother had been visiting the client before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom had been fixing the car before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, they had been having some fruit since yesterday.",
      "verb": "having"
    },
    {
      "sentence": "By noon, we had been walking to the store since yesterday.",
      "verb": "walking"
    },
    {
      "sentence": "Her sister had been listening to the lecture before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "John had been deciding on the future for a month.",
      "verb": "deciding"
    },
    {
      "sentence": "By noon, the team had been launching the update for three days.",
      "verb": "launching"
    },
    {
      "sentence": "Our neighbors had been getting flowers before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the dog had been playing with its owner all day.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, our neighbors had been drinking some water since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents had been repairing the computer before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, they had been listening to a song all week.",
      "verb": "listening"
    },
    {
      "sentence": "The dog had been playing in the yard all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the bird had been chasing the mouse for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "The students had been calling customer service for three days.",
      "verb": "calling"
    },
    {
      "sentence": "Emma had been emailing my family for two hours.",
      "verb": "emailing"
    },
    {
      "sentence": "By noon, i had been sketching a landscape for a month.",
      "verb": "sketching"
    }
  ]
}