{
  "tense": "Past Perfect Continuous",
  "description": "Used for actions that were ongoing before another past action",
  "examples": [
    {
      "sentence": "By noon, the bird had been forgetting the birthday all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "The bird had been making pasta before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "He had been submitting the letter before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "The team had been leaving to work before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "The cat had been starting the proposal before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The bird had been listening to basketball before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "Emma had been making lunch all week.",
      "verb": "making"
    },
    {
      "sentence": "I had been reading the textbook for a week.",
      "verb": "reading"
    },
    {
      "sentence": "The teacher had been planning the situation before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, our neighbors had been planning the event all day.",
      "verb": "planning"
    },
    {
      "sentence": "Her sister had been listening to TV before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, you had been selling groceries for years.",
      "verb": "selling"
    },
    {
      "sentence": "The team had been understanding mathematics before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the bird had been watching a song all day.",
      "verb": "watching"
    },
    {
      "sentence": "The company had been running to the office for three days.",
      "verb": "running"
    },
    {
      "sentence": "My brother had been understanding the textbook before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the dog had been cleaning the garden for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, our neighbors had been calling my friend for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "My parents had been drinking coffee since morning.",
      "verb": "drinking"
    },
    {
      "sentence": "You had been eating a snack before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the team had been watching basketball all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, her sister had been driving to the park for a week.",
      "verb": "driving"
    },
    {
      "sentence": "They had been listening to the game before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been meeting the teacher for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother had been getting a present for a week.",
      "verb": "getting"
    },
    {
      "sentence": "The children had been considering the trip all day.",
      "verb": "considering"
    },
    {
      "sentence": "The company had been making lunch for three days.",
      "verb": "making"
    },
    {
      "sentence": "By noon, i had been getting flowers since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, our neighbors had been drinking breakfast since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, sarah had been watching basketball for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been leaving to the gym all day.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, she had been understanding mathematics since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, she had been finishing the assignment all day.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, you had been completing the proposal for a month.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, my parents had been enjoying a documentary all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird had been starting the project before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, my parents had been running to work since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "The company had been remembering the future for years.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird had been sending the assignment for years.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, she had been meeting the client since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma had been preparing a snack for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, you had been forgetting the birthday for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "The team had been finding a book before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "John had been finding clothes before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "The children had been sending the project before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "Tom had been listening to a documentary all day.",
      "verb": "listening"
    },
    {
      "sentence": "I had been getting the phone all week.",
      "verb": "getting"
    },
    {
      "sentence": "She had been studying grammar before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The bird had been calling the team for a month.",
      "verb": "calling"
    },
    {
      "sentence": "He had been considering the decision before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, her sister had been forgetting the trip all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tom had been eating coffee since morning.",
      "verb": "eating"
    },
    {
      "sentence": "The children had been calling the client before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "The company had been reviewing for the exam before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "Sarah had been giving the phone for a week.",
      "verb": "giving"
    },
    {
      "sentence": "The cat had been designing the car before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "Her sister had been calling the teacher for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the manager had been returning to the market all day.",
      "verb": "returning"
    },
    {
      "sentence": "Our neighbors had been returning to work for two hours.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the dog had been speaking the client for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been listening to TV before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah had been running downtown before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the students had been giving the ticket for years.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, john had been thinking about the situation for years.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, my brother had been thinking about the future all week.",
      "verb": "thinking"
    },
    {
      "sentence": "Our neighbors had been reviewing grammar before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the company had been learning the lesson since Monday.",
      "verb": "learning"
    },
    {
      "sentence": "The manager had been building the room for years.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the manager had been speaking the manager since morning.",
      "verb": "speaking"
    },
    {
      "sentence": "You had been listening to basketball all week.",
      "verb": "listening"
    },
    {
      "sentence": "I had been cleaning the garden for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, they had been making soup since morning.",
      "verb": "making"
    },
    {
      "sentence": "By noon, my brother had been remembering the future for years.",
      "verb": "remembering"
    },
    {
      "sentence": "My parents had been cleaning the bathroom before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the teacher had been cleaning the room for a month.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, i had been leaving to the gym since morning.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, we had been calling the manager for a month.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been going to the beach for a month.",
      "verb": "going"
    },
    {
      "sentence": "By noon, we had been selling the keys since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "John had been driving to work before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "My parents had been watching a documentary for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been submitting the email before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "Sarah had been thinking about the vacation for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, my brother had been considering the future for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "I had been drinking soup since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "I had been planning the problem all day.",
      "verb": "planning"
    },
    {
      "sentence": "John had been sending the proposal before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "The team had been building a website before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "They had been completing the assignment for three days.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, my friend had been teaching grammar all day.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, john had been going to the beach for years.",
      "verb": "going"
    },
    {
      "sentence": "The company had been cleaning a website before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been writing the report before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "John had been listening to basketball before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "They had been eating pasta before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister had been buying flowers all day.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the teacher had been repairing a website for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "The children had been cooking pasta for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah had been thinking about the situation since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "She had been contacting the boss since morning.",
      "verb": "contacting"
    },
    {
      "sentence": "He had been finding a laptop all week.",
      "verb": "finding"
    },
    {
      "sentence": "My friend had been coming to the gym before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "My friend had been planning the birthday since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "Sarah had been planning the trip for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "Emma had been contacting my parents all week.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, our neighbors had been talking the client all day.",
      "verb": "talking"
    },
    {
      "sentence": "My friend had been ordering dinner before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, the children had been finding a gift all week.",
      "verb": "finding"
    },
    {
      "sentence": "John had been running to the airport for two hours.",
      "verb": "running"
    },
    {
      "sentence": "John had been driving to school before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "The dog had been drawing the bathroom for a week.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the dog had been remembering the problem all day.",
      "verb": "remembering"
    },
    {
      "sentence": "My friend had been leaving to the park all day.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, our neighbors had been enjoying football for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher had been getting flowers for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, my brother had been remembering the problem since morning.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog had been writing the document for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "My friend had been giving a gift all day.",
      "verb": "giving"
    },
    {
      "sentence": "My friend had been forgetting the situation before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "You had been driving to the gym all week.",
      "verb": "driving"
    },
    {
      "sentence": "She had been practicing English since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "John had been understanding grammar before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "My parents had been repairing the room before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend had been completing the contract for three days.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, emma had been making pasta all week.",
      "verb": "making"
    },
    {
      "sentence": "You had been drawing the computer before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "Our neighbors had been cooking pasta before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog had been visiting the team before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "We had been planning the problem for a month.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the bird had been calling the doctor for years.",
      "verb": "calling"
    },
    {
      "sentence": "Emma had been cooking coffee before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "Emma had been practicing the chapter for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "My brother had been forgetting the birthday since morning.",
      "verb": "forgetting"
    },
    {
      "sentence": "The manager had been reviewing Spanish before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "They had been enjoying juice before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "She had been returning downtown for years.",
      "verb": "returning"
    },
    {
      "sentence": "The team had been visiting the doctor before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, my parents had been remembering the situation since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "My friend had been planning the trip before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "John had been watching a documentary for three days.",
      "verb": "watching"
    },
    {
      "sentence": "You had been planning the trip for a month.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the company had been eating juice for a month.",
      "verb": "eating"
    },
    {
      "sentence": "We had been preparing tea for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "She had been practicing for the exam for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the students had been returning to the store since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "The company had been returning home before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the dog had been sending the contract all week.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, we had been forgetting the vacation for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, you had been planning the vacation for a week.",
      "verb": "planning"
    },
    {
      "sentence": "Her sister had been enjoying a snack since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "We had been completing the contract before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors had been giving the phone before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "I had been practicing mathematics for years.",
      "verb": "practicing"
    },
    {
      "sentence": "Sarah had been writing the report before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, sarah had been going to the park for a month.",
      "verb": "going"
    },
    {
      "sentence": "We had been driving to the library for two hours.",
      "verb": "driving"
    },
    {
      "sentence": "Tom had been completing the document before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the teacher had been forgetting the vacation since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "The students had been playing a documentary for three days.",
      "verb": "playing"
    },
    {
      "sentence": "I had been completing the letter before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "The manager had been cooking a sandwich since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "The children had been coming to the park since morning.",
      "verb": "coming"
    },
    {
      "sentence": "The team had been selling a laptop before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "We had been reviewing English before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, you had been finishing the project all week.",
      "verb": "finishing"
    },
    {
      "sentence": "My parents had been drawing the car before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird had been playing a video for years.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been finding a present before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "I had been eating coffee before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "We had been walking to the library before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, our neighbors had been finishing the letter for three days.",
      "verb": "finishing"
    },
    {
      "sentence": "She had been making soup before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "She had been giving a new car before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "Emma had been starting the project before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "Sarah had been meeting the doctor since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "The children had been finding a gift before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, her sister had been visiting the team since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the bird had been teaching vocabulary since morning.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister had been playing tennis for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "She had been getting groceries for three days.",
      "verb": "getting"
    },
    {
      "sentence": "The cat had been contacting the doctor before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The cat had been walking to work for three days.",
      "verb": "walking"
    },
    {
      "sentence": "Tom had been fixing the kitchen for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "The team had been enjoying the news since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "I had been reviewing the chapter all week.",
      "verb": "reviewing"
    },
    {
      "sentence": "Her sister had been forgetting the meeting all day.",
      "verb": "forgetting"
    },
    {
      "sentence": "She had been starting the assignment before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, we had been meeting my friend all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, my brother had been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the students had been running to work for three days.",
      "verb": "running"
    },
    {
      "sentence": "The manager had been writing the document for three days.",
      "verb": "writing"
    },
    {
      "sentence": "The company had been playing a podcast before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been planning the trip for a month.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been listening to football for a month.",
      "verb": "listening"
    },
    {
      "sentence": "We had been watching the news since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "We had been coming to school since Monday.",
      "verb": "coming"
    },
    {
      "sentence": "I had been practicing grammar for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the cat had been sending the email since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "The dog had been finding a laptop since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher had been speaking the doctor all week.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager had been studying the lesson for three days.",
      "verb": "studying"
    },
    {
      "sentence": "The company had been thinking about the vacation for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "My brother had been enjoying a video for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, he had been sending the presentation for a month.",
      "verb": "sending"
    },
    {
      "sentence": "The dog had been selling a book for three days.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, you had been contacting my family for three days.",
      "verb": "contacting"
    },
    {
      "sentence": "The dog had been visiting the teacher since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister had been listening to football before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been walking to the park for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "John had been enjoying a podcast for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, our neighbors had been listening to basketball since morning.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah had been remembering the trip before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "My brother had been enjoying TV before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "We had been cleaning a picture before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "She had been contacting my family for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "My friend had been ordering a snack before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "My friend had been cooking tea for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, i had been leaving home all week.",
      "verb": "leaving"
    },
    {
      "sentence": "Emma had been drawing the furniture before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, john had been speaking the boss since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Sarah had been making tea since morning.",
      "verb": "making"
    },
    {
      "sentence": "By noon, you had been studying science for three days.",
      "verb": "studying"
    },
    {
      "sentence": "I had been planning the birthday for a week.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been forgetting the decision before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "They had been running to the gym before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "You had been talking my friend for a week.",
      "verb": "talking"
    },
    {
      "sentence": "My brother had been enjoying the news before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The company had been meeting my family for years.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the manager had been considering the future for a month.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, sarah had been visiting the boss since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "You had been sending the proposal before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister had been calling the client before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, my friend had been running to the library for years.",
      "verb": "running"
    },
    {
      "sentence": "Her sister had been fixing the car for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat had been submitting the letter since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, she had been contacting my family for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, we had been planning the problem since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been cleaning the room since morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, we had been calling the client since morning.",
      "verb": "calling"
    },
    {
      "sentence": "The students had been forgetting the decision before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors had been fixing a picture since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "We had been learning mathematics before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "My brother had been practicing the chapter for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "My parents had been enjoying basketball before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "Emma had been preparing lunch before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The company had been studying for the exam for years.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the bird had been calling the boss since Monday.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the team had been remembering the trip all day.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, emma had been driving to the park for two hours.",
      "verb": "driving"
    },
    {
      "sentence": "We had been completing the contract for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors had been forgetting the event before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "You had been eating pasta before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, emma had been designing the garden for a week.",
      "verb": "designing"
    },
    {
      "sentence": "Her sister had been finding the ticket before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher had been talking my friend before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "Sarah had been getting a laptop for a week.",
      "verb": "getting"
    },
    {
      "sentence": "The teacher had been designing the furniture for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "John had been watching a documentary since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, you had been flying home for a month.",
      "verb": "flying"
    },
    {
      "sentence": "Emma had been practicing history for a week.",
      "verb": "practicing"
    },
    {
      "sentence": "Tom had been cleaning a website for a week.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister had been studying mathematics before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The manager had been watching TV before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the teacher had been considering the future for years.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister had been cooking a salad before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "Her sister had been visiting the client since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "We had been calling the neighbors for years.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the students had been sending the assignment for a month.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister had been buying a present since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "You had been starting the application before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The cat had been practicing grammar for three days.",
      "verb": "practicing"
    },
    {
      "sentence": "The manager had been giving a present before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "Her sister had been reviewing science for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "My parents had been repairing a picture all week.",
      "verb": "repairing"
    },
    {
      "sentence": "Her sister had been eating lunch all day.",
      "verb": "eating"
    },
    {
      "sentence": "The manager had been fixing the room before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog had been coming home before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "By noon, the cat had been enjoying pasta all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, she had been forgetting the vacation for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "You had been walking to the store all day.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, you had been meeting the team for years.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, sarah had been walking to the library since morning.",
      "verb": "walking"
    },
    {
      "sentence": "We had been returning to the library before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the manager had been playing a song all week.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah had been learning English for three days.",
      "verb": "learning"
    },
    {
      "sentence": "John had been getting a present all week.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the cat had been reviewing vocabulary all day.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird had been planning the decision since morning.",
      "verb": "planning"
    },
    {
      "sentence": "My brother had been meeting the teacher before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager had been going to the park all week.",
      "verb": "going"
    },
    {
      "sentence": "I had been thinking about the options before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, i had been walking to work all day.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, she had been writing the task for three days.",
      "verb": "writing"
    },
    {
      "sentence": "I had been contacting the doctor for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "The children had been getting clothes all day.",
      "verb": "getting"
    },
    {
      "sentence": "Her sister had been enjoying the game before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the children had been learning mathematics for three days.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, tom had been flying to work for a month.",
      "verb": "flying"
    },
    {
      "sentence": "I had been choosing a present since morning.",
      "verb": "choosing"
    },
    {
      "sentence": "The dog had been remembering the trip before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the company had been calling the manager all week.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher had been writing the contract since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "John had been painting the garden since morning.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, he had been building the garden since morning.",
      "verb": "building"
    },
    {
      "sentence": "Tom had been remembering the decision before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, you had been giving a present since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the manager had been talking the client since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the cat had been flying to the gym all week.",
      "verb": "flying"
    },
    {
      "sentence": "My brother had been selling the ticket before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The dog had been forgetting the problem for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tom had been starting the letter before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The cat had been playing a podcast before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The dog had been planning the situation before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "She had been making pizza before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "We had been thinking about the problem before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat had been enjoying a sandwich all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, sarah had been visiting my family for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher had been writing the assignment before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "I had been reading French before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the children had been writing the presentation all day.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the teacher had been reading the lesson for a week.",
      "verb": "reading"
    },
    {
      "sentence": "The dog had been reading grammar all week.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been flying to the office before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, we had been talking the doctor for a month.",
      "verb": "talking"
    },
    {
      "sentence": "He had been choosing a gift before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird had been understanding French before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "Sarah had been leaving home before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "I had been writing the document before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been teaching the chapter before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, my friend had been choosing the phone all day.",
      "verb": "choosing"
    },
    {
      "sentence": "Tom had been building a picture for three days.",
      "verb": "building"
    },
    {
      "sentence": "The team had been starting the contract before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The cat had been fixing the kitchen for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher had been visiting the teacher since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The children had been playing tennis all day.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, i had been enjoying breakfast for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team had been enjoying coffee all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the team had been drawing a website for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat had been buying flowers before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, our neighbors had been cooking pizza since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend had been watching basketball for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been enjoying a snack all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the cat had been going to the store all day.",
      "verb": "going"
    },
    {
      "sentence": "By noon, my friend had been understanding vocabulary for two hours.",
      "verb": "understanding"
    },
    {
      "sentence": "Sarah had been speaking my parents since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the company had been drawing the bathroom for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "She had been calling my family before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "My friend had been walking to the airport for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, her sister had been listening to TV for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "The cat had been listening to a movie before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "My parents had been completing the report before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "She had been planning the future all day.",
      "verb": "planning"
    },
    {
      "sentence": "The cat had been remembering the birthday for a week.",
      "verb": "remembering"
    },
    {
      "sentence": "Her sister had been calling the doctor for years.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, our neighbors had been starting the contract for two hours.",
      "verb": "starting"
    },
    {
      "sentence": "John had been thinking about the birthday before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The manager had been receiving the project before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "Sarah had been reading the textbook since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the manager had been talking the neighbors for a week.",
      "verb": "talking"
    },
    {
      "sentence": "John had been studying for the exam for a month.",
      "verb": "studying"
    },
    {
      "sentence": "My parents had been enjoying lunch for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team had been ordering a salad since morning.",
      "verb": "ordering"
    },
    {
      "sentence": "The children had been buying a gift for a month.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, they had been planning the vacation since morning.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, he had been flying to the market for a week.",
      "verb": "flying"
    },
    {
      "sentence": "The cat had been preparing a sandwich before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird had been thinking about the vacation for years.",
      "verb": "thinking"
    },
    {
      "sentence": "My brother had been calling the teacher since morning.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been reading science since morning.",
      "verb": "reading"
    },
    {
      "sentence": "You had been remembering the future for years.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the bird had been driving to the office since Monday.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, the bird had been designing a picture for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the company had been calling my friend for years.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been drawing the bathroom since morning.",
      "verb": "drawing"
    },
    {
      "sentence": "They had been forgetting the birthday for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the company had been preparing pizza for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher had been running to the office for a month.",
      "verb": "running"
    },
    {
      "sentence": "By noon, you had been drinking tea for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister had been visiting the boss all week.",
      "verb": "visiting"
    },
    {
      "sentence": "The cat had been building the bathroom before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The company had been going to the market for two hours.",
      "verb": "going"
    },
    {
      "sentence": "She had been reading science before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the cat had been walking to school for a month.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, we had been leaving to school all week.",
      "verb": "leaving"
    },
    {
      "sentence": "We had been drawing a website before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "My parents had been remembering the decision before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the children had been sending the email for a month.",
      "verb": "sending"
    },
    {
      "sentence": "The cat had been running to the office before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Tom had been getting a gift before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "Our neighbors had been visiting my friend for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, i had been reviewing French for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird had been planning the options before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "My friend had been returning to school for years.",
      "verb": "returning"
    },
    {
      "sentence": "They had been listening to a song before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the cat had been enjoying music for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, sarah had been choosing the keys for a month.",
      "verb": "choosing"
    },
    {
      "sentence": "My parents had been finding the ticket before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, tom had been reading French all day.",
      "verb": "reading"
    },
    {
      "sentence": "The company had been playing a song since morning.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been calling my family for a week.",
      "verb": "calling"
    },
    {
      "sentence": "John had been leaving downtown all day.",
      "verb": "leaving"
    },
    {
      "sentence": "The cat had been repairing the car since morning.",
      "verb": "repairing"
    },
    {
      "sentence": "He had been learning Spanish before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, sarah had been giving groceries all day.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher had been watching music before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "The team had been making soup before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "She had been cooking a sandwich before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah had been driving to work before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "My brother had been arriving to school before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, the manager had been visiting the team for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "He had been returning to the beach before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "Tom had been selling the phone for a month.",
      "verb": "selling"
    },
    {
      "sentence": "The team had been listening to a video before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my friend had been cooking a salad for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "The team had been coming to school before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "The teacher had been reading science before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been starting the project for a month.",
      "verb": "starting"
    },
    {
      "sentence": "The manager had been receiving the presentation before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "The manager had been preparing breakfast all week.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird had been understanding science before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "Sarah had been watching a documentary all day.",
      "verb": "watching"
    },
    {
      "sentence": "John had been drinking pizza since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The team had been forgetting the birthday for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the teacher had been watching the news for years.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been flying home since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, the team had been buying a new car since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "The dog had been learning science before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, the teacher had been sending the project since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, my brother had been submitting the report since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "My friend had been reading Spanish before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The bird had been starting the presentation since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, our neighbors had been buying the ticket all week.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, sarah had been playing a podcast all day.",
      "verb": "playing"
    },
    {
      "sentence": "The cat had been designing the car since Monday.",
      "verb": "designing"
    },
    {
      "sentence": "They had been talking the teacher before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, my friend had been playing a video all week.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been listening to football for a week.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, tom had been cleaning the bathroom since morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "The team had been teaching the lesson before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "You had been talking the neighbors before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the company had been starting the letter for three days.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, she had been making a snack since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "My parents had been planning the future before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the students had been making dinner since Monday.",
      "verb": "making"
    },
    {
      "sentence": "By noon, sarah had been completing the application for three days.",
      "verb": "completing"
    },
    {
      "sentence": "The children had been finishing the application since Monday.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the cat had been planning the meeting for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "The dog had been drinking breakfast before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "I had been preparing a sandwich before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the manager had been finding the phone since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "The students had been ordering dinner since morning.",
      "verb": "ordering"
    },
    {
      "sentence": "They had been starting the email since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "We had been cooking a salad before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, the manager had been leaving to work for three days.",
      "verb": "leaving"
    },
    {
      "sentence": "My parents had been reading mathematics before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The teacher had been giving the ticket before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "They had been painting the room before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "My parents had been submitting the project before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "Our neighbors had been leaving to the office before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "I had been selling the phone before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "Tom had been enjoying pizza before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "She had been listening to football before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my parents had been teaching English since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "John had been drinking a salad since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "I had been playing TV for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The company had been forgetting the vacation since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company had been painting the garden since morning.",
      "verb": "painting"
    },
    {
      "sentence": "My friend had been enjoying tennis for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the company had been giving a book for a month.",
      "verb": "giving"
    },
    {
      "sentence": "The students had been fixing the garden for years.",
      "verb": "fixing"
    },
    {
      "sentence": "The team had been studying for the exam before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the students had been buying a present for a month.",
      "verb": "buying"
    },
    {
      "sentence": "The cat had been studying mathematics before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "You had been calling my family all week.",
      "verb": "calling"
    },
    {
      "sentence": "John had been receiving the project for three days.",
      "verb": "receiving"
    },
    {
      "sentence": "The dog had been visiting my parents before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom had been enjoying music before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom had been coming to the beach before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "He had been building the kitchen before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The students had been receiving the document before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "Tom had been thinking about the future since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, tom had been selling clothes for three days.",
      "verb": "selling"
    },
    {
      "sentence": "Sarah had been completing the email all day.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the dog had been listening to a podcast for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been starting the assignment before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "Her sister had been visiting the client before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, the students had been cleaning the car for years.",
      "verb": "cleaning"
    },
    {
      "sentence": "Sarah had been thinking about the trip all week.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, sarah had been planning the problem for three days.",
      "verb": "planning"
    },
    {
      "sentence": "You had been coming to the library for three days.",
      "verb": "coming"
    },
    {
      "sentence": "She had been submitting the application before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "You had been enjoying football for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "My brother had been remembering the situation for years.",
      "verb": "remembering"
    },
    {
      "sentence": "The children had been learning the lesson before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "She had been choosing flowers for years.",
      "verb": "choosing"
    },
    {
      "sentence": "He had been ordering soup before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "Tom had been practicing grammar before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, i had been meeting the client all week.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors had been preparing pasta for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "They had been preparing pizza before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "Tom had been receiving the report for a week.",
      "verb": "receiving"
    },
    {
      "sentence": "The cat had been enjoying a podcast before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, tom had been reviewing the chapter for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, emma had been listening to a podcast all day.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, her sister had been preparing tea since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the cat had been watching a song since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "I had been cleaning the car before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, john had been fixing a picture all day.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister had been meeting the neighbors before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, i had been buying a book for three days.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the manager had been walking to the airport for a week.",
      "verb": "walking"
    },
    {
      "sentence": "The children had been teaching the textbook before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "They had been painting the house for a month.",
      "verb": "painting"
    },
    {
      "sentence": "I had been reviewing the chapter for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the team had been making juice for a month.",
      "verb": "making"
    },
    {
      "sentence": "The cat had been completing the report for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the manager had been cooking soup for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "The team had been getting a book before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "You had been enjoying a song before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The company had been making pizza before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the dog had been visiting the team for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, tom had been studying the textbook since morning.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, you had been choosing a present all day.",
      "verb": "choosing"
    },
    {
      "sentence": "You had been choosing a present before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, you had been finishing the email since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, our neighbors had been talking the doctor for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "The bird had been submitting the assignment before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "The bird had been choosing groceries before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "My friend had been playing a video for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been meeting the manager for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the company had been buying a laptop all day.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, i had been eating a salad for years.",
      "verb": "eating"
    },
    {
      "sentence": "My parents had been finding a book for three days.",
      "verb": "finding"
    },
    {
      "sentence": "You had been planning the problem since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the bird had been reading science all day.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the students had been completing the letter since morning.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister had been submitting the task before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "He had been cleaning a website before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "We had been going downtown before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "By noon, the dog had been thinking about the decision since yesterday.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, you had been arriving downtown since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, my parents had been enjoying a song all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "You had been receiving the proposal for years.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend had been cooking tea before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "Our neighbors had been walking to the park for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, the students had been finishing the report since Monday.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the teacher had been completing the document for years.",
      "verb": "completing"
    },
    {
      "sentence": "The teacher had been considering the meeting for years.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, they had been finding a new car for a month.",
      "verb": "finding"
    },
    {
      "sentence": "The cat had been walking to the beach before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, tom had been visiting the boss all day.",
      "verb": "visiting"
    },
    {
      "sentence": "My brother had been cleaning the computer before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company had been playing TV before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, tom had been flying to the office since morning.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah had been arriving home before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "My friend had been planning the decision for years.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the company had been playing music since morning.",
      "verb": "playing"
    },
    {
      "sentence": "You had been listening to music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been walking to the park before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "The manager had been starting the assignment before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, my friend had been repairing a website since morning.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma had been selling flowers for a month.",
      "verb": "selling"
    },
    {
      "sentence": "The dog had been repairing the garden for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma had been forgetting the birthday before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "The team had been remembering the decision before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, emma had been watching a movie since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "My friend had been cooking a snack before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "My brother had been repairing the bathroom before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents had been listening to TV all day.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, our neighbors had been eating juice since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The bird had been repairing the computer for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog had been running to the beach before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, my parents had been thinking about the situation since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, emma had been finding a new car for a week.",
      "verb": "finding"
    },
    {
      "sentence": "John had been buying a gift before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, our neighbors had been contacting the teacher since morning.",
      "verb": "contacting"
    },
    {
      "sentence": "Emma had been drinking tea before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the team had been forgetting the decision for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "I had been meeting the client before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat had been reviewing for the exam for a month.",
      "verb": "reviewing"
    },
    {
      "sentence": "He had been writing the assignment for years.",
      "verb": "writing"
    },
    {
      "sentence": "They had been considering the meeting before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister had been selling the ticket for a month.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, she had been starting the proposal since morning.",
      "verb": "starting"
    },
    {
      "sentence": "The bird had been returning to the park before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "The manager had been making a sandwich since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "He had been ordering lunch before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, they had been driving downtown all day.",
      "verb": "driving"
    },
    {
      "sentence": "Sarah had been forgetting the future before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "My brother had been thinking about the meeting before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "They had been meeting the manager for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "You had been learning the chapter before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, her sister had been writing the project all day.",
      "verb": "writing"
    },
    {
      "sentence": "Emma had been playing football since morning.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been receiving the assignment for a month.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, i had been finding the ticket for three days.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, tom had been practicing science since morning.",
      "verb": "practicing"
    },
    {
      "sentence": "My parents had been calling the neighbors for a week.",
      "verb": "calling"
    },
    {
      "sentence": "She had been painting a picture since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "Emma had been visiting my friend since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors had been designing the garden since Monday.",
      "verb": "designing"
    },
    {
      "sentence": "My parents had been making tea for a month.",
      "verb": "making"
    },
    {
      "sentence": "The children had been teaching vocabulary before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "Her sister had been playing a documentary before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My friend had been watching basketball all day.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister had been drinking lunch before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, john had been enjoying a documentary since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, sarah had been speaking the boss for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird had been flying to the store before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "The students had been making soup all week.",
      "verb": "making"
    },
    {
      "sentence": "By noon, tom had been learning Spanish for two hours.",
      "verb": "learning"
    },
    {
      "sentence": "The company had been ordering a snack before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, the manager had been reading for the exam for years.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, they had been making a sandwich since morning.",
      "verb": "making"
    },
    {
      "sentence": "By noon, the students had been cleaning the furniture all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "The students had been contacting the teacher before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The children had been building the computer all week.",
      "verb": "building"
    },
    {
      "sentence": "Her sister had been designing a picture before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the children had been choosing the phone all week.",
      "verb": "choosing"
    },
    {
      "sentence": "The team had been preparing a salad for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "The manager had been considering the event before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "My parents had been driving to the park before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "My brother had been giving a new car before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "The manager had been forgetting the situation before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Emma had been building a website for years.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors had been drawing a website for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah had been returning to the office before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, my parents had been considering the decision for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the manager had been visiting my friend since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "The children had been building a website for a week.",
      "verb": "building"
    },
    {
      "sentence": "The cat had been contacting my family before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "I had been drinking a salad before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend had been reading English for three days.",
      "verb": "reading"
    },
    {
      "sentence": "The dog had been drawing the room before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "The teacher had been choosing the keys before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "The children had been watching tennis for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The students had been reading mathematics before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been driving downtown for two hours.",
      "verb": "driving"
    },
    {
      "sentence": "My parents had been speaking the manager since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "The company had been returning to the beach since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "The company had been sending the project since yesterday.",
      "verb": "sending"
    },
    {
      "sentence": "You had been drinking a snack before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, our neighbors had been teaching vocabulary since morning.",
      "verb": "teaching"
    },
    {
      "sentence": "John had been watching a video all week.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah had been teaching Spanish for two hours.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, my friend had been talking the teacher since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "I had been receiving the letter before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, the team had been cooking juice for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "You had been remembering the future for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "We had been listening to a video before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the teacher had been building the car all week.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the children had been practicing history since morning.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher had been planning the trip before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the manager had been fixing the computer all day.",
      "verb": "fixing"
    },
    {
      "sentence": "My friend had been sending the proposal before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "The company had been coming to the gym since yesterday.",
      "verb": "coming"
    },
    {
      "sentence": "John had been talking my friend before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "He had been reading the textbook since morning.",
      "verb": "reading"
    },
    {
      "sentence": "The cat had been giving clothes before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "The children had been listening to a movie before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The cat had been enjoying lunch before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team had been writing the assignment for three days.",
      "verb": "writing"
    },
    {
      "sentence": "The dog had been finding flowers since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "Emma had been contacting the neighbors before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The bird had been finding the phone since morning.",
      "verb": "finding"
    },
    {
      "sentence": "The team had been remembering the vacation before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "They had been watching a podcast before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, sarah had been playing basketball since morning.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been calling the boss for three days.",
      "verb": "calling"
    },
    {
      "sentence": "The children had been fixing the kitchen before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "You had been repairing the furniture before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "Her sister had been coming to the market before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "You had been visiting my friend for years.",
      "verb": "visiting"
    },
    {
      "sentence": "The manager had been receiving the contract for a month.",
      "verb": "receiving"
    },
    {
      "sentence": "Tom had been getting groceries before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "The cat had been remembering the future since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "I had been walking to work for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, they had been teaching science for a week.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, tom had been considering the birthday since morning.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the company had been selling a book since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "My brother had been watching football for three days.",
      "verb": "watching"
    },
    {
      "sentence": "She had been learning vocabulary all day.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, the manager had been going home since yesterday.",
      "verb": "going"
    },
    {
      "sentence": "The teacher had been watching a movie before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "She had been receiving the letter since morning.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, emma had been repairing the kitchen for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the company had been receiving the presentation all day.",
      "verb": "receiving"
    },
    {
      "sentence": "The bird had been meeting my parents before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "Her sister had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Sarah had been buying a gift for a month.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, they had been designing the computer for a month.",
      "verb": "designing"
    },
    {
      "sentence": "They had been buying the keys for three days.",
      "verb": "buying"
    },
    {
      "sentence": "My brother had been drawing the kitchen before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the dog had been drinking dinner all week.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, emma had been understanding the textbook all day.",
      "verb": "understanding"
    },
    {
      "sentence": "John had been forgetting the options before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "My friend had been talking the boss before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "They had been buying a gift before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The students had been sending the report for three days.",
      "verb": "sending"
    },
    {
      "sentence": "I had been talking the neighbors for a month.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, you had been repairing a picture all day.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher had been planning the situation for three days.",
      "verb": "planning"
    },
    {
      "sentence": "The dog had been finishing the presentation since yesterday.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, john had been driving to the gym since morning.",
      "verb": "driving"
    },
    {
      "sentence": "Our neighbors had been writing the report before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the teacher had been ordering pasta for years.",
      "verb": "ordering"
    },
    {
      "sentence": "The teacher had been enjoying a sandwich before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the company had been ordering tea all day.",
      "verb": "ordering"
    },
    {
      "sentence": "Her sister had been running to the park all week.",
      "verb": "running"
    },
    {
      "sentence": "He had been listening to TV before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "They had been thinking about the decision since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "We had been enjoying the news before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "She had been designing the room all day.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, my friend had been cleaning a website since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "They had been ordering pasta before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "The bird had been starting the document before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "She had been forgetting the birthday before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "You had been returning to the market all day.",
      "verb": "returning"
    },
    {
      "sentence": "The dog had been studying history for three days.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the teacher had been getting clothes since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "They had been giving the keys before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the bird had been making breakfast since Monday.",
      "verb": "making"
    },
    {
      "sentence": "The students had been thinking about the vacation for years.",
      "verb": "thinking"
    },
    {
      "sentence": "The students had been remembering the trip before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "Our neighbors had been listening to a podcast since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the manager had been fixing a picture since Monday.",
      "verb": "fixing"
    },
    {
      "sentence": "John had been cooking coffee before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The team had been talking the doctor since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "I had been coming to the airport before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "The manager had been meeting my friend for years.",
      "verb": "meeting"
    },
    {
      "sentence": "The team had been thinking about the problem all week.",
      "verb": "thinking"
    },
    {
      "sentence": "My parents had been designing the house for a month.",
      "verb": "designing"
    },
    {
      "sentence": "My friend had been enjoying basketball for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "He had been forgetting the meeting for a month.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the students had been selling a laptop all week.",
      "verb": "selling"
    },
    {
      "sentence": "John had been visiting my friend since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "The dog had been understanding for the exam before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "She had been practicing Spanish since yesterday.",
      "verb": "practicing"
    },
    {
      "sentence": "Tom had been driving to the park before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "She had been meeting my friend before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma had been cooking breakfast since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, the company had been repairing the furniture all day.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat had been finding a gift before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "We had been completing the document since Monday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the manager had been studying science since morning.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the bird had been leaving to the library for a month.",
      "verb": "leaving"
    },
    {
      "sentence": "The children had been contacting the doctor before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the children had been considering the meeting since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister had been writing the email before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been choosing a new car before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, the teacher had been coming to the library all week.",
      "verb": "coming"
    },
    {
      "sentence": "The bird had been painting the house before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, i had been playing the game all week.",
      "verb": "playing"
    },
    {
      "sentence": "He had been writing the report all week.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the dog had been talking the doctor since morning.",
      "verb": "talking"
    },
    {
      "sentence": "The students had been leaving to the airport for two hours.",
      "verb": "leaving"
    },
    {
      "sentence": "The company had been playing a video for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been running to the office all week.",
      "verb": "running"
    },
    {
      "sentence": "The dog had been reviewing vocabulary before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, we had been playing a movie since morning.",
      "verb": "playing"
    },
    {
      "sentence": "I had been returning to the park before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "Her sister had been building the garden since morning.",
      "verb": "building"
    },
    {
      "sentence": "He had been selling the ticket for three days.",
      "verb": "selling"
    },
    {
      "sentence": "Her sister had been finding the keys before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "The team had been arriving to the airport before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, the children had been eating a snack all week.",
      "verb": "eating"
    },
    {
      "sentence": "Emma had been eating dinner before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the manager had been returning to school all week.",
      "verb": "returning"
    },
    {
      "sentence": "My brother had been finding a laptop before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "She had been drinking a salad before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The company had been reviewing science before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the students had been visiting the team since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors had been remembering the vacation since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog had been designing the garden since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "Tom had been listening to a documentary all week.",
      "verb": "listening"
    },
    {
      "sentence": "He had been enjoying breakfast since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "He had been walking to the store before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "You had been fixing the kitchen before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the company had been eating a salad for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, her sister had been flying downtown for three days.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah had been listening to the game before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "We had been ordering juice all day.",
      "verb": "ordering"
    },
    {
      "sentence": "She had been drinking pasta before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "You had been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, they had been repairing the room for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "She had been remembering the vacation before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The students had been enjoying a snack before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the dog had been fixing the car all week.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the students had been writing the contract for two hours.",
      "verb": "writing"
    },
    {
      "sentence": "The cat had been forgetting the meeting before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, i had been choosing a new car for years.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, the students had been eating breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, the children had been planning the future for years.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the teacher had been walking to the market all day.",
      "verb": "walking"
    },
    {
      "sentence": "The bird had been enjoying a documentary before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the manager had been meeting the boss for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, john had been making pizza for a month.",
      "verb": "making"
    },
    {
      "sentence": "By noon, my friend had been talking my family since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "Our neighbors had been speaking the team all week.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher had been reading mathematics before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "She had been fixing the car before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog had been preparing dinner for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, sarah had been playing football for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "You had been contacting the client before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager had been finding groceries since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, i had been enjoying a song for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the team had been considering the trip for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "The cat had been forgetting the decision all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah had been practicing English for years.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher had been preparing soup since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "She had been remembering the meeting for years.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat had been completing the email before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "The bird had been teaching science since morning.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, my brother had been considering the problem for three days.",
      "verb": "considering"
    },
    {
      "sentence": "The teacher had been talking my family all week.",
      "verb": "talking"
    },
    {
      "sentence": "They had been preparing coffee all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister had been fixing a picture all week.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother had been choosing groceries before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, emma had been writing the task since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "The dog had been fixing the house since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the dog had been buying flowers since morning.",
      "verb": "buying"
    },
    {
      "sentence": "My friend had been learning the chapter before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "My brother had been forgetting the future before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Emma had been listening to the news before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, we had been forgetting the birthday for two hours.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah had been flying to work before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "Emma had been fixing the house before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher had been giving a gift since Monday.",
      "verb": "giving"
    },
    {
      "sentence": "The cat had been calling my family since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "The team had been listening to the game for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The dog had been finding the ticket for years.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, the bird had been reviewing history all week.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the dog had been watching the game all day.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, tom had been talking the teacher all week.",
      "verb": "talking"
    },
    {
      "sentence": "You had been thinking about the problem before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "The dog had been walking to the library all week.",
      "verb": "walking"
    },
    {
      "sentence": "The company had been designing the car for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "My brother had been eating pizza before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "Tom had been running to the airport all week.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the children had been preparing lunch for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "The team had been meeting the teacher for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "They had been enjoying a podcast before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the cat had been writing the letter for a month.",
      "verb": "writing"
    },
    {
      "sentence": "My brother had been speaking the team for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the company had been buying a gift for two hours.",
      "verb": "buying"
    },
    {
      "sentence": "Her sister had been sending the email before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, her sister had been repairing the computer for years.",
      "verb": "repairing"
    },
    {
      "sentence": "John had been choosing clothes before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "You had been building the furniture before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "By noon, my parents had been watching football all week.",
      "verb": "watching"
    },
    {
      "sentence": "They had been meeting the team before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, tom had been finishing the document since yesterday.",
      "verb": "finishing"
    },
    {
      "sentence": "My parents had been designing the room for a week.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the children had been enjoying a movie all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the children had been contacting my parents for a month.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors had been considering the trip for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "The company had been getting the keys all day.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the team had been painting the furniture for a month.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, john had been choosing the phone for a month.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother had been playing TV all day.",
      "verb": "playing"
    },
    {
      "sentence": "The manager had been eating a sandwich before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "John had been drawing the car for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, john had been finishing the presentation since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager had been forgetting the trip before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors had been thinking about the birthday for a week.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the company had been finishing the project all day.",
      "verb": "finishing"
    },
    {
      "sentence": "Her sister had been calling the client all week.",
      "verb": "calling"
    },
    {
      "sentence": "Sarah had been learning science all day.",
      "verb": "learning"
    },
    {
      "sentence": "I had been watching a podcast before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the company had been buying the keys since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "The bird had been remembering the situation before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "I had been understanding the lesson for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "He had been driving to the office for a week.",
      "verb": "driving"
    },
    {
      "sentence": "I had been listening to a documentary before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah had been completing the report all day.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, tom had been thinking about the situation all day.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, my brother had been reading the lesson all week.",
      "verb": "reading"
    },
    {
      "sentence": "The dog had been forgetting the trip before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents had been cooking dinner before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The children had been giving clothes for three days.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher had been playing a podcast before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, he had been selling a new car since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the team had been arriving to school since yesterday.",
      "verb": "arriving"
    },
    {
      "sentence": "The team had been playing a song since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "John had been selling a laptop for three days.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the teacher had been repairing the car for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the students had been preparing a salad since morning.",
      "verb": "preparing"
    },
    {
      "sentence": "He had been finishing the email before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "The company had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, you had been speaking the neighbors since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "He had been receiving the assignment before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "My brother had been cleaning the car before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the company had been practicing science for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "The teacher had been building the room since morning.",
      "verb": "building"
    },
    {
      "sentence": "My brother had been drinking a snack for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah had been watching a song before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, you had been giving the ticket for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the teacher had been listening to a song all day.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, her sister had been choosing a book for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "He had been leaving to the office for years.",
      "verb": "leaving"
    },
    {
      "sentence": "The dog had been enjoying a video before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The manager had been finishing the presentation for a week.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, they had been arriving to the office for a week.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, my friend had been driving to the library all day.",
      "verb": "driving"
    },
    {
      "sentence": "The students had been running downtown before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "By noon, our neighbors had been thinking about the event all week.",
      "verb": "thinking"
    },
    {
      "sentence": "The manager had been walking to the store before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "They had been choosing the keys before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "The students had been flying to the airport before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "My parents had been eating pasta all day.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been building a website all day.",
      "verb": "building"
    },
    {
      "sentence": "The children had been contacting the client before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The students had been leaving to the store before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "We had been designing the house for a week.",
      "verb": "designing"
    },
    {
      "sentence": "I had been cooking juice since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "I had been calling the manager for three days.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, i had been fixing the furniture for three days.",
      "verb": "fixing"
    },
    {
      "sentence": "You had been remembering the decision since yesterday.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the team had been ordering a snack for three days.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, my parents had been visiting the teacher for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister had been submitting the application since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "My parents had been listening to a movie since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my brother had been reading the lesson since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the students had been drawing a website for years.",
      "verb": "drawing"
    },
    {
      "sentence": "He had been coming to the beach all week.",
      "verb": "coming"
    },
    {
      "sentence": "The bird had been playing a song all day.",
      "verb": "playing"
    },
    {
      "sentence": "Tom had been ordering juice all day.",
      "verb": "ordering"
    },
    {
      "sentence": "My parents had been planning the birthday before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "The children had been reviewing vocabulary for a month.",
      "verb": "reviewing"
    },
    {
      "sentence": "Sarah had been going downtown since morning.",
      "verb": "going"
    },
    {
      "sentence": "By noon, she had been understanding science since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, emma had been enjoying a documentary since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "My friend had been painting the house before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the children had been listening to the news since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, our neighbors had been cleaning the computer for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "You had been meeting the boss all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the teacher had been enjoying breakfast all week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, my brother had been writing the proposal for three days.",
      "verb": "writing"
    },
    {
      "sentence": "The manager had been talking the teacher before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "She had been drinking lunch before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The company had been enjoying tennis for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the cat had been sending the task since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "You had been painting the bathroom before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "Emma had been finishing the letter before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "I had been making juice before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "The dog had been cleaning the garden all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company had been enjoying the game before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, you had been walking to school for three days.",
      "verb": "walking"
    },
    {
      "sentence": "Emma had been writing the project for years.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, they had been cleaning the furniture for years.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog had been remembering the options since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "Her sister had been sending the task for a month.",
      "verb": "sending"
    },
    {
      "sentence": "They had been calling my friend all week.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been getting the phone before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, my parents had been ordering lunch all week.",
      "verb": "ordering"
    },
    {
      "sentence": "Tom had been choosing the keys before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors had been completing the letter before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors had been learning history before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, you had been cooking dinner all day.",
      "verb": "cooking"
    },
    {
      "sentence": "John had been receiving the assignment before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, we had been understanding vocabulary since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "John had been leaving to the library since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "She had been submitting the assignment before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, she had been visiting the boss for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher had been eating breakfast for three days.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, emma had been receiving the assignment for three days.",
      "verb": "receiving"
    },
    {
      "sentence": "They had been preparing soup for two hours.",
      "verb": "preparing"
    },
    {
      "sentence": "I had been remembering the decision before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "Sarah had been selling a book for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "I had been choosing clothes for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, john had been watching TV all week.",
      "verb": "watching"
    },
    {
      "sentence": "The cat had been finding a book before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "The children had been flying to the airport since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, you had been getting a gift for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "Tom had been walking to the beach since morning.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, her sister had been calling the doctor for years.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the cat had been calling the neighbors since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "They had been designing the computer before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, john had been designing the computer for a week.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the dog had been designing a website all day.",
      "verb": "designing"
    },
    {
      "sentence": "The teacher had been finding flowers for two hours.",
      "verb": "finding"
    },
    {
      "sentence": "I had been selling clothes before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The team had been driving to the airport before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "The students had been cleaning the bathroom all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the teacher had been visiting the teacher since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, emma had been preparing a snack for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, the children had been meeting the teacher for years.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma had been running to school since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "We had been listening to a movie for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The students had been getting a book for a month.",
      "verb": "getting"
    },
    {
      "sentence": "The cat had been preparing pizza before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "He had been giving a book before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "The team had been considering the problem before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "My parents had been playing a video before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been coming to the library for a month.",
      "verb": "coming"
    },
    {
      "sentence": "We had been flying to the office before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "You had been buying groceries since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "They had been studying the lesson before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The manager had been writing the document all day.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors had been meeting the manager all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, sarah had been reviewing the textbook for a week.",
      "verb": "reviewing"
    },
    {
      "sentence": "The dog had been watching tennis before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "They had been talking the doctor before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "She had been learning Spanish for a month.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, john had been playing football all day.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been enjoying music for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, she had been choosing a gift for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "Tom had been playing football for three days.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, john had been understanding vocabulary all day.",
      "verb": "understanding"
    },
    {
      "sentence": "The company had been planning the meeting before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been buying the phone for a month.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, my parents had been cleaning the kitchen all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "John had been listening to the game before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, the bird had been playing tennis since morning.",
      "verb": "playing"
    },
    {
      "sentence": "Emma had been cooking coffee for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "The children had been playing music for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, her sister had been choosing a laptop since yesterday.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, tom had been driving to school for years.",
      "verb": "driving"
    },
    {
      "sentence": "You had been making a snack for a month.",
      "verb": "making"
    },
    {
      "sentence": "Emma had been selling the keys before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "Our neighbors had been speaking the boss since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors had been drawing the room for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "The company had been painting the room before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "John had been preparing soup all day.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, tom had been giving the phone all day.",
      "verb": "giving"
    },
    {
      "sentence": "My parents had been fixing the furniture before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The students had been giving the keys since morning.",
      "verb": "giving"
    },
    {
      "sentence": "You had been completing the letter since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, tom had been finding clothes all week.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, my parents had been making a sandwich for a week.",
      "verb": "making"
    },
    {
      "sentence": "They had been submitting the presentation for a week.",
      "verb": "submitting"
    },
    {
      "sentence": "Sarah had been choosing a book for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother had been understanding English all day.",
      "verb": "understanding"
    },
    {
      "sentence": "The bird had been watching a documentary before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "He had been returning downtown before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "My brother had been eating a salad all day.",
      "verb": "eating"
    },
    {
      "sentence": "He had been designing the room all week.",
      "verb": "designing"
    },
    {
      "sentence": "The team had been building the room before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The cat had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "The dog had been selling a new car before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The company had been learning Spanish before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "The students had been designing the bathroom before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, tom had been starting the report all week.",
      "verb": "starting"
    },
    {
      "sentence": "They had been designing a picture all week.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, emma had been selling flowers for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "Our neighbors had been giving a gift since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "Sarah had been listening to TV before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The children had been talking the client all week.",
      "verb": "talking"
    },
    {
      "sentence": "Emma had been going to the beach before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "The students had been choosing clothes before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, the students had been getting flowers since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, he had been cleaning the kitchen for years.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company had been enjoying music for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "We had been drawing a picture for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the dog had been enjoying a podcast for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the cat had been driving to school for a month.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, the teacher had been cooking dinner for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, my friend had been finishing the proposal all day.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the dog had been reviewing science for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "You had been practicing vocabulary for years.",
      "verb": "practicing"
    },
    {
      "sentence": "The company had been remembering the situation since morning.",
      "verb": "remembering"
    },
    {
      "sentence": "The children had been enjoying pizza before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The team had been cooking pasta since morning.",
      "verb": "cooking"
    },
    {
      "sentence": "He had been sending the project since morning.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, the bird had been building the bathroom since Monday.",
      "verb": "building"
    },
    {
      "sentence": "The teacher had been submitting the email since yesterday.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, the bird had been speaking the client for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "They had been practicing the textbook since morning.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the students had been fixing a website all day.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, her sister had been planning the future for two hours.",
      "verb": "planning"
    },
    {
      "sentence": "You had been meeting my family before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat had been cleaning the kitchen since Monday.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the cat had been remembering the situation all week.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the company had been driving to work since morning.",
      "verb": "driving"
    },
    {
      "sentence": "He had been practicing French before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the team had been going to school since Monday.",
      "verb": "going"
    },
    {
      "sentence": "Our neighbors had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been arriving home since yesterday.",
      "verb": "arriving"
    },
    {
      "sentence": "The dog had been painting a picture before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, john had been sending the application since morning.",
      "verb": "sending"
    },
    {
      "sentence": "The students had been submitting the letter before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "You had been repairing the room before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "We had been practicing science before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "She had been drawing the bathroom before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "I had been planning the vacation before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, her sister had been meeting the team all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the team had been writing the report for years.",
      "verb": "writing"
    },
    {
      "sentence": "Her sister had been playing a podcast all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, my brother had been learning English since yesterday.",
      "verb": "learning"
    },
    {
      "sentence": "My parents had been repairing the house before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "The team had been arriving to the library for a month.",
      "verb": "arriving"
    },
    {
      "sentence": "Sarah had been sending the report since morning.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister had been considering the event before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "My friend had been planning the birthday before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "He had been playing music for years.",
      "verb": "playing"
    },
    {
      "sentence": "They had been sending the letter for a month.",
      "verb": "sending"
    },
    {
      "sentence": "John had been reviewing the textbook all day.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, the cat had been considering the decision since morning.",
      "verb": "considering"
    },
    {
      "sentence": "He had been remembering the event before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird had been ordering lunch for a week.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, we had been driving downtown all week.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, the cat had been building the computer all day.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the cat had been finishing the project since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, i had been finishing the letter for three days.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the team had been buying a laptop since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "My friend had been drinking dinner before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, the manager had been playing music for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been cleaning the bathroom before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the children had been planning the vacation all week.",
      "verb": "planning"
    },
    {
      "sentence": "The manager had been receiving the project since yesterday.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, i had been sending the presentation all day.",
      "verb": "sending"
    },
    {
      "sentence": "The dog had been repairing the house before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the bird had been enjoying tennis for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, she had been cooking pasta since yesterday.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird had been enjoying TV all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, tom had been considering the options for a week.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister had been reading the chapter since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "My parents had been enjoying dinner before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "I had been selling groceries for three days.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the dog had been selling the ticket since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "My friend had been building the bathroom all week.",
      "verb": "building"
    },
    {
      "sentence": "The teacher had been speaking my friend before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother had been fixing the kitchen since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "They had been cleaning the car for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, i had been finishing the project for years.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, we had been ordering coffee for a week.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, you had been walking to the gym for years.",
      "verb": "walking"
    },
    {
      "sentence": "My brother had been cleaning the bathroom before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "My parents had been cooking lunch for years.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, tom had been getting a new car all week.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, my parents had been listening to the game for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "My brother had been driving to the market before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "He had been building the bathroom all day.",
      "verb": "building"
    },
    {
      "sentence": "By noon, her sister had been studying mathematics for a month.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the cat had been remembering the vacation for three days.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, my parents had been forgetting the meeting for two hours.",
      "verb": "forgetting"
    },
    {
      "sentence": "The dog had been watching a video before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, he had been sending the project all week.",
      "verb": "sending"
    },
    {
      "sentence": "Sarah had been learning science before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, the manager had been enjoying TV since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, he had been returning home for a month.",
      "verb": "returning"
    },
    {
      "sentence": "The dog had been meeting the neighbors before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "John had been visiting the doctor for three days.",
      "verb": "visiting"
    },
    {
      "sentence": "The team had been contacting the manager for years.",
      "verb": "contacting"
    },
    {
      "sentence": "I had been cooking lunch before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "My brother had been going to the market since morning.",
      "verb": "going"
    },
    {
      "sentence": "The dog had been going to the market before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "The cat had been remembering the options for years.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat had been forgetting the future before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors had been visiting the doctor since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "My parents had been building the house for a month.",
      "verb": "building"
    },
    {
      "sentence": "By noon, emma had been preparing pasta for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "The children had been receiving the proposal before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "He had been flying to the library before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "The teacher had been completing the report since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "The team had been ordering lunch all week.",
      "verb": "ordering"
    },
    {
      "sentence": "They had been buying the phone since yesterday.",
      "verb": "buying"
    },
    {
      "sentence": "Our neighbors had been talking my parents for a month.",
      "verb": "talking"
    },
    {
      "sentence": "The team had been preparing a snack for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher had been building a picture before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "You had been practicing history all week.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, he had been reviewing Spanish for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, he had been watching football since morning.",
      "verb": "watching"
    },
    {
      "sentence": "Emma had been watching basketball all day.",
      "verb": "watching"
    },
    {
      "sentence": "My friend had been considering the decision before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "The teacher had been learning the textbook before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, we had been practicing vocabulary for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "The students had been ordering lunch since Monday.",
      "verb": "ordering"
    },
    {
      "sentence": "We had been making a sandwich before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "My friend had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, my friend had been making lunch all week.",
      "verb": "making"
    },
    {
      "sentence": "By noon, he had been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "The company had been getting flowers all week.",
      "verb": "getting"
    },
    {
      "sentence": "We had been understanding science before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "I had been making a salad since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "Tom had been playing a song since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "I had been reading the textbook for a month.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister had been running to school since morning.",
      "verb": "running"
    },
    {
      "sentence": "We had been talking the team for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "You had been coming to work before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "Tom had been planning the event before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "We had been contacting the teacher before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "You had been forgetting the problem before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, my brother had been listening to a video for a month.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, john had been teaching grammar for years.",
      "verb": "teaching"
    },
    {
      "sentence": "The students had been drawing the kitchen for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the bird had been understanding Spanish for three days.",
      "verb": "understanding"
    },
    {
      "sentence": "We had been painting the computer before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, my parents had been starting the report since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, the children had been watching a podcast since morning.",
      "verb": "watching"
    },
    {
      "sentence": "John had been visiting the boss for years.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, our neighbors had been speaking the manager for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors had been forgetting the options for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "The team had been drinking pasta all week.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been choosing flowers before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "He had been going to the park since Monday.",
      "verb": "going"
    },
    {
      "sentence": "Emma had been visiting my family since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The children had been completing the task before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "The students had been receiving the assignment before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "My parents had been completing the assignment all day.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the bird had been listening to basketball all week.",
      "verb": "listening"
    },
    {
      "sentence": "I had been calling the team since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "The manager had been visiting the doctor before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher had been enjoying a documentary before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, they had been meeting my family since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "They had been talking the doctor since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the team had been building the kitchen for a week.",
      "verb": "building"
    },
    {
      "sentence": "By noon, emma had been drinking juice for years.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, i had been giving the keys since morning.",
      "verb": "giving"
    },
    {
      "sentence": "The students had been repairing the garden for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager had been building the garden before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "Our neighbors had been eating a sandwich before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The students had been ordering a salad for years.",
      "verb": "ordering"
    },
    {
      "sentence": "By noon, we had been playing football all day.",
      "verb": "playing"
    },
    {
      "sentence": "He had been teaching vocabulary since yesterday.",
      "verb": "teaching"
    },
    {
      "sentence": "She had been fixing the furniture for years.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the bird had been planning the decision since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "My parents had been buying the keys before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The bird had been selling a gift for a month.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the manager had been watching TV since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "My brother had been submitting the document before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, they had been writing the project for a month.",
      "verb": "writing"
    },
    {
      "sentence": "John had been listening to a podcast since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my friend had been driving to work for years.",
      "verb": "driving"
    },
    {
      "sentence": "My parents had been reading the chapter before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been cleaning the garden before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, tom had been buying the phone since morning.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, they had been remembering the decision for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, my parents had been ordering a salad all day.",
      "verb": "ordering"
    },
    {
      "sentence": "The bird had been drinking pasta before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "The students had been buying clothes before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the dog had been watching basketball since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "We had been cleaning the bathroom for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "The manager had been learning the textbook for a week.",
      "verb": "learning"
    },
    {
      "sentence": "The cat had been planning the trip for three days.",
      "verb": "planning"
    },
    {
      "sentence": "Tom had been visiting the neighbors before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "He had been arriving to the library before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "She had been drinking a snack since morning.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, our neighbors had been practicing the lesson since morning.",
      "verb": "practicing"
    },
    {
      "sentence": "The children had been remembering the event before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "John had been receiving the proposal for years.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, the teacher had been submitting the application since morning.",
      "verb": "submitting"
    },
    {
      "sentence": "We had been speaking the boss before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "He had been visiting the team for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister had been designing the bathroom since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "The manager had been getting the keys for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "The students had been cleaning the house for years.",
      "verb": "cleaning"
    },
    {
      "sentence": "The manager had been running home for years.",
      "verb": "running"
    },
    {
      "sentence": "I had been repairing the kitchen for years.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the children had been reviewing science for a week.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, my friend had been returning to the store for a week.",
      "verb": "returning"
    },
    {
      "sentence": "My parents had been enjoying basketball for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher had been enjoying a video before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the children had been painting the kitchen for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "My brother had been starting the presentation for years.",
      "verb": "starting"
    },
    {
      "sentence": "Emma had been studying vocabulary for two hours.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the teacher had been leaving to the park for a month.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the students had been leaving to the park for years.",
      "verb": "leaving"
    },
    {
      "sentence": "My friend had been buying the ticket before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "John had been drawing the garden before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "The dog had been buying a present before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "Tom had been painting the furniture for years.",
      "verb": "painting"
    },
    {
      "sentence": "They had been making coffee before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "By noon, john had been writing the project for years.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been selling the ticket for a week.",
      "verb": "selling"
    },
    {
      "sentence": "The manager had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors had been finding flowers before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "Emma had been understanding vocabulary before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "I had been sending the presentation for a week.",
      "verb": "sending"
    },
    {
      "sentence": "She had been learning the chapter before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, we had been starting the task all week.",
      "verb": "starting"
    },
    {
      "sentence": "The children had been listening to a documentary for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Tom had been reading the chapter before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, he had been studying mathematics all week.",
      "verb": "studying"
    },
    {
      "sentence": "You had been repairing the furniture for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "The children had been speaking the neighbors for three days.",
      "verb": "speaking"
    },
    {
      "sentence": "We had been completing the document before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, my parents had been playing football since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been teaching French since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "Our neighbors had been finishing the contract before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "The cat had been buying clothes before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "They had been eating soup for a month.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister had been meeting the manager since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother had been walking to the gym all week.",
      "verb": "walking"
    },
    {
      "sentence": "They had been studying for the exam before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The students had been speaking the client before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the teacher had been cleaning the room for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "Emma had been making juice before the meeting.",
      "verb": "making"
    },
    {
      "sentence": "Our neighbors had been calling the boss before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, my brother had been finding a gift since morning.",
      "verb": "finding"
    },
    {
      "sentence": "She had been talking my friend since morning.",
      "verb": "talking"
    },
    {
      "sentence": "We had been understanding Spanish before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the students had been buying a gift for years.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, she had been choosing clothes for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "The team had been ordering dinner before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "My friend had been selling a gift all day.",
      "verb": "selling"
    },
    {
      "sentence": "Tom had been remembering the problem all day.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the students had been choosing a present for two hours.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, my friend had been buying a gift for a month.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the manager had been coming downtown all week.",
      "verb": "coming"
    },
    {
      "sentence": "The cat had been sending the assignment before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "Our neighbors had been planning the event before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Her sister had been drawing the room since morning.",
      "verb": "drawing"
    },
    {
      "sentence": "Our neighbors had been running to the beach since morning.",
      "verb": "running"
    },
    {
      "sentence": "Emma had been arriving to the office all week.",
      "verb": "arriving"
    },
    {
      "sentence": "Tom had been flying to the airport before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "Her sister had been drinking tea before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "She had been selling the ticket before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "My friend had been playing a documentary for a week.",
      "verb": "playing"
    },
    {
      "sentence": "You had been making a salad all day.",
      "verb": "making"
    },
    {
      "sentence": "The cat had been repairing the kitchen since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog had been considering the options for three days.",
      "verb": "considering"
    },
    {
      "sentence": "The cat had been listening to basketball before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been returning to the store before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the teacher had been cleaning the kitchen since morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother had been painting the garden before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the company had been preparing lunch for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher had been eating dinner for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "Tom had been repairing a picture before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, she had been listening to a movie since morning.",
      "verb": "listening"
    },
    {
      "sentence": "The bird had been playing tennis for years.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, our neighbors had been meeting the client all week.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma had been giving clothes for three days.",
      "verb": "giving"
    },
    {
      "sentence": "The cat had been building the computer for a week.",
      "verb": "building"
    },
    {
      "sentence": "Tom had been reviewing the textbook for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "The team had been drawing the house before the meeting.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, you had been preparing lunch since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "We had been studying history before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "The bird had been reading French all week.",
      "verb": "reading"
    },
    {
      "sentence": "The manager had been drinking a salad before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom had been listening to a video before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "You had been getting clothes before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the teacher had been forgetting the birthday all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Emma had been studying Spanish before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, tom had been drinking breakfast for years.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, her sister had been writing the assignment for a week.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the company had been returning home for a week.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the teacher had been building the computer for two hours.",
      "verb": "building"
    },
    {
      "sentence": "By noon, my parents had been submitting the report all week.",
      "verb": "submitting"
    },
    {
      "sentence": "The children had been starting the assignment before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, you had been planning the meeting since morning.",
      "verb": "planning"
    },
    {
      "sentence": "The students had been fixing a picture since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, the manager had been completing the report for three days.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, you had been giving a gift for years.",
      "verb": "giving"
    },
    {
      "sentence": "The cat had been writing the email since morning.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors had been finishing the project before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the children had been choosing the ticket for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, my friend had been selling a book since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "The dog had been going to the library for years.",
      "verb": "going"
    },
    {
      "sentence": "By noon, the cat had been talking my parents all day.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, they had been preparing a sandwich for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, you had been reviewing the lesson for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "You had been reviewing vocabulary before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, our neighbors had been writing the letter for years.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been preparing a sandwich all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Tom had been playing a documentary before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, she had been playing tennis since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, you had been listening to the game for three days.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, our neighbors had been contacting the boss for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors had been building a picture for years.",
      "verb": "building"
    },
    {
      "sentence": "You had been watching the game for a week.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister had been leaving to school since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "Sarah had been selling the phone before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "He had been leaving home since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the cat had been getting the phone for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "I had been writing the report before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "They had been listening to TV before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, my friend had been visiting my parents all day.",
      "verb": "visiting"
    },
    {
      "sentence": "The company had been going to school before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "Her sister had been cleaning the furniture before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "She had been writing the assignment before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "John had been playing football before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "She had been arriving to the store for a week.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, the teacher had been finding a present since yesterday.",
      "verb": "finding"
    },
    {
      "sentence": "The students had been sending the assignment all day.",
      "verb": "sending"
    },
    {
      "sentence": "My parents had been considering the situation for years.",
      "verb": "considering"
    },
    {
      "sentence": "The cat had been choosing flowers for years.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, my parents had been painting the garden for a week.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, she had been listening to basketball all week.",
      "verb": "listening"
    },
    {
      "sentence": "The team had been receiving the project for years.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, i had been getting the ticket for years.",
      "verb": "getting"
    },
    {
      "sentence": "My friend had been buying groceries for a week.",
      "verb": "buying"
    },
    {
      "sentence": "The cat had been talking the doctor before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, i had been buying a gift for a week.",
      "verb": "buying"
    },
    {
      "sentence": "The students had been talking the team before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "The children had been cooking coffee before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "The children had been sending the letter since morning.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, we had been watching basketball for years.",
      "verb": "watching"
    },
    {
      "sentence": "You had been painting the car before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "Her sister had been eating a sandwich all week.",
      "verb": "eating"
    },
    {
      "sentence": "By noon, we had been thinking about the event for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "My parents had been repairing a picture for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, emma had been driving home for a month.",
      "verb": "driving"
    },
    {
      "sentence": "The dog had been getting the ticket before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "Our neighbors had been building a picture for three days.",
      "verb": "building"
    },
    {
      "sentence": "Emma had been coming to the office before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "My parents had been learning history all week.",
      "verb": "learning"
    },
    {
      "sentence": "She had been meeting the teacher before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, our neighbors had been meeting my friend all day.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, my brother had been eating a sandwich since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "Tom had been studying vocabulary before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the bird had been eating a snack for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "They had been preparing a snack all week.",
      "verb": "preparing"
    },
    {
      "sentence": "The team had been reviewing science before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird had been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, he had been finding a book since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "Tom had been considering the future before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "Tom had been repairing a picture all week.",
      "verb": "repairing"
    },
    {
      "sentence": "The cat had been planning the future for three days.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, they had been reading the chapter since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, her sister had been painting the garden since morning.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, tom had been preparing a salad since morning.",
      "verb": "preparing"
    },
    {
      "sentence": "John had been teaching grammar for a month.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, they had been talking my family all day.",
      "verb": "talking"
    },
    {
      "sentence": "John had been driving downtown since yesterday.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, her sister had been playing a podcast all day.",
      "verb": "playing"
    },
    {
      "sentence": "My brother had been leaving to the gym for two hours.",
      "verb": "leaving"
    },
    {
      "sentence": "The children had been thinking about the future since Monday.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the team had been watching tennis since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, my brother had been going to the store all day.",
      "verb": "going"
    },
    {
      "sentence": "By noon, my friend had been finishing the proposal for a month.",
      "verb": "finishing"
    },
    {
      "sentence": "John had been playing TV before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The cat had been planning the decision all week.",
      "verb": "planning"
    },
    {
      "sentence": "My brother had been calling the teacher for a month.",
      "verb": "calling"
    },
    {
      "sentence": "The manager had been designing a picture before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "The dog had been enjoying a song for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "He had been painting the garden before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, the company had been calling the team for three days.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, my friend had been reading science for a week.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the students had been reading for the exam for years.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, the bird had been contacting the team since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "The students had been starting the report before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, i had been building the kitchen for three days.",
      "verb": "building"
    },
    {
      "sentence": "Tom had been thinking about the problem before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the team had been thinking about the options since morning.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the bird had been remembering the meeting all week.",
      "verb": "remembering"
    },
    {
      "sentence": "John had been starting the application since morning.",
      "verb": "starting"
    },
    {
      "sentence": "Emma had been playing tennis all week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, emma had been listening to a movie since morning.",
      "verb": "listening"
    },
    {
      "sentence": "John had been studying science before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the students had been ordering a sandwich since morning.",
      "verb": "ordering"
    },
    {
      "sentence": "The team had been returning to the library since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "I had been coming to the library before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "John had been forgetting the birthday for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, our neighbors had been submitting the presentation for three days.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, sarah had been arriving to the beach since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, my brother had been contacting the manager all week.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, emma had been speaking my friend since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "Sarah had been fixing the bathroom before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "The teacher had been flying to school before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "My brother had been enjoying a salad before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The teacher had been designing the house for years.",
      "verb": "designing"
    },
    {
      "sentence": "My parents had been meeting the team before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, we had been contacting the client since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "The children had been selling a gift since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "Emma had been visiting the doctor all week.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, her sister had been making juice for years.",
      "verb": "making"
    },
    {
      "sentence": "By noon, my friend had been sending the proposal for a week.",
      "verb": "sending"
    },
    {
      "sentence": "The cat had been drinking a snack for years.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my brother had been reviewing the chapter for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "The team had been preparing pasta all week.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, sarah had been contacting the boss since yesterday.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister had been playing TV before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been finishing the application before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, the students had been completing the email since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, the manager had been thinking about the trip all week.",
      "verb": "thinking"
    },
    {
      "sentence": "John had been reading the textbook for a week.",
      "verb": "reading"
    },
    {
      "sentence": "Sarah had been selling flowers since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the children had been designing the kitchen for a month.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the children had been teaching the chapter for two hours.",
      "verb": "teaching"
    },
    {
      "sentence": "The manager had been writing the presentation for a month.",
      "verb": "writing"
    },
    {
      "sentence": "Tom had been listening to a documentary for years.",
      "verb": "listening"
    },
    {
      "sentence": "The dog had been enjoying a podcast before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom had been designing the kitchen before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the dog had been understanding science for two hours.",
      "verb": "understanding"
    },
    {
      "sentence": "Tom had been starting the document since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, we had been returning to the library since Monday.",
      "verb": "returning"
    },
    {
      "sentence": "He had been receiving the email for a week.",
      "verb": "receiving"
    },
    {
      "sentence": "I had been reviewing the textbook before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, tom had been choosing the keys since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, the cat had been selling the ticket for a month.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, emma had been planning the decision for a week.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, my friend had been giving the ticket for a month.",
      "verb": "giving"
    },
    {
      "sentence": "My parents had been playing the game since morning.",
      "verb": "playing"
    },
    {
      "sentence": "The team had been choosing the phone before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "By noon, tom had been thinking about the situation for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "The dog had been painting the computer for years.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, he had been watching the news all week.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been playing a movie all week.",
      "verb": "playing"
    },
    {
      "sentence": "My parents had been teaching grammar before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "Emma had been cleaning the kitchen since morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "He had been starting the assignment before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, the manager had been drinking soup for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my brother had been choosing a gift all week.",
      "verb": "choosing"
    },
    {
      "sentence": "He had been selling clothes for a week.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, john had been watching tennis since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the bird had been contacting the manager since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, john had been reading grammar since morning.",
      "verb": "reading"
    },
    {
      "sentence": "We had been contacting the team since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the students had been reviewing for the exam since yesterday.",
      "verb": "reviewing"
    },
    {
      "sentence": "He had been calling the manager before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "My brother had been playing TV for a week.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, john had been preparing breakfast for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "We had been receiving the proposal for two hours.",
      "verb": "receiving"
    },
    {
      "sentence": "They had been learning the lesson for a week.",
      "verb": "learning"
    },
    {
      "sentence": "Her sister had been leaving to the library since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the cat had been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my friend had been painting the bathroom since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "She had been talking the manager before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "He had been forgetting the meeting all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company had been starting the report since morning.",
      "verb": "starting"
    },
    {
      "sentence": "My parents had been enjoying tennis before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, i had been coming to the park since morning.",
      "verb": "coming"
    },
    {
      "sentence": "I had been watching TV for three days.",
      "verb": "watching"
    },
    {
      "sentence": "Emma had been finding a present for a week.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, she had been considering the vacation for a week.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, her sister had been buying a book since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "Sarah had been studying science before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "We had been visiting my family before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher had been planning the future before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Our neighbors had been listening to music before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, her sister had been giving the keys all week.",
      "verb": "giving"
    },
    {
      "sentence": "The manager had been giving clothes for three days.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, i had been completing the letter all week.",
      "verb": "completing"
    },
    {
      "sentence": "John had been thinking about the meeting for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "I had been talking my friend before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the teacher had been running downtown since Monday.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the manager had been sending the presentation for three days.",
      "verb": "sending"
    },
    {
      "sentence": "The company had been playing tennis before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been listening to basketball since morning.",
      "verb": "listening"
    },
    {
      "sentence": "The team had been sending the proposal before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "The manager had been returning to the library before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "I had been planning the situation before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, my friend had been finding a gift since morning.",
      "verb": "finding"
    },
    {
      "sentence": "They had been writing the application before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, tom had been walking to school for a month.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, the children had been finding a gift for three days.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher had been talking my family before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "The company had been fixing a website for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "Emma had been painting the kitchen since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "John had been watching a video before the meeting.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, they had been reading the lesson since yesterday.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister had been reviewing the chapter for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, they had been meeting the doctor all week.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, my friend had been forgetting the situation since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "The cat had been arriving to work for years.",
      "verb": "arriving"
    },
    {
      "sentence": "The children had been returning to the store before the meeting.",
      "verb": "returning"
    },
    {
      "sentence": "The team had been reviewing the lesson for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "The students had been arriving to school for two hours.",
      "verb": "arriving"
    },
    {
      "sentence": "By noon, i had been learning English all week.",
      "verb": "learning"
    },
    {
      "sentence": "Emma had been coming to the market for years.",
      "verb": "coming"
    },
    {
      "sentence": "She had been walking to work before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "He had been selling a book all week.",
      "verb": "selling"
    },
    {
      "sentence": "John had been receiving the report before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "By noon, they had been selling a book for years.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, my parents had been learning Spanish all day.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, he had been making a sandwich for two hours.",
      "verb": "making"
    },
    {
      "sentence": "The cat had been contacting the manager before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors had been building the computer before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "We had been reading Spanish since Monday.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, emma had been contacting my parents all week.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors had been calling the manager before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the dog had been selling a laptop for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "The children had been understanding science before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "The team had been finding clothes before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, the cat had been buying the ticket since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "The teacher had been understanding the chapter before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "The dog had been preparing pizza before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The company had been listening to a documentary before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "I had been calling the doctor for a month.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, they had been cleaning the room for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company had been considering the decision before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the company had been understanding the chapter since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "The students had been considering the vacation since Monday.",
      "verb": "considering"
    },
    {
      "sentence": "She had been going to the office before the meeting.",
      "verb": "going"
    },
    {
      "sentence": "The teacher had been contacting the team for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "The company had been contacting my parents since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "The students had been practicing the lesson since yesterday.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, the students had been repairing a website since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher had been choosing the phone since yesterday.",
      "verb": "choosing"
    },
    {
      "sentence": "Emma had been speaking the boss before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "We had been understanding the textbook before the meeting.",
      "verb": "understanding"
    },
    {
      "sentence": "Her sister had been making breakfast since morning.",
      "verb": "making"
    },
    {
      "sentence": "Emma had been playing a song before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, tom had been walking to the store for two hours.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, the cat had been flying to the park since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "Tom had been choosing the phone since Monday.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors had been visiting the team since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "They had been considering the vacation before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "The team had been listening to a song before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, she had been drawing the furniture for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah had been considering the meeting since yesterday.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, you had been meeting my family since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors had been calling the boss for three days.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, sarah had been repairing a website for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma had been reading for the exam before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "The team had been building the kitchen for years.",
      "verb": "building"
    },
    {
      "sentence": "The team had been designing the kitchen before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "My brother had been visiting the client for years.",
      "verb": "visiting"
    },
    {
      "sentence": "You had been playing music for years.",
      "verb": "playing"
    },
    {
      "sentence": "The children had been planning the options before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, my friend had been enjoying a song all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird had been repairing a picture since morning.",
      "verb": "repairing"
    },
    {
      "sentence": "He had been returning to the library for a month.",
      "verb": "returning"
    },
    {
      "sentence": "He had been running to the gym before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "My friend had been drinking breakfast since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom had been considering the event before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the cat had been completing the letter since morning.",
      "verb": "completing"
    },
    {
      "sentence": "By noon, her sister had been making tea for years.",
      "verb": "making"
    },
    {
      "sentence": "The students had been speaking the client for a week.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, my friend had been remembering the future since morning.",
      "verb": "remembering"
    },
    {
      "sentence": "She had been walking to the gym before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "The children had been talking my parents before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "They had been remembering the situation all week.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, my brother had been flying to the store since yesterday.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, my friend had been getting flowers for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "The cat had been designing the kitchen for a week.",
      "verb": "designing"
    },
    {
      "sentence": "Emma had been considering the birthday all week.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the children had been watching tennis all week.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, our neighbors had been teaching English for years.",
      "verb": "teaching"
    },
    {
      "sentence": "Sarah had been talking the client for three days.",
      "verb": "talking"
    },
    {
      "sentence": "The manager had been enjoying TV for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird had been considering the birthday before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, the company had been cleaning a picture all week.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been coming to the park for a month.",
      "verb": "coming"
    },
    {
      "sentence": "My brother had been practicing the textbook before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "We had been receiving the letter since yesterday.",
      "verb": "receiving"
    },
    {
      "sentence": "You had been studying Spanish before the meeting.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, we had been speaking my parents for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the manager had been eating pasta all week.",
      "verb": "eating"
    },
    {
      "sentence": "The cat had been forgetting the meeting for two hours.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, tom had been forgetting the vacation since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "My parents had been choosing groceries before the meeting.",
      "verb": "choosing"
    },
    {
      "sentence": "My friend had been playing a podcast all week.",
      "verb": "playing"
    },
    {
      "sentence": "The bird had been cleaning the computer all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company had been cleaning the computer all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, i had been enjoying a movie since Monday.",
      "verb": "enjoying"
    },
    {
      "sentence": "The bird had been forgetting the decision before the meeting.",
      "verb": "forgetting"
    },
    {
      "sentence": "By noon, the cat had been enjoying basketball for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "Sarah had been finishing the presentation before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "Her sister had been driving to the office before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "The students had been finishing the letter before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "Tom had been enjoying lunch before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "We had been ordering breakfast before the meeting.",
      "verb": "ordering"
    },
    {
      "sentence": "My parents had been meeting the team since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "He had been buying a gift since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, emma had been leaving to school for a month.",
      "verb": "leaving"
    },
    {
      "sentence": "Emma had been finding groceries for a week.",
      "verb": "finding"
    },
    {
      "sentence": "The students had been designing a website before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, sarah had been enjoying a podcast all day.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the company had been understanding the lesson all day.",
      "verb": "understanding"
    },
    {
      "sentence": "Emma had been writing the contract before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the bird had been visiting the manager since morning.",
      "verb": "visiting"
    },
    {
      "sentence": "The cat had been reading mathematics since morning.",
      "verb": "reading"
    },
    {
      "sentence": "By noon, he had been making soup since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "By noon, you had been going to the store since Monday.",
      "verb": "going"
    },
    {
      "sentence": "By noon, you had been giving the keys for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "John had been repairing the computer before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, sarah had been planning the vacation for a month.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, the manager had been remembering the birthday since Monday.",
      "verb": "remembering"
    },
    {
      "sentence": "The company had been going to the library for a month.",
      "verb": "going"
    },
    {
      "sentence": "By noon, he had been returning to the store all week.",
      "verb": "returning"
    },
    {
      "sentence": "She had been finishing the presentation before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "By noon, we had been calling the manager since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "He had been remembering the meeting before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the teacher had been drawing the room since morning.",
      "verb": "drawing"
    },
    {
      "sentence": "By noon, the children had been reviewing English for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird had been understanding the textbook for a month.",
      "verb": "understanding"
    },
    {
      "sentence": "The students had been getting a book before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "The team had been meeting the client before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager had been drinking soup before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "By noon, my brother had been learning English for years.",
      "verb": "learning"
    },
    {
      "sentence": "The bird had been walking home since Monday.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, they had been teaching science for three days.",
      "verb": "teaching"
    },
    {
      "sentence": "You had been remembering the options all day.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat had been eating tea since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "Emma had been practicing English before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "The bird had been enjoying a documentary for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "The children had been planning the problem before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "The students had been playing a podcast for a month.",
      "verb": "playing"
    },
    {
      "sentence": "John had been learning science before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "You had been sending the report before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "Tom had been getting a gift all day.",
      "verb": "getting"
    },
    {
      "sentence": "Sarah had been listening to basketball before the meeting.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister had been getting the ticket before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, tom had been running to the office all day.",
      "verb": "running"
    },
    {
      "sentence": "The teacher had been repairing a website since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend had been receiving the assignment before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "The bird had been talking my family since Monday.",
      "verb": "talking"
    },
    {
      "sentence": "Emma had been teaching science before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "The bird had been speaking the manager before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, we had been giving a book since Monday.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, he had been considering the situation all week.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister had been enjoying a documentary before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The manager had been calling the teacher for a month.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the manager had been enjoying pizza for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents had been contacting my family for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "Our neighbors had been getting a new car since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "The children had been running downtown before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "The bird had been selling the ticket since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "The students had been listening to tennis all day.",
      "verb": "listening"
    },
    {
      "sentence": "I had been walking to the office for years.",
      "verb": "walking"
    },
    {
      "sentence": "We had been enjoying music for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "My friend had been listening to a movie since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been buying the keys before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "Emma had been cleaning the car for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been contacting my friend before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "The bird had been planning the decision for three days.",
      "verb": "planning"
    },
    {
      "sentence": "My brother had been selling a present before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "We had been listening to the game for three days.",
      "verb": "listening"
    },
    {
      "sentence": "They had been practicing the textbook before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "He had been building the furniture for a week.",
      "verb": "building"
    },
    {
      "sentence": "Her sister had been submitting the task for a month.",
      "verb": "submitting"
    },
    {
      "sentence": "Sarah had been playing a movie before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the children had been considering the options for a week.",
      "verb": "considering"
    },
    {
      "sentence": "We had been remembering the situation for a week.",
      "verb": "remembering"
    },
    {
      "sentence": "The team had been eating a salad before the meeting.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher had been submitting the task since yesterday.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, our neighbors had been fixing the computer for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, tom had been getting the keys since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "The dog had been getting flowers for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, her sister had been watching a video since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "She had been coming to the market for a week.",
      "verb": "coming"
    },
    {
      "sentence": "We had been flying to work for a month.",
      "verb": "flying"
    },
    {
      "sentence": "Sarah had been writing the assignment since morning.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the manager had been building the car since Monday.",
      "verb": "building"
    },
    {
      "sentence": "My brother had been enjoying a song for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom had been starting the project before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, john had been teaching the lesson for three days.",
      "verb": "teaching"
    },
    {
      "sentence": "My brother had been teaching mathematics all week.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, the teacher had been visiting the manager for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "John had been watching a podcast for three days.",
      "verb": "watching"
    },
    {
      "sentence": "John had been remembering the future before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the manager had been thinking about the event all week.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the team had been listening to a video for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "The company had been planning the situation for years.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, tom had been cleaning the furniture for three days.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher had been painting the furniture before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "The team had been planning the birthday before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Emma had been coming to the library for a month.",
      "verb": "coming"
    },
    {
      "sentence": "Emma had been calling the team for three days.",
      "verb": "calling"
    },
    {
      "sentence": "John had been thinking about the meeting since yesterday.",
      "verb": "thinking"
    },
    {
      "sentence": "She had been preparing pasta before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The cat had been enjoying a song before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, the cat had been choosing a laptop for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "The team had been sending the letter before the meeting.",
      "verb": "sending"
    },
    {
      "sentence": "By noon, the teacher had been driving to the gym all week.",
      "verb": "driving"
    },
    {
      "sentence": "The teacher had been planning the meeting since yesterday.",
      "verb": "planning"
    },
    {
      "sentence": "My friend had been repairing the house for years.",
      "verb": "repairing"
    },
    {
      "sentence": "She had been walking to the park before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, our neighbors had been thinking about the situation for a month.",
      "verb": "thinking"
    },
    {
      "sentence": "Sarah had been choosing the keys for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "We had been writing the assignment since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, the manager had been starting the task for a month.",
      "verb": "starting"
    },
    {
      "sentence": "We had been submitting the letter for two hours.",
      "verb": "submitting"
    },
    {
      "sentence": "They had been preparing breakfast before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird had been coming to the airport before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "Tom had been talking the client before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, emma had been enjoying TV since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, we had been eating pasta since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "My friend had been practicing the lesson before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "The company had been receiving the assignment before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "The manager had been submitting the email since Monday.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, the students had been enjoying the game since morning.",
      "verb": "enjoying"
    },
    {
      "sentence": "The company had been enjoying a documentary for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "The cat had been talking my parents before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "The manager had been thinking about the event for years.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, you had been giving a laptop for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, my friend had been getting flowers for three days.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, her sister had been understanding for the exam for a week.",
      "verb": "understanding"
    },
    {
      "sentence": "The children had been giving a new car before the meeting.",
      "verb": "giving"
    },
    {
      "sentence": "Emma had been planning the event before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "John had been starting the presentation before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "The team had been visiting the client since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, my brother had been drinking tea since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "John had been practicing history for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "My friend had been studying the lesson since morning.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, my parents had been making coffee since yesterday.",
      "verb": "making"
    },
    {
      "sentence": "Emma had been building the furniture before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The team had been listening to a video all day.",
      "verb": "listening"
    },
    {
      "sentence": "She had been planning the situation before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "We had been selling flowers before the meeting.",
      "verb": "selling"
    },
    {
      "sentence": "The company had been finishing the assignment for two hours.",
      "verb": "finishing"
    },
    {
      "sentence": "My parents had been returning to the library since Monday.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the manager had been enjoying a video for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "John had been arriving to the airport before the meeting.",
      "verb": "arriving"
    },
    {
      "sentence": "The manager had been preparing pasta for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "I had been cleaning the computer before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the manager had been giving a present for two hours.",
      "verb": "giving"
    },
    {
      "sentence": "My brother had been fixing a website since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, our neighbors had been reviewing Spanish for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, we had been making pasta for a week.",
      "verb": "making"
    },
    {
      "sentence": "We had been choosing the ticket for a month.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother had been teaching the lesson since yesterday.",
      "verb": "teaching"
    },
    {
      "sentence": "Emma had been giving clothes for years.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, her sister had been practicing the lesson since yesterday.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, her sister had been choosing clothes for years.",
      "verb": "choosing"
    },
    {
      "sentence": "Our neighbors had been finding the phone before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, we had been finding the keys all week.",
      "verb": "finding"
    },
    {
      "sentence": "My friend had been painting the kitchen before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "Our neighbors had been finishing the application before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "The students had been reading for the exam before the meeting.",
      "verb": "reading"
    },
    {
      "sentence": "Our neighbors had been leaving to the store before the meeting.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, you had been making a salad for a week.",
      "verb": "making"
    },
    {
      "sentence": "By noon, you had been finishing the document since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "My brother had been repairing the garden before the meeting.",
      "verb": "repairing"
    },
    {
      "sentence": "By noon, the manager had been playing a song since morning.",
      "verb": "playing"
    },
    {
      "sentence": "We had been painting the bathroom before the meeting.",
      "verb": "painting"
    },
    {
      "sentence": "The students had been listening to basketball for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, our neighbors had been selling a new car for a week.",
      "verb": "selling"
    },
    {
      "sentence": "We had been studying French for a month.",
      "verb": "studying"
    },
    {
      "sentence": "The children had been building the room before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "The children had been buying a book before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "Emma had been remembering the future for three days.",
      "verb": "remembering"
    },
    {
      "sentence": "Her sister had been starting the application before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, my brother had been repairing a picture for years.",
      "verb": "repairing"
    },
    {
      "sentence": "The team had been buying groceries before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "The manager had been giving a laptop since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "You had been starting the document since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, he had been driving to the office all week.",
      "verb": "driving"
    },
    {
      "sentence": "The children had been thinking about the decision for years.",
      "verb": "thinking"
    },
    {
      "sentence": "By noon, the teacher had been enjoying TV for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom had been studying the textbook for two hours.",
      "verb": "studying"
    },
    {
      "sentence": "We had been driving downtown before the meeting.",
      "verb": "driving"
    },
    {
      "sentence": "My parents had been writing the report before the meeting.",
      "verb": "writing"
    },
    {
      "sentence": "John had been receiving the presentation before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "My parents had been contacting the manager for a month.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents had been listening to a podcast for a month.",
      "verb": "listening"
    },
    {
      "sentence": "By noon, he had been talking my parents since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, sarah had been selling the keys for a week.",
      "verb": "selling"
    },
    {
      "sentence": "By noon, the manager had been studying science for years.",
      "verb": "studying"
    },
    {
      "sentence": "My parents had been enjoying TV for years.",
      "verb": "enjoying"
    },
    {
      "sentence": "He had been finding a laptop before the meeting.",
      "verb": "finding"
    },
    {
      "sentence": "By noon, the bird had been planning the event since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "The company had been visiting the teacher since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, you had been calling the doctor for a week.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, you had been enjoying football since yesterday.",
      "verb": "enjoying"
    },
    {
      "sentence": "By noon, you had been painting the kitchen since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "By noon, my friend had been learning English all day.",
      "verb": "learning"
    },
    {
      "sentence": "The manager had been meeting the manager for years.",
      "verb": "meeting"
    },
    {
      "sentence": "By noon, the manager had been watching the news since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, i had been speaking my friend since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "The children had been thinking about the situation before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "Tom had been reviewing French before the meeting.",
      "verb": "reviewing"
    },
    {
      "sentence": "The team had been planning the decision for years.",
      "verb": "planning"
    },
    {
      "sentence": "The cat had been calling my parents before the meeting.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the team had been preparing a salad since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, she had been visiting the neighbors all day.",
      "verb": "visiting"
    },
    {
      "sentence": "She had been cooking dinner before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, our neighbors had been learning mathematics since morning.",
      "verb": "learning"
    },
    {
      "sentence": "They had been sending the project all week.",
      "verb": "sending"
    },
    {
      "sentence": "Her sister had been understanding English since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "Her sister had been designing a website before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, the manager had been speaking the client for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "Sarah had been teaching Spanish for three days.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog had been practicing the chapter for two hours.",
      "verb": "practicing"
    },
    {
      "sentence": "By noon, she had been considering the problem for three days.",
      "verb": "considering"
    },
    {
      "sentence": "He had been preparing dinner before the meeting.",
      "verb": "preparing"
    },
    {
      "sentence": "By noon, our neighbors had been fixing a picture since yesterday.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, john had been studying Spanish all day.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister had been contacting the teacher for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the students had been getting a new car all day.",
      "verb": "getting"
    },
    {
      "sentence": "My friend had been calling the client for a month.",
      "verb": "calling"
    },
    {
      "sentence": "I had been finishing the email for years.",
      "verb": "finishing"
    },
    {
      "sentence": "The teacher had been remembering the meeting before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat had been playing the game for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister had been remembering the vacation before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog had been enjoying dinner for a month.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents had been cleaning the kitchen before the meeting.",
      "verb": "cleaning"
    },
    {
      "sentence": "By noon, the cat had been driving to the office all week.",
      "verb": "driving"
    },
    {
      "sentence": "By noon, john had been drawing the house since yesterday.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat had been learning French since morning.",
      "verb": "learning"
    },
    {
      "sentence": "The company had been returning to the park all week.",
      "verb": "returning"
    },
    {
      "sentence": "By noon, the students had been reading the textbook for a month.",
      "verb": "reading"
    },
    {
      "sentence": "The dog had been speaking the team since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher had been designing the bathroom before the meeting.",
      "verb": "designing"
    },
    {
      "sentence": "By noon, emma had been meeting the client since Monday.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog had been flying to work before the meeting.",
      "verb": "flying"
    },
    {
      "sentence": "They had been submitting the document before the meeting.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, i had been talking my family since morning.",
      "verb": "talking"
    },
    {
      "sentence": "Tom had been practicing the lesson for three days.",
      "verb": "practicing"
    },
    {
      "sentence": "She had been walking to school before the meeting.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, john had been running to the office for years.",
      "verb": "running"
    },
    {
      "sentence": "By noon, the dog had been drawing the computer all week.",
      "verb": "drawing"
    },
    {
      "sentence": "The company had been completing the contract before the meeting.",
      "verb": "completing"
    },
    {
      "sentence": "The students had been talking the neighbors before the meeting.",
      "verb": "talking"
    },
    {
      "sentence": "By noon, the students had been meeting the client since morning.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird had been enjoying a snack before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The company had been thinking about the future before the meeting.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma had been considering the decision before the meeting.",
      "verb": "considering"
    },
    {
      "sentence": "By noon, her sister had been getting clothes since Monday.",
      "verb": "getting"
    },
    {
      "sentence": "The company had been visiting the manager before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "He had been planning the future for a week.",
      "verb": "planning"
    },
    {
      "sentence": "By noon, john had been starting the project since yesterday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, my brother had been submitting the report for three days.",
      "verb": "submitting"
    },
    {
      "sentence": "By noon, the team had been getting a book all day.",
      "verb": "getting"
    },
    {
      "sentence": "By noon, the children had been finding a laptop for a week.",
      "verb": "finding"
    },
    {
      "sentence": "Tom had been planning the options before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "Emma had been listening to a documentary for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The team had been understanding the lesson all week.",
      "verb": "understanding"
    },
    {
      "sentence": "My brother had been drinking dinner all week.",
      "verb": "drinking"
    },
    {
      "sentence": "They had been starting the letter before the meeting.",
      "verb": "starting"
    },
    {
      "sentence": "We had been understanding English for a week.",
      "verb": "understanding"
    },
    {
      "sentence": "By noon, the cat had been enjoying the news for three days.",
      "verb": "enjoying"
    },
    {
      "sentence": "Tom had been visiting my family before the meeting.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, he had been starting the letter for two hours.",
      "verb": "starting"
    },
    {
      "sentence": "John had been learning the chapter before the meeting.",
      "verb": "learning"
    },
    {
      "sentence": "By noon, the dog had been planning the vacation for years.",
      "verb": "planning"
    },
    {
      "sentence": "She had been planning the meeting before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "The company had been studying science all week.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, emma had been remembering the vacation for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "The students had been speaking the team all week.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been starting the report since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, the company had been receiving the assignment since yesterday.",
      "verb": "receiving"
    },
    {
      "sentence": "They had been listening to a podcast for three days.",
      "verb": "listening"
    },
    {
      "sentence": "The manager had been giving a present since yesterday.",
      "verb": "giving"
    },
    {
      "sentence": "By noon, the company had been visiting my family for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "He had been finishing the letter before the meeting.",
      "verb": "finishing"
    },
    {
      "sentence": "My friend had been meeting my friend before the meeting.",
      "verb": "meeting"
    },
    {
      "sentence": "The students had been repairing the car for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "The children had been contacting the teacher since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "He had been returning to school for years.",
      "verb": "returning"
    },
    {
      "sentence": "Her sister had been building the bathroom before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "She had been contacting my friend before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "He had been coming to the beach before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "By noon, she had been calling the client for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "We had been playing basketball before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "The manager had been practicing the textbook before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "She had been learning vocabulary for a week.",
      "verb": "learning"
    },
    {
      "sentence": "Her sister had been practicing Spanish before the meeting.",
      "verb": "practicing"
    },
    {
      "sentence": "John had been practicing for the exam for a month.",
      "verb": "practicing"
    },
    {
      "sentence": "The manager had been drinking a sandwich before the meeting.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother had been coming to the gym before the meeting.",
      "verb": "coming"
    },
    {
      "sentence": "The company had been starting the task for a week.",
      "verb": "starting"
    },
    {
      "sentence": "By noon, my parents had been watching a movie for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors had been cleaning the car all day.",
      "verb": "cleaning"
    },
    {
      "sentence": "We had been contacting the team before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, emma had been selling a present since yesterday.",
      "verb": "selling"
    },
    {
      "sentence": "I had been fixing the garden before the meeting.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother had been remembering the options before the meeting.",
      "verb": "remembering"
    },
    {
      "sentence": "By noon, the dog had been running home all week.",
      "verb": "running"
    },
    {
      "sentence": "The bird had been getting flowers for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "The bird had been calling my family for three days.",
      "verb": "calling"
    },
    {
      "sentence": "He had been practicing English since Monday.",
      "verb": "practicing"
    },
    {
      "sentence": "Our neighbors had been finishing the report since morning.",
      "verb": "finishing"
    },
    {
      "sentence": "John had been calling my family for years.",
      "verb": "calling"
    },
    {
      "sentence": "By noon, the team had been talking the team for years.",
      "verb": "talking"
    },
    {
      "sentence": "Sarah had been enjoying tennis before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "The children had been walking to the market for a month.",
      "verb": "walking"
    },
    {
      "sentence": "We had been cooking tea before the meeting.",
      "verb": "cooking"
    },
    {
      "sentence": "By noon, the team had been studying the lesson since morning.",
      "verb": "studying"
    },
    {
      "sentence": "By noon, the manager had been reading science for two hours.",
      "verb": "reading"
    },
    {
      "sentence": "John had been reviewing the textbook for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "By noon, sarah had been thinking about the event for years.",
      "verb": "thinking"
    },
    {
      "sentence": "Sarah had been enjoying a snack for two hours.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents had been flying to school for two hours.",
      "verb": "flying"
    },
    {
      "sentence": "By noon, my friend had been studying history for years.",
      "verb": "studying"
    },
    {
      "sentence": "They had been running to school before the meeting.",
      "verb": "running"
    },
    {
      "sentence": "Emma had been buying the keys before the meeting.",
      "verb": "buying"
    },
    {
      "sentence": "By noon, the manager had been submitting the report for years.",
      "verb": "submitting"
    },
    {
      "sentence": "He had been getting a book before the meeting.",
      "verb": "getting"
    },
    {
      "sentence": "The dog had been considering the options for years.",
      "verb": "considering"
    },
    {
      "sentence": "The dog had been enjoying a snack before the meeting.",
      "verb": "enjoying"
    },
    {
      "sentence": "My parents had been receiving the application before the meeting.",
      "verb": "receiving"
    },
    {
      "sentence": "He had been watching football for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, you had been speaking my friend all week.",
      "verb": "speaking"
    },
    {
      "sentence": "By noon, the company had been fixing the computer for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "By noon, i had been driving to the office all week.",
      "verb": "driving"
    },
    {
      "sentence": "You had been speaking my friend before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "Emma had been building the house before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the students had been speaking the boss since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "The students had been getting a present for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "You had been thinking about the trip for three days.",
      "verb": "thinking"
    },
    {
      "sentence": "Tom had been sending the letter since Monday.",
      "verb": "sending"
    },
    {
      "sentence": "The manager had been teaching English before the meeting.",
      "verb": "teaching"
    },
    {
      "sentence": "By noon, my brother had been walking to work for a week.",
      "verb": "walking"
    },
    {
      "sentence": "By noon, sarah had been listening to music since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "Emma had been leaving to the office all week.",
      "verb": "leaving"
    },
    {
      "sentence": "By noon, the students had been walking to the beach for a month.",
      "verb": "walking"
    },
    {
      "sentence": "I had been calling the doctor since morning.",
      "verb": "calling"
    },
    {
      "sentence": "The company had been building the house before the meeting.",
      "verb": "building"
    },
    {
      "sentence": "By noon, the manager had been watching the news for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The children had been planning the trip before the meeting.",
      "verb": "planning"
    },
    {
      "sentence": "You had been speaking the neighbors before the meeting.",
      "verb": "speaking"
    },
    {
      "sentence": "She had been leaving home for years.",
      "verb": "leaving"
    },
    {
      "sentence": "My friend had been talking the client for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "We had been enjoying dinner for a week.",
      "verb": "enjoying"
    },
    {
      "sentence": "Her sister had been playing the news before the meeting.",
      "verb": "playing"
    },
    {
      "sentence": "By noon, the cat had been writing the document for a week.",
      "verb": "writing"
    },
    {
      "sentence": "By noon, her sister had been watching tennis for three days.",
      "verb": "watching"
    },
    {
      "sentence": "By noon, the dog had been calling the team for a month.",
      "verb": "calling"
    },
    {
      "sentence": "The dog had been meeting the team since yesterday.",
      "verb": "meeting"
    },
    {
      "sentence": "Tom had been buying the phone since Monday.",
      "verb": "buying"
    },
    {
      "sentence": "The teacher had been contacting the doctor before the meeting.",
      "verb": "contacting"
    },
    {
      "sentence": "By noon, the manager had been visiting the boss for two hours.",
      "verb": "visiting"
    },
    {
      "sentence": "By noon, my parents had been playing music for a month.",
      "verb": "playing"
    },
    {
      "sentence": "John had been sending the proposal all day.",
      "verb": "sending"
    },
    {
      "sentence": "John had been making coffee for two hours.",
      "verb": "making"
    },
    {
      "sentence": "By noon, john had been choosing groceries for a week.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird had been choosing flowers before the meeting.",
      "verb": "choosing"
    }
  ]
}