{
  "tense": "Present Perfect Continuous",
  "description": "Used for actions that started in the past and continue to the present",
  "examples": [
    {
      "sentence": "The teacher has been driving to school lately.",
      "verb": "driving"
    },
    {
      "sentence": "John has been leaving to the market recently.",
      "verb": "leaving"
    },
    {
      "sentence": "The teacher has been talking to the boss lately.",
      "verb": "talking"
    },
    {
      "sentence": "The students have been drinking water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom has been drinking milk all day.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been listening to jazz recently.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors have been planning the vacation lately.",
      "verb": "planning"
    },
    {
      "sentence": "I have been talking to the manager since this morning.",
      "verb": "talking"
    },
    {
      "sentence": "The manager has been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been eating dinner recently.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been chasing the toy for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors have been fixing the car recently.",
      "verb": "fixing"
    },
    {
      "sentence": "We have been talking to the client recently.",
      "verb": "talking"
    },
    {
      "sentence": "My parents have been having a sandwich recently.",
      "verb": "having"
    },
    {
      "sentence": "The manager has been speaking with the boss for years.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents have been speaking with the doctor recently.",
      "verb": "speaking"
    },
    {
      "sentence": "I have been talking to a colleague lately.",
      "verb": "talking"
    },
    {
      "sentence": "My friend has been buying flowers for a week.",
      "verb": "buying"
    },
    {
      "sentence": "The team has been announcing a new product lately.",
      "verb": "announcing"
    },
    {
      "sentence": "The children have been speaking with the professor recently.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents have been talking to the teacher for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "The cat has been chasing the mouse lately.",
      "verb": "chasing"
    },
    {
      "sentence": "I have been reading the chapter recently.",
      "verb": "reading"
    },
    {
      "sentence": "The cat has been eating the leftover food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been writing the project lately.",
      "verb": "writing"
    },
    {
      "sentence": "The dog has been eating quickly all day.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been sleeping under the table for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "She has been remembering the decision lately.",
      "verb": "remembering"
    },
    {
      "sentence": "The manager has been reviewing the textbook since this morning.",
      "verb": "reviewing"
    },
    {
      "sentence": "We have been speaking with the team lately.",
      "verb": "speaking"
    },
    {
      "sentence": "I have been making a salad lately.",
      "verb": "making"
    },
    {
      "sentence": "She has been painting a design recently.",
      "verb": "painting"
    },
    {
      "sentence": "We have been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "Tom has been seeing my family since yesterday.",
      "verb": "seeing"
    },
    {
      "sentence": "My parents have been organizing the office lately.",
      "verb": "organizing"
    },
    {
      "sentence": "The team has been releasing the software recently.",
      "verb": "releasing"
    },
    {
      "sentence": "The team has been releasing the software for two hours.",
      "verb": "releasing"
    },
    {
      "sentence": "You have been eating some fruit lately.",
      "verb": "eating"
    },
    {
      "sentence": "The manager has been watching a movie recently.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been writing the project lately.",
      "verb": "writing"
    },
    {
      "sentence": "We have been having pasta for two hours.",
      "verb": "having"
    },
    {
      "sentence": "The teacher has been drawing a landscape since Monday.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird has been chasing the toy all day.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been speaking to the team lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been creating a presentation for two hours.",
      "verb": "creating"
    },
    {
      "sentence": "I have been calling the teacher lately.",
      "verb": "calling"
    },
    {
      "sentence": "Her sister has been designing a plan for three days.",
      "verb": "designing"
    },
    {
      "sentence": "They have been building an app lately.",
      "verb": "building"
    },
    {
      "sentence": "The students have been preparing lunch recently.",
      "verb": "preparing"
    },
    {
      "sentence": "My friend has been drinking a smoothie for years.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother has been speaking to the team lately.",
      "verb": "speaking"
    },
    {
      "sentence": "You have been baking a meal recently.",
      "verb": "baking"
    },
    {
      "sentence": "The dog has been chasing its tail recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The children have been tidying the office recently.",
      "verb": "tidying"
    },
    {
      "sentence": "Her sister has been baking soup recently.",
      "verb": "baking"
    },
    {
      "sentence": "The cat has been chasing the squirrel for years.",
      "verb": "chasing"
    },
    {
      "sentence": "They have been listening to a podcast for a month.",
      "verb": "listening"
    },
    {
      "sentence": "He has been cleaning the clothes recently.",
      "verb": "cleaning"
    },
    {
      "sentence": "Sarah has been eating a meal lately.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been playing with its owner recently.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been drinking some water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "They have been playing chess recently.",
      "verb": "playing"
    },
    {
      "sentence": "My friend has been washing the room recently.",
      "verb": "washing"
    },
    {
      "sentence": "The bird has been chasing the other pets since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog has been sleeping on the couch recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "You have been cleaning the house recently.",
      "verb": "cleaning"
    },
    {
      "sentence": "The teacher has been coming to the park since yesterday.",
      "verb": "coming"
    },
    {
      "sentence": "Emma has been playing golf all week.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been contacting my parents lately.",
      "verb": "contacting"
    },
    {
      "sentence": "They have been painting a portrait recently.",
      "verb": "painting"
    },
    {
      "sentence": "The dog has been eating its food for years.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been meeting the doctor lately.",
      "verb": "meeting"
    },
    {
      "sentence": "He has been speaking to the client lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been repairing the fence recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird has been sleeping in the corner lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been texting the client recently.",
      "verb": "texting"
    },
    {
      "sentence": "The cat has been running around the house recently.",
      "verb": "running"
    },
    {
      "sentence": "The teacher has been drinking juice recently.",
      "verb": "drinking"
    },
    {
      "sentence": "I have been planning the birthday party since this morning.",
      "verb": "planning"
    },
    {
      "sentence": "My parents have been playing football lately.",
      "verb": "playing"
    },
    {
      "sentence": "The team has been winning the update lately.",
      "verb": "winning"
    },
    {
      "sentence": "Her sister has been tidying the clothes since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "He has been calling the teacher recently.",
      "verb": "calling"
    },
    {
      "sentence": "They have been drinking a smoothie all day.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents have been listening to the news recently.",
      "verb": "listening"
    },
    {
      "sentence": "Emma has been preparing the email recently.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister has been playing basketball all day.",
      "verb": "playing"
    },
    {
      "sentence": "They have been speaking to a colleague recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been going to work lately.",
      "verb": "going"
    },
    {
      "sentence": "The teacher has been coming to the airport for two hours.",
      "verb": "coming"
    },
    {
      "sentence": "He has been watching football recently.",
      "verb": "watching"
    },
    {
      "sentence": "He has been drinking juice recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The children have been watching a documentary lately.",
      "verb": "watching"
    },
    {
      "sentence": "He has been finding a new house recently.",
      "verb": "finding"
    },
    {
      "sentence": "My brother has been finishing the document recently.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager has been giving the phone for three days.",
      "verb": "giving"
    },
    {
      "sentence": "She has been seeing my friend recently.",
      "verb": "seeing"
    },
    {
      "sentence": "My brother has been playing chess for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been catching the toy lately.",
      "verb": "catching"
    },
    {
      "sentence": "Our neighbors have been watching a show for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah has been watching the match lately.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been playing in the park for three days.",
      "verb": "playing"
    },
    {
      "sentence": "My brother has been drinking a smoothie all week.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog has been playing with its owner lately.",
      "verb": "playing"
    },
    {
      "sentence": "We have been thinking about the meeting lately.",
      "verb": "thinking"
    },
    {
      "sentence": "The children have been flying to the gym lately.",
      "verb": "flying"
    },
    {
      "sentence": "They have been having dinner for three days.",
      "verb": "having"
    },
    {
      "sentence": "The team has been launching the championship recently.",
      "verb": "launching"
    },
    {
      "sentence": "My parents have been having a sandwich for three days.",
      "verb": "having"
    },
    {
      "sentence": "The students have been calling my friend lately.",
      "verb": "calling"
    },
    {
      "sentence": "You have been playing soccer lately.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been seeing an old friend recently.",
      "verb": "seeing"
    },
    {
      "sentence": "My parents have been calling the office lately.",
      "verb": "calling"
    },
    {
      "sentence": "She has been listening to jazz lately.",
      "verb": "listening"
    },
    {
      "sentence": "The bird has been playing with its owner all day.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been building a prototype for a month.",
      "verb": "building"
    },
    {
      "sentence": "The bird has been sleeping on the bed all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother has been listening to the news recently.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been talking to the teacher since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "The dog has been playing in the yard lately.",
      "verb": "playing"
    },
    {
      "sentence": "We have been fixing the bike lately.",
      "verb": "fixing"
    },
    {
      "sentence": "She has been cleaning the clothes lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "Her sister has been giving the ticket lately.",
      "verb": "giving"
    },
    {
      "sentence": "He has been listening to the lecture lately.",
      "verb": "listening"
    },
    {
      "sentence": "The children have been watching the game for three days.",
      "verb": "watching"
    },
    {
      "sentence": "She has been eating lunch all week.",
      "verb": "eating"
    },
    {
      "sentence": "My parents have been preparing the application lately.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog has been running in the yard since this morning.",
      "verb": "running"
    },
    {
      "sentence": "I have been planning the future lately.",
      "verb": "planning"
    },
    {
      "sentence": "Her sister has been traveling to school recently.",
      "verb": "traveling"
    },
    {
      "sentence": "My friend has been meeting the neighbors since this morning.",
      "verb": "meeting"
    },
    {
      "sentence": "The teacher has been reviewing the lesson lately.",
      "verb": "reviewing"
    },
    {
      "sentence": "She has been playing tennis for three days.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been driving to the store lately.",
      "verb": "driving"
    },
    {
      "sentence": "Her sister has been going to the beach since yesterday.",
      "verb": "going"
    },
    {
      "sentence": "The manager has been remembering the trip for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "My friend has been selling a book recently.",
      "verb": "selling"
    },
    {
      "sentence": "The cat has been eating some food lately.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been chasing the mouse for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "The teacher has been cooking lunch since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "They have been drinking milk lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been sleeping on the couch lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been playing the piano recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been running in the yard for years.",
      "verb": "running"
    },
    {
      "sentence": "She has been talking to the manager recently.",
      "verb": "talking"
    },
    {
      "sentence": "She has been organizing the bathroom recently.",
      "verb": "organizing"
    },
    {
      "sentence": "My parents have been listening to the lecture since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "John has been seeing the team for years.",
      "verb": "seeing"
    },
    {
      "sentence": "They have been running downtown lately.",
      "verb": "running"
    },
    {
      "sentence": "I have been drinking some water since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher has been washing the bathroom lately.",
      "verb": "washing"
    },
    {
      "sentence": "My brother has been preparing dinner lately.",
      "verb": "preparing"
    },
    {
      "sentence": "Sarah has been fixing the door lately.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother has been meeting the team recently.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother has been preparing a meal all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma has been sketching the wall lately.",
      "verb": "sketching"
    },
    {
      "sentence": "They have been deciding on the trip recently.",
      "verb": "deciding"
    },
    {
      "sentence": "He has been listening to a podcast lately.",
      "verb": "listening"
    },
    {
      "sentence": "Tom has been speaking to my family since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "The company has been announcing the deal lately.",
      "verb": "announcing"
    },
    {
      "sentence": "You have been listening to the radio for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Emma has been watching a documentary lately.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been drinking milk for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "He has been building a plan since this morning.",
      "verb": "building"
    },
    {
      "sentence": "My parents have been listening to a song for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The team has been launching the results recently.",
      "verb": "launching"
    },
    {
      "sentence": "The dog has been sleeping in the sun recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog has been running around the house lately.",
      "verb": "running"
    },
    {
      "sentence": "They have been planning the options for years.",
      "verb": "planning"
    },
    {
      "sentence": "The children have been deciding on the trip lately.",
      "verb": "deciding"
    },
    {
      "sentence": "John has been tidying the kitchen lately.",
      "verb": "tidying"
    },
    {
      "sentence": "She has been speaking with the doctor lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The team has been launching the project recently.",
      "verb": "launching"
    },
    {
      "sentence": "Sarah has been playing volleyball all day.",
      "verb": "playing"
    },
    {
      "sentence": "She has been painting a landscape lately.",
      "verb": "painting"
    },
    {
      "sentence": "They have been fixing the machine all week.",
      "verb": "fixing"
    },
    {
      "sentence": "The students have been sending the application recently.",
      "verb": "sending"
    },
    {
      "sentence": "She has been organizing the house all week.",
      "verb": "organizing"
    },
    {
      "sentence": "They have been calling customer service lately.",
      "verb": "calling"
    },
    {
      "sentence": "My friend has been teaching the chapter recently.",
      "verb": "teaching"
    },
    {
      "sentence": "Tom has been submitting the assignment lately.",
      "verb": "submitting"
    },
    {
      "sentence": "The manager has been talking to my friend since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister has been watching football recently.",
      "verb": "watching"
    },
    {
      "sentence": "My friend has been playing chess for three days.",
      "verb": "playing"
    },
    {
      "sentence": "She has been coming to the library recently.",
      "verb": "coming"
    },
    {
      "sentence": "She has been watching a documentary for a month.",
      "verb": "watching"
    },
    {
      "sentence": "My friend has been playing soccer for years.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been deciding on the trip for two hours.",
      "verb": "deciding"
    },
    {
      "sentence": "The students have been drinking milk lately.",
      "verb": "drinking"
    },
    {
      "sentence": "You have been flying to the store recently.",
      "verb": "flying"
    },
    {
      "sentence": "He has been listening to jazz recently.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been designing an app lately.",
      "verb": "designing"
    },
    {
      "sentence": "The cat has been sleeping in the sun all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The manager has been drawing a landscape lately.",
      "verb": "drawing"
    },
    {
      "sentence": "The bird has been running in circles since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "My friend has been forgetting the plan since Monday.",
      "verb": "forgetting"
    },
    {
      "sentence": "You have been cooking lunch lately.",
      "verb": "cooking"
    },
    {
      "sentence": "He has been watching the game for three days.",
      "verb": "watching"
    },
    {
      "sentence": "The manager has been arriving to the office since Monday.",
      "verb": "arriving"
    },
    {
      "sentence": "Our neighbors have been designing a website recently.",
      "verb": "designing"
    },
    {
      "sentence": "Emma has been having breakfast lately.",
      "verb": "having"
    },
    {
      "sentence": "The children have been drawing a diagram recently.",
      "verb": "drawing"
    },
    {
      "sentence": "We have been sketching the wall since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "My parents have been submitting the proposal lately.",
      "verb": "submitting"
    },
    {
      "sentence": "The manager has been sending the letter for a month.",
      "verb": "sending"
    },
    {
      "sentence": "The students have been painting a poster all week.",
      "verb": "painting"
    },
    {
      "sentence": "The children have been choosing the ticket lately.",
      "verb": "choosing"
    },
    {
      "sentence": "The dog has been eating some food recently.",
      "verb": "eating"
    },
    {
      "sentence": "Tom has been repairing the bike lately.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog has been catching the frisbee since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister has been eating pasta recently.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been eating lunch lately.",
      "verb": "eating"
    },
    {
      "sentence": "We have been contacting my family for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "My brother has been drinking juice for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been chasing the other pets lately.",
      "verb": "chasing"
    },
    {
      "sentence": "Our neighbors have been talking to the client all week.",
      "verb": "talking"
    },
    {
      "sentence": "Our neighbors have been creating an app for a month.",
      "verb": "creating"
    },
    {
      "sentence": "The teacher has been playing guitar recently.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been making lunch for a month.",
      "verb": "making"
    },
    {
      "sentence": "My parents have been speaking with my family since yesterday.",
      "verb": "speaking"
    },
    {
      "sentence": "The children have been submitting the contract lately.",
      "verb": "submitting"
    },
    {
      "sentence": "They have been designing an app lately.",
      "verb": "designing"
    },
    {
      "sentence": "My parents have been texting the office lately.",
      "verb": "texting"
    },
    {
      "sentence": "They have been drinking water all day.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher has been seeing the client recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird has been catching the ball recently.",
      "verb": "catching"
    },
    {
      "sentence": "Tom has been starting the email for a week.",
      "verb": "starting"
    },
    {
      "sentence": "She has been listening to the radio recently.",
      "verb": "listening"
    },
    {
      "sentence": "You have been speaking with the client recently.",
      "verb": "speaking"
    },
    {
      "sentence": "We have been drinking juice for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "You have been designing a plan lately.",
      "verb": "designing"
    },
    {
      "sentence": "She has been preparing the presentation since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister has been sending the proposal lately.",
      "verb": "sending"
    },
    {
      "sentence": "The cat has been catching a treat recently.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been eating its food recently.",
      "verb": "eating"
    },
    {
      "sentence": "I have been preparing the contract recently.",
      "verb": "preparing"
    },
    {
      "sentence": "Our neighbors have been fixing the machine for years.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird has been sleeping in the sun lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah has been calling the office for two hours.",
      "verb": "calling"
    },
    {
      "sentence": "The children have been emailing my parents since yesterday.",
      "verb": "emailing"
    },
    {
      "sentence": "My brother has been selling the keys for years.",
      "verb": "selling"
    },
    {
      "sentence": "The students have been deciding on the decision lately.",
      "verb": "deciding"
    },
    {
      "sentence": "She has been getting groceries for two hours.",
      "verb": "getting"
    },
    {
      "sentence": "He has been playing guitar recently.",
      "verb": "playing"
    },
    {
      "sentence": "The team has been completing the contract for years.",
      "verb": "completing"
    },
    {
      "sentence": "I have been washing the clothes lately.",
      "verb": "washing"
    },
    {
      "sentence": "I have been fixing the sink recently.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister has been deciding on the plan recently.",
      "verb": "deciding"
    },
    {
      "sentence": "She has been making soup for years.",
      "verb": "making"
    },
    {
      "sentence": "My friend has been baking rice lately.",
      "verb": "baking"
    },
    {
      "sentence": "They have been finding the phone for three days.",
      "verb": "finding"
    },
    {
      "sentence": "The dog has been running in the yard lately.",
      "verb": "running"
    },
    {
      "sentence": "The children have been drinking a smoothie lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The children have been planning the trip recently.",
      "verb": "planning"
    },
    {
      "sentence": "The dog has been sleeping on the bed for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors have been emailing my parents recently.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird has been catching the frisbee all week.",
      "verb": "catching"
    },
    {
      "sentence": "My parents have been watching football since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The bird has been catching a treat for three days.",
      "verb": "catching"
    },
    {
      "sentence": "The children have been drinking coffee recently.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been eating a snack recently.",
      "verb": "eating"
    },
    {
      "sentence": "The team has been winning a new product recently.",
      "verb": "winning"
    },
    {
      "sentence": "The bird has been sleeping by the window lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "The cat has been sleeping under the table recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother has been having a meal for two hours.",
      "verb": "having"
    },
    {
      "sentence": "My parents have been repairing the sink recently.",
      "verb": "repairing"
    },
    {
      "sentence": "We have been contacting the teacher for years.",
      "verb": "contacting"
    },
    {
      "sentence": "The cat has been eating the leftover food lately.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister has been considering the problem for a week.",
      "verb": "considering"
    },
    {
      "sentence": "The children have been listening to a podcast for three days.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been cooking a cake for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "Sarah has been cooking dinner recently.",
      "verb": "cooking"
    },
    {
      "sentence": "My brother has been reading science recently.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister has been texting the teacher recently.",
      "verb": "texting"
    },
    {
      "sentence": "The cat has been eating its food recently.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been listening to classical music since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "He has been playing soccer recently.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been chasing its tail lately.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been playing golf since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "The children have been texting the teacher all day.",
      "verb": "texting"
    },
    {
      "sentence": "The dog has been playing in the yard all day.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been chasing the ball recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The children have been drinking water for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been eating a snack lately.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "They have been having a snack for two hours.",
      "verb": "having"
    },
    {
      "sentence": "She has been tidying the car recently.",
      "verb": "tidying"
    },
    {
      "sentence": "Emma has been washing the room lately.",
      "verb": "washing"
    },
    {
      "sentence": "The bird has been eating its dinner since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "I have been listening to an audiobook recently.",
      "verb": "listening"
    },
    {
      "sentence": "The dog has been sleeping under the table recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "You have been drawing a design since Monday.",
      "verb": "drawing"
    },
    {
      "sentence": "Her sister has been cooking a salad lately.",
      "verb": "cooking"
    },
    {
      "sentence": "The dog has been running in circles lately.",
      "verb": "running"
    },
    {
      "sentence": "John has been meeting the manager recently.",
      "verb": "meeting"
    },
    {
      "sentence": "My brother has been eating pasta recently.",
      "verb": "eating"
    },
    {
      "sentence": "Tom has been contacting the team recently.",
      "verb": "contacting"
    },
    {
      "sentence": "We have been leaving to the airport lately.",
      "verb": "leaving"
    },
    {
      "sentence": "The teacher has been having a sandwich recently.",
      "verb": "having"
    },
    {
      "sentence": "The students have been watching TV since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The bird has been sleeping by the window recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "They have been choosing groceries recently.",
      "verb": "choosing"
    },
    {
      "sentence": "You have been having lunch for a week.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been eating its food for three days.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been sketching the wall lately.",
      "verb": "sketching"
    },
    {
      "sentence": "The bird has been catching the toy recently.",
      "verb": "catching"
    },
    {
      "sentence": "My brother has been calling customer service recently.",
      "verb": "calling"
    },
    {
      "sentence": "He has been calling the doctor lately.",
      "verb": "calling"
    },
    {
      "sentence": "The children have been talking to the boss lately.",
      "verb": "talking"
    },
    {
      "sentence": "My friend has been practicing the notes recently.",
      "verb": "practicing"
    },
    {
      "sentence": "The bird has been sleeping under the table since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "I have been visiting the neighbors since Monday.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher has been playing volleyball recently.",
      "verb": "playing"
    },
    {
      "sentence": "The team has been completing the update lately.",
      "verb": "completing"
    },
    {
      "sentence": "The company has been announcing the software recently.",
      "verb": "announcing"
    },
    {
      "sentence": "Her sister has been contacting the office all day.",
      "verb": "contacting"
    },
    {
      "sentence": "I have been seeing my grandmother recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The cat has been catching a treat for a month.",
      "verb": "catching"
    },
    {
      "sentence": "My friend has been baking cookies lately.",
      "verb": "baking"
    },
    {
      "sentence": "Emma has been organizing the room lately.",
      "verb": "organizing"
    },
    {
      "sentence": "Tom has been baking lunch recently.",
      "verb": "baking"
    },
    {
      "sentence": "Her sister has been speaking to the team for a month.",
      "verb": "speaking"
    },
    {
      "sentence": "We have been visiting my family since yesterday.",
      "verb": "visiting"
    },
    {
      "sentence": "The team has been developing the software lately.",
      "verb": "developing"
    },
    {
      "sentence": "The cat has been running across the field lately.",
      "verb": "running"
    },
    {
      "sentence": "He has been calling my friend since this morning.",
      "verb": "calling"
    },
    {
      "sentence": "We have been drawing a diagram recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The dog has been catching the toy recently.",
      "verb": "catching"
    },
    {
      "sentence": "The cat has been sleeping in the sun since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "She has been drinking coffee for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been texting my friend lately.",
      "verb": "texting"
    },
    {
      "sentence": "We have been playing football recently.",
      "verb": "playing"
    },
    {
      "sentence": "The students have been talking to my parents lately.",
      "verb": "talking"
    },
    {
      "sentence": "She has been fixing the car lately.",
      "verb": "fixing"
    },
    {
      "sentence": "Sarah has been playing chess lately.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been contacting my friend for a week.",
      "verb": "contacting"
    },
    {
      "sentence": "The dog has been playing in the yard recently.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been watching the news for years.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been designing a presentation recently.",
      "verb": "designing"
    },
    {
      "sentence": "You have been painting a portrait recently.",
      "verb": "painting"
    },
    {
      "sentence": "The bird has been running across the field since Monday.",
      "verb": "running"
    },
    {
      "sentence": "I have been watching football recently.",
      "verb": "watching"
    },
    {
      "sentence": "My parents have been drinking some water for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend has been meeting my parents all week.",
      "verb": "meeting"
    },
    {
      "sentence": "The manager has been playing chess lately.",
      "verb": "playing"
    },
    {
      "sentence": "You have been listening to jazz recently.",
      "verb": "listening"
    },
    {
      "sentence": "The manager has been visiting my family for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "Sarah has been creating a project for two hours.",
      "verb": "creating"
    },
    {
      "sentence": "Tom has been preparing a cake lately.",
      "verb": "preparing"
    },
    {
      "sentence": "You have been tidying the clothes recently.",
      "verb": "tidying"
    },
    {
      "sentence": "She has been organizing the office lately.",
      "verb": "organizing"
    },
    {
      "sentence": "The dog has been eating its dinner all day.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been playing with the ball lately.",
      "verb": "playing"
    },
    {
      "sentence": "She has been planning the problem lately.",
      "verb": "planning"
    },
    {
      "sentence": "You have been listening to the radio all day.",
      "verb": "listening"
    },
    {
      "sentence": "He has been preparing the application lately.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher has been having soup for two hours.",
      "verb": "having"
    },
    {
      "sentence": "Her sister has been visiting my grandmother lately.",
      "verb": "visiting"
    },
    {
      "sentence": "The company has been launching the contract recently.",
      "verb": "launching"
    },
    {
      "sentence": "The manager has been listening to an audiobook since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "We have been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "My friend has been understanding history recently.",
      "verb": "understanding"
    },
    {
      "sentence": "Her sister has been walking to the park recently.",
      "verb": "walking"
    },
    {
      "sentence": "My friend has been tidying the car for two hours.",
      "verb": "tidying"
    },
    {
      "sentence": "The teacher has been preparing cookies lately.",
      "verb": "preparing"
    },
    {
      "sentence": "He has been cleaning the garage lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company has been releasing the project lately.",
      "verb": "releasing"
    },
    {
      "sentence": "I have been building a project lately.",
      "verb": "building"
    },
    {
      "sentence": "The manager has been considering the problem recently.",
      "verb": "considering"
    },
    {
      "sentence": "The cat has been running in the yard for three days.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been playing in the garden recently.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been drawing a portrait for a month.",
      "verb": "drawing"
    },
    {
      "sentence": "She has been tidying the clothes recently.",
      "verb": "tidying"
    },
    {
      "sentence": "He has been designing a house lately.",
      "verb": "designing"
    },
    {
      "sentence": "Her sister has been meeting my friend recently.",
      "verb": "meeting"
    },
    {
      "sentence": "John has been texting the boss for three days.",
      "verb": "texting"
    },
    {
      "sentence": "Tom has been drinking milk recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The students have been playing guitar lately.",
      "verb": "playing"
    },
    {
      "sentence": "John has been listening to the radio recently.",
      "verb": "listening"
    },
    {
      "sentence": "The dog has been catching a bird lately.",
      "verb": "catching"
    },
    {
      "sentence": "My friend has been meeting the manager recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird has been chasing the other pets for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "I have been drinking a smoothie recently.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother has been leaving to school lately.",
      "verb": "leaving"
    },
    {
      "sentence": "The manager has been driving to the beach lately.",
      "verb": "driving"
    },
    {
      "sentence": "The children have been leaving to the gym lately.",
      "verb": "leaving"
    },
    {
      "sentence": "The dog has been chasing the mouse recently.",
      "verb": "chasing"
    },
    {
      "sentence": "Emma has been finding a gift recently.",
      "verb": "finding"
    },
    {
      "sentence": "You have been watching the match all week.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been sleeping in the sun lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom has been drawing a design recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The team has been developing the contract recently.",
      "verb": "developing"
    },
    {
      "sentence": "You have been cooking a meal for a week.",
      "verb": "cooking"
    },
    {
      "sentence": "Emma has been emailing the manager recently.",
      "verb": "emailing"
    },
    {
      "sentence": "My friend has been eating soup recently.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors have been writing the assignment lately.",
      "verb": "writing"
    },
    {
      "sentence": "Our neighbors have been drawing a picture recently.",
      "verb": "drawing"
    },
    {
      "sentence": "You have been contacting the doctor lately.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister has been sketching a landscape lately.",
      "verb": "sketching"
    },
    {
      "sentence": "The students have been reading the lesson lately.",
      "verb": "reading"
    },
    {
      "sentence": "Tom has been drinking water since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "The children have been forgetting the plan lately.",
      "verb": "forgetting"
    },
    {
      "sentence": "The bird has been playing with the toy for a month.",
      "verb": "playing"
    },
    {
      "sentence": "We have been watching the match lately.",
      "verb": "watching"
    },
    {
      "sentence": "He has been watching a series for a month.",
      "verb": "watching"
    },
    {
      "sentence": "They have been playing soccer lately.",
      "verb": "playing"
    },
    {
      "sentence": "The company has been releasing the championship recently.",
      "verb": "releasing"
    },
    {
      "sentence": "My parents have been listening to jazz recently.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister has been drawing the wall recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The teacher has been remembering the birthday party recently.",
      "verb": "remembering"
    },
    {
      "sentence": "Our neighbors have been writing the presentation recently.",
      "verb": "writing"
    },
    {
      "sentence": "The cat has been playing with the toy recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been chasing its tail lately.",
      "verb": "chasing"
    },
    {
      "sentence": "He has been going to the store recently.",
      "verb": "going"
    },
    {
      "sentence": "Her sister has been washing the bathroom lately.",
      "verb": "washing"
    },
    {
      "sentence": "Our neighbors have been reviewing for the exam lately.",
      "verb": "reviewing"
    },
    {
      "sentence": "The dog has been sleeping in the sun lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been sketching a landscape lately.",
      "verb": "sketching"
    },
    {
      "sentence": "They have been meeting my friend lately.",
      "verb": "meeting"
    },
    {
      "sentence": "He has been building a model lately.",
      "verb": "building"
    },
    {
      "sentence": "We have been having breakfast lately.",
      "verb": "having"
    },
    {
      "sentence": "The teacher has been drinking water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been creating a website for a month.",
      "verb": "creating"
    },
    {
      "sentence": "My parents have been learning science recently.",
      "verb": "learning"
    },
    {
      "sentence": "She has been building a presentation for a month.",
      "verb": "building"
    },
    {
      "sentence": "They have been watching football for years.",
      "verb": "watching"
    },
    {
      "sentence": "You have been submitting the document recently.",
      "verb": "submitting"
    },
    {
      "sentence": "We have been building a model since Monday.",
      "verb": "building"
    },
    {
      "sentence": "My brother has been sketching an illustration recently.",
      "verb": "sketching"
    },
    {
      "sentence": "He has been writing the proposal recently.",
      "verb": "writing"
    },
    {
      "sentence": "The children have been speaking with the teacher since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister has been submitting the email all week.",
      "verb": "submitting"
    },
    {
      "sentence": "We have been visiting the team recently.",
      "verb": "visiting"
    },
    {
      "sentence": "They have been talking to the professor since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "Emma has been watching a video since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "We have been fixing the door all day.",
      "verb": "fixing"
    },
    {
      "sentence": "My brother has been seeing the doctor lately.",
      "verb": "seeing"
    },
    {
      "sentence": "The manager has been fixing the fence all week.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat has been chasing the other pets for years.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend has been washing the room all day.",
      "verb": "washing"
    },
    {
      "sentence": "She has been visiting an old friend recently.",
      "verb": "visiting"
    },
    {
      "sentence": "I have been choosing some clothes lately.",
      "verb": "choosing"
    },
    {
      "sentence": "They have been learning French for three days.",
      "verb": "learning"
    },
    {
      "sentence": "John has been forgetting the plan lately.",
      "verb": "forgetting"
    },
    {
      "sentence": "Emma has been buying a new car lately.",
      "verb": "buying"
    },
    {
      "sentence": "Her sister has been designing a project for a week.",
      "verb": "designing"
    },
    {
      "sentence": "The bird has been catching the toy for three days.",
      "verb": "catching"
    },
    {
      "sentence": "You have been visiting an old friend lately.",
      "verb": "visiting"
    },
    {
      "sentence": "The cat has been playing in the yard lately.",
      "verb": "playing"
    },
    {
      "sentence": "They have been speaking to the neighbors since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "She has been cooking a meal lately.",
      "verb": "cooking"
    },
    {
      "sentence": "We have been calling my friend lately.",
      "verb": "calling"
    },
    {
      "sentence": "The children have been drinking coffee lately.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend has been seeing the teacher recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The cat has been sleeping all day for a week.",
      "verb": "sleeping"
    },
    {
      "sentence": "He has been remembering the future lately.",
      "verb": "remembering"
    },
    {
      "sentence": "She has been eating a meal lately.",
      "verb": "eating"
    },
    {
      "sentence": "My friend has been calling my parents recently.",
      "verb": "calling"
    },
    {
      "sentence": "The teacher has been preparing the project lately.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher has been having dinner recently.",
      "verb": "having"
    },
    {
      "sentence": "The bird has been playing with the other pets lately.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister has been designing a presentation since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "Her sister has been sketching a landscape all day.",
      "verb": "sketching"
    },
    {
      "sentence": "The cat has been running in the yard lately.",
      "verb": "running"
    },
    {
      "sentence": "The team has been completing the software lately.",
      "verb": "completing"
    },
    {
      "sentence": "Sarah has been contacting the boss recently.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager has been preparing a cake lately.",
      "verb": "preparing"
    },
    {
      "sentence": "I have been meeting my parents lately.",
      "verb": "meeting"
    },
    {
      "sentence": "Our neighbors have been submitting the letter all day.",
      "verb": "submitting"
    },
    {
      "sentence": "The cat has been sleeping all day since this morning.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah has been building a model recently.",
      "verb": "building"
    },
    {
      "sentence": "The cat has been playing in the yard since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been running in the yard for a week.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been eating some food all week.",
      "verb": "eating"
    },
    {
      "sentence": "He has been preparing breakfast for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher has been returning to the library all day.",
      "verb": "returning"
    },
    {
      "sentence": "She has been considering the vacation lately.",
      "verb": "considering"
    },
    {
      "sentence": "We have been sketching a poster recently.",
      "verb": "sketching"
    },
    {
      "sentence": "My parents have been returning home lately.",
      "verb": "returning"
    },
    {
      "sentence": "Sarah has been tidying the car recently.",
      "verb": "tidying"
    },
    {
      "sentence": "Our neighbors have been watching the match recently.",
      "verb": "watching"
    },
    {
      "sentence": "You have been understanding Spanish for years.",
      "verb": "understanding"
    },
    {
      "sentence": "My brother has been calling the office since yesterday.",
      "verb": "calling"
    },
    {
      "sentence": "The manager has been washing the dishes lately.",
      "verb": "washing"
    },
    {
      "sentence": "The cat has been sleeping on the bed for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah has been creating a house all day.",
      "verb": "creating"
    },
    {
      "sentence": "My brother has been starting the presentation for a month.",
      "verb": "starting"
    },
    {
      "sentence": "You have been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "Emma has been traveling to the market since Monday.",
      "verb": "traveling"
    },
    {
      "sentence": "The bird has been chasing the other pets all day.",
      "verb": "chasing"
    },
    {
      "sentence": "She has been baking soup lately.",
      "verb": "baking"
    },
    {
      "sentence": "Our neighbors have been listening to an audiobook recently.",
      "verb": "listening"
    },
    {
      "sentence": "We have been meeting the neighbors recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog has been running around the house for two hours.",
      "verb": "running"
    },
    {
      "sentence": "I have been building a presentation recently.",
      "verb": "building"
    },
    {
      "sentence": "My brother has been returning to the hospital recently.",
      "verb": "returning"
    },
    {
      "sentence": "My parents have been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been running in the park recently.",
      "verb": "running"
    },
    {
      "sentence": "Her sister has been drinking tea recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The company has been developing the championship recently.",
      "verb": "developing"
    },
    {
      "sentence": "The dog has been eating the leftover food lately.",
      "verb": "eating"
    },
    {
      "sentence": "They have been emailing the client for a week.",
      "verb": "emailing"
    },
    {
      "sentence": "The dog has been catching the ball since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "They have been eating a salad recently.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been eating some food recently.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been watching the game lately.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been thinking about the options lately.",
      "verb": "thinking"
    },
    {
      "sentence": "The dog has been catching a treat all week.",
      "verb": "catching"
    },
    {
      "sentence": "We have been creating a project recently.",
      "verb": "creating"
    },
    {
      "sentence": "John has been speaking to the neighbors since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat has been chasing the other pets since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "They have been getting the keys recently.",
      "verb": "getting"
    },
    {
      "sentence": "Tom has been sketching a picture recently.",
      "verb": "sketching"
    },
    {
      "sentence": "My friend has been watching TV since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "You have been watching a documentary lately.",
      "verb": "watching"
    },
    {
      "sentence": "John has been choosing the phone recently.",
      "verb": "choosing"
    },
    {
      "sentence": "Sarah has been leaving downtown since yesterday.",
      "verb": "leaving"
    },
    {
      "sentence": "You have been forgetting the event lately.",
      "verb": "forgetting"
    },
    {
      "sentence": "John has been fixing the door recently.",
      "verb": "fixing"
    },
    {
      "sentence": "They have been tidying the room all week.",
      "verb": "tidying"
    },
    {
      "sentence": "My brother has been watching a video for years.",
      "verb": "watching"
    },
    {
      "sentence": "You have been tidying the room lately.",
      "verb": "tidying"
    },
    {
      "sentence": "Emma has been sketching a diagram all week.",
      "verb": "sketching"
    },
    {
      "sentence": "The company has been announcing the deal recently.",
      "verb": "announcing"
    },
    {
      "sentence": "My parents have been tidying the room lately.",
      "verb": "tidying"
    },
    {
      "sentence": "Our neighbors have been speaking to my friend recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird has been playing with the toy lately.",
      "verb": "playing"
    },
    {
      "sentence": "They have been texting the doctor lately.",
      "verb": "texting"
    },
    {
      "sentence": "He has been understanding mathematics lately.",
      "verb": "understanding"
    },
    {
      "sentence": "My friend has been studying vocabulary lately.",
      "verb": "studying"
    },
    {
      "sentence": "She has been arriving to the store lately.",
      "verb": "arriving"
    },
    {
      "sentence": "Sarah has been playing guitar recently.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been meeting the client lately.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah has been meeting my parents for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "Her sister has been creating a house recently.",
      "verb": "creating"
    },
    {
      "sentence": "John has been drinking some water for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "He has been having soup for two hours.",
      "verb": "having"
    },
    {
      "sentence": "My brother has been playing guitar lately.",
      "verb": "playing"
    },
    {
      "sentence": "The team has been releasing the deal lately.",
      "verb": "releasing"
    },
    {
      "sentence": "John has been fixing the bike recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The children have been watching a series for a week.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been driving to the bank lately.",
      "verb": "driving"
    },
    {
      "sentence": "He has been having some fruit lately.",
      "verb": "having"
    },
    {
      "sentence": "My parents have been speaking to my friend recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been leaving downtown for a week.",
      "verb": "leaving"
    },
    {
      "sentence": "My brother has been making pasta lately.",
      "verb": "making"
    },
    {
      "sentence": "The teacher has been making pasta lately.",
      "verb": "making"
    },
    {
      "sentence": "The dog has been playing in the park lately.",
      "verb": "playing"
    },
    {
      "sentence": "The students have been thinking about the plan recently.",
      "verb": "thinking"
    },
    {
      "sentence": "Emma has been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been painting a landscape recently.",
      "verb": "painting"
    },
    {
      "sentence": "They have been drinking some water recently.",
      "verb": "drinking"
    },
    {
      "sentence": "I have been watching the news lately.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been playing video games lately.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been thinking about the situation lately.",
      "verb": "thinking"
    },
    {
      "sentence": "Her sister has been calling my parents for a week.",
      "verb": "calling"
    },
    {
      "sentence": "The bird has been catching the toy for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister has been repairing the door since this morning.",
      "verb": "repairing"
    },
    {
      "sentence": "She has been speaking to the professor for years.",
      "verb": "speaking"
    },
    {
      "sentence": "My brother has been cleaning the dishes for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "My parents have been remembering the event recently.",
      "verb": "remembering"
    },
    {
      "sentence": "The bird has been chasing the other pets lately.",
      "verb": "chasing"
    },
    {
      "sentence": "We have been teaching mathematics lately.",
      "verb": "teaching"
    },
    {
      "sentence": "My parents have been repairing the computer recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher has been listening to classical music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors have been reading mathematics for years.",
      "verb": "reading"
    },
    {
      "sentence": "The teacher has been building a model recently.",
      "verb": "building"
    },
    {
      "sentence": "My friend has been drawing the wall lately.",
      "verb": "drawing"
    },
    {
      "sentence": "We have been speaking with the client lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird has been catching the frisbee recently.",
      "verb": "catching"
    },
    {
      "sentence": "John has been designing a model lately.",
      "verb": "designing"
    },
    {
      "sentence": "The manager has been baking cookies recently.",
      "verb": "baking"
    },
    {
      "sentence": "The cat has been playing in the park recently.",
      "verb": "playing"
    },
    {
      "sentence": "Tom has been drinking water for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "The dog has been chasing the toy lately.",
      "verb": "chasing"
    },
    {
      "sentence": "John has been studying Spanish recently.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister has been speaking to my friend lately.",
      "verb": "speaking"
    },
    {
      "sentence": "Our neighbors have been playing basketball for three days.",
      "verb": "playing"
    },
    {
      "sentence": "The students have been having a salad lately.",
      "verb": "having"
    },
    {
      "sentence": "He has been visiting my friend all day.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher has been baking soup lately.",
      "verb": "baking"
    },
    {
      "sentence": "The children have been drinking coffee all day.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager has been fixing the roof recently.",
      "verb": "fixing"
    },
    {
      "sentence": "She has been listening to the news since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The students have been repairing the car lately.",
      "verb": "repairing"
    },
    {
      "sentence": "We have been listening to the news since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The manager has been making a salad recently.",
      "verb": "making"
    },
    {
      "sentence": "Her sister has been coming to the beach all week.",
      "verb": "coming"
    },
    {
      "sentence": "She has been drinking milk lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma has been finding a present for a week.",
      "verb": "finding"
    },
    {
      "sentence": "She has been sketching the wall since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "The manager has been tidying the bathroom for three days.",
      "verb": "tidying"
    },
    {
      "sentence": "They have been drinking milk for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been playing with its owner recently.",
      "verb": "playing"
    },
    {
      "sentence": "She has been studying the material all day.",
      "verb": "studying"
    },
    {
      "sentence": "The manager has been listening to the news recently.",
      "verb": "listening"
    },
    {
      "sentence": "The students have been playing football since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been chasing the ball all week.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister has been selling flowers recently.",
      "verb": "selling"
    },
    {
      "sentence": "She has been learning history recently.",
      "verb": "learning"
    },
    {
      "sentence": "The manager has been organizing the house lately.",
      "verb": "organizing"
    },
    {
      "sentence": "She has been speaking with the neighbors since this morning.",
      "verb": "speaking"
    },
    {
      "sentence": "The company has been completing the deal recently.",
      "verb": "completing"
    },
    {
      "sentence": "Emma has been contacting customer service since yesterday.",
      "verb": "contacting"
    },
    {
      "sentence": "The teacher has been contacting my friend lately.",
      "verb": "contacting"
    },
    {
      "sentence": "My parents have been playing guitar lately.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister has been coming to school lately.",
      "verb": "coming"
    },
    {
      "sentence": "Tom has been washing the garage lately.",
      "verb": "washing"
    },
    {
      "sentence": "Sarah has been thinking about the meeting recently.",
      "verb": "thinking"
    },
    {
      "sentence": "Her sister has been speaking to the doctor lately.",
      "verb": "speaking"
    },
    {
      "sentence": "You have been painting a poster for a week.",
      "verb": "painting"
    },
    {
      "sentence": "She has been returning to work all week.",
      "verb": "returning"
    },
    {
      "sentence": "I have been choosing a new car for three days.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird has been playing in the yard lately.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been reviewing the textbook for three days.",
      "verb": "reviewing"
    },
    {
      "sentence": "We have been playing chess lately.",
      "verb": "playing"
    },
    {
      "sentence": "I have been visiting the client lately.",
      "verb": "visiting"
    },
    {
      "sentence": "He has been giving a new car for three days.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher has been having breakfast lately.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been eating the leftover food all week.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been finishing the task lately.",
      "verb": "finishing"
    },
    {
      "sentence": "Sarah has been thinking about the decision recently.",
      "verb": "thinking"
    },
    {
      "sentence": "Tom has been seeing my family recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The dog has been playing with its owner for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been playing tennis recently.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been talking to the manager lately.",
      "verb": "talking"
    },
    {
      "sentence": "Her sister has been finding the ticket all day.",
      "verb": "finding"
    },
    {
      "sentence": "Our neighbors have been repairing the car for two hours.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors have been speaking to a colleague lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog has been running through the grass for a week.",
      "verb": "running"
    },
    {
      "sentence": "They have been meeting my grandmother recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The children have been watching a series recently.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been getting a present lately.",
      "verb": "getting"
    },
    {
      "sentence": "We have been washing the car lately.",
      "verb": "washing"
    },
    {
      "sentence": "They have been planning the situation lately.",
      "verb": "planning"
    },
    {
      "sentence": "The bird has been sleeping on the bed recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "The students have been teaching history since Monday.",
      "verb": "teaching"
    },
    {
      "sentence": "Sarah has been designing a prototype for a month.",
      "verb": "designing"
    },
    {
      "sentence": "My brother has been writing the report since Monday.",
      "verb": "writing"
    },
    {
      "sentence": "Tom has been preparing dinner recently.",
      "verb": "preparing"
    },
    {
      "sentence": "The company has been completing the project for years.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors have been fixing the door since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird has been eating some food since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors have been studying mathematics lately.",
      "verb": "studying"
    },
    {
      "sentence": "The students have been texting the teacher lately.",
      "verb": "texting"
    },
    {
      "sentence": "I have been coming to the library for two hours.",
      "verb": "coming"
    },
    {
      "sentence": "Emma has been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma has been giving some clothes recently.",
      "verb": "giving"
    },
    {
      "sentence": "They have been speaking with the professor lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The team has been announcing the update for a week.",
      "verb": "announcing"
    },
    {
      "sentence": "Tom has been making lunch for a month.",
      "verb": "making"
    },
    {
      "sentence": "The manager has been texting my family lately.",
      "verb": "texting"
    },
    {
      "sentence": "The teacher has been visiting an old friend for a month.",
      "verb": "visiting"
    },
    {
      "sentence": "The manager has been reading mathematics recently.",
      "verb": "reading"
    },
    {
      "sentence": "My brother has been preparing a meal for a month.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog has been eating its dinner for a week.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been receiving the presentation lately.",
      "verb": "receiving"
    },
    {
      "sentence": "My friend has been listening to a song lately.",
      "verb": "listening"
    },
    {
      "sentence": "The team has been winning the results recently.",
      "verb": "winning"
    },
    {
      "sentence": "We have been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been reviewing vocabulary recently.",
      "verb": "reviewing"
    },
    {
      "sentence": "The cat has been eating a treat for three days.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been playing with the other pets recently.",
      "verb": "playing"
    },
    {
      "sentence": "She has been finishing the application recently.",
      "verb": "finishing"
    },
    {
      "sentence": "You have been playing chess recently.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been running in the yard for years.",
      "verb": "running"
    },
    {
      "sentence": "My parents have been cleaning the house lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "John has been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been running through the grass recently.",
      "verb": "running"
    },
    {
      "sentence": "They have been having pizza for a week.",
      "verb": "having"
    },
    {
      "sentence": "He has been drinking coffee for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager has been finishing the task since this morning.",
      "verb": "finishing"
    },
    {
      "sentence": "She has been fixing the bike recently.",
      "verb": "fixing"
    },
    {
      "sentence": "Our neighbors have been baking cookies recently.",
      "verb": "baking"
    },
    {
      "sentence": "The cat has been running across the field for a month.",
      "verb": "running"
    },
    {
      "sentence": "The manager has been speaking with my family recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher has been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been chasing the other pets lately.",
      "verb": "chasing"
    },
    {
      "sentence": "The company has been developing the project since Monday.",
      "verb": "developing"
    },
    {
      "sentence": "The manager has been contacting the office recently.",
      "verb": "contacting"
    },
    {
      "sentence": "She has been sending the assignment recently.",
      "verb": "sending"
    },
    {
      "sentence": "The students have been sketching a portrait lately.",
      "verb": "sketching"
    },
    {
      "sentence": "John has been giving the keys lately.",
      "verb": "giving"
    },
    {
      "sentence": "Tom has been fixing the car lately.",
      "verb": "fixing"
    },
    {
      "sentence": "He has been returning to the library recently.",
      "verb": "returning"
    },
    {
      "sentence": "Our neighbors have been watching a series recently.",
      "verb": "watching"
    },
    {
      "sentence": "My parents have been practicing history since this morning.",
      "verb": "practicing"
    },
    {
      "sentence": "They have been flying home recently.",
      "verb": "flying"
    },
    {
      "sentence": "The children have been talking to the client lately.",
      "verb": "talking"
    },
    {
      "sentence": "The dog has been playing with the other pets lately.",
      "verb": "playing"
    },
    {
      "sentence": "The students have been drinking water for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been cooking lunch for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "The bird has been playing in the yard since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "I have been fixing the bike recently.",
      "verb": "fixing"
    },
    {
      "sentence": "You have been texting my parents for years.",
      "verb": "texting"
    },
    {
      "sentence": "We have been drinking milk since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "He has been finding a new house lately.",
      "verb": "finding"
    },
    {
      "sentence": "Her sister has been listening to a podcast all day.",
      "verb": "listening"
    },
    {
      "sentence": "He has been playing tennis recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been chasing the ball lately.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister has been cleaning the clothes since yesterday.",
      "verb": "cleaning"
    },
    {
      "sentence": "The children have been repairing the machine lately.",
      "verb": "repairing"
    },
    {
      "sentence": "We have been preparing soup recently.",
      "verb": "preparing"
    },
    {
      "sentence": "My parents have been visiting the manager lately.",
      "verb": "visiting"
    },
    {
      "sentence": "I have been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "John has been building a prototype recently.",
      "verb": "building"
    },
    {
      "sentence": "Tom has been deciding on the trip recently.",
      "verb": "deciding"
    },
    {
      "sentence": "She has been playing video games recently.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been repairing the machine lately.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma has been organizing the dishes since this morning.",
      "verb": "organizing"
    },
    {
      "sentence": "My friend has been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "John has been cooking soup for two hours.",
      "verb": "cooking"
    },
    {
      "sentence": "The students have been texting my friend recently.",
      "verb": "texting"
    },
    {
      "sentence": "My parents have been fixing the computer all week.",
      "verb": "fixing"
    },
    {
      "sentence": "The children have been considering the options for a month.",
      "verb": "considering"
    },
    {
      "sentence": "They have been considering the plan recently.",
      "verb": "considering"
    },
    {
      "sentence": "The bird has been chasing its tail all day.",
      "verb": "chasing"
    },
    {
      "sentence": "My brother has been meeting the manager recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird has been playing in the park since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister has been planning the situation for three days.",
      "verb": "planning"
    },
    {
      "sentence": "Tom has been seeing my grandmother lately.",
      "verb": "seeing"
    },
    {
      "sentence": "You have been giving the ticket recently.",
      "verb": "giving"
    },
    {
      "sentence": "You have been listening to an audiobook lately.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been making dinner lately.",
      "verb": "making"
    },
    {
      "sentence": "You have been deciding on the situation lately.",
      "verb": "deciding"
    },
    {
      "sentence": "The students have been playing golf all week.",
      "verb": "playing"
    },
    {
      "sentence": "We have been repairing the bike recently.",
      "verb": "repairing"
    },
    {
      "sentence": "Tom has been watching TV lately.",
      "verb": "watching"
    },
    {
      "sentence": "They have been studying for the exam lately.",
      "verb": "studying"
    },
    {
      "sentence": "We have been drawing a diagram for a week.",
      "verb": "drawing"
    },
    {
      "sentence": "John has been seeing the manager for a week.",
      "verb": "seeing"
    },
    {
      "sentence": "My friend has been repairing the fence recently.",
      "verb": "repairing"
    },
    {
      "sentence": "We have been listening to the radio lately.",
      "verb": "listening"
    },
    {
      "sentence": "We have been playing video games for a month.",
      "verb": "playing"
    },
    {
      "sentence": "My brother has been playing guitar recently.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been building a project for two hours.",
      "verb": "building"
    },
    {
      "sentence": "My parents have been listening to the news for years.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been sending the document recently.",
      "verb": "sending"
    },
    {
      "sentence": "The company has been completing the project recently.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister has been understanding the chapter lately.",
      "verb": "understanding"
    },
    {
      "sentence": "She has been starting the document lately.",
      "verb": "starting"
    },
    {
      "sentence": "The company has been developing a new product recently.",
      "verb": "developing"
    },
    {
      "sentence": "Tom has been watching TV recently.",
      "verb": "watching"
    },
    {
      "sentence": "She has been designing a project recently.",
      "verb": "designing"
    },
    {
      "sentence": "They have been organizing the garage since Monday.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird has been chasing birds in the garden since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "The children have been listening to the news for three days.",
      "verb": "listening"
    },
    {
      "sentence": "She has been playing soccer recently.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been speaking with a colleague all day.",
      "verb": "speaking"
    },
    {
      "sentence": "You have been watching the match lately.",
      "verb": "watching"
    },
    {
      "sentence": "My friend has been deciding on the future recently.",
      "verb": "deciding"
    },
    {
      "sentence": "The cat has been playing in the yard recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been running in the garden lately.",
      "verb": "running"
    },
    {
      "sentence": "You have been drinking tea lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Tom has been practicing the material recently.",
      "verb": "practicing"
    },
    {
      "sentence": "The team has been completing the championship recently.",
      "verb": "completing"
    },
    {
      "sentence": "We have been tidying the office lately.",
      "verb": "tidying"
    },
    {
      "sentence": "Sarah has been fixing the car lately.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom has been repairing the sink for a week.",
      "verb": "repairing"
    },
    {
      "sentence": "My brother has been thinking about the options recently.",
      "verb": "thinking"
    },
    {
      "sentence": "You have been drawing a portrait lately.",
      "verb": "drawing"
    },
    {
      "sentence": "Sarah has been drinking coffee since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been calling the office lately.",
      "verb": "calling"
    },
    {
      "sentence": "John has been talking to the doctor lately.",
      "verb": "talking"
    },
    {
      "sentence": "The cat has been playing with the other pets for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been playing with the ball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "My brother has been building a presentation lately.",
      "verb": "building"
    },
    {
      "sentence": "The bird has been chasing the other pets recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog has been running in the park lately.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been playing in the garden lately.",
      "verb": "playing"
    },
    {
      "sentence": "The children have been washing the room recently.",
      "verb": "washing"
    },
    {
      "sentence": "Our neighbors have been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "The children have been having dinner lately.",
      "verb": "having"
    },
    {
      "sentence": "The bird has been playing with the toy recently.",
      "verb": "playing"
    },
    {
      "sentence": "The students have been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "She has been playing basketball for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The children have been making cookies recently.",
      "verb": "making"
    },
    {
      "sentence": "They have been buying a book lately.",
      "verb": "buying"
    },
    {
      "sentence": "The cat has been playing with its owner lately.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been sleeping on the couch lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog has been eating the leftover food recently.",
      "verb": "eating"
    },
    {
      "sentence": "The manager has been texting my parents lately.",
      "verb": "texting"
    },
    {
      "sentence": "The children have been planning the vacation since Monday.",
      "verb": "planning"
    },
    {
      "sentence": "The manager has been playing basketball for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister has been designing a prototype all day.",
      "verb": "designing"
    },
    {
      "sentence": "The students have been repairing the computer recently.",
      "verb": "repairing"
    },
    {
      "sentence": "She has been playing volleyball for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been fixing the car for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "We have been completing the letter recently.",
      "verb": "completing"
    },
    {
      "sentence": "The bird has been running in the park lately.",
      "verb": "running"
    },
    {
      "sentence": "The cat has been catching a butterfly lately.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher has been forgetting the birthday party for a week.",
      "verb": "forgetting"
    },
    {
      "sentence": "She has been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been chasing the other pets for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "He has been eating some fruit lately.",
      "verb": "eating"
    },
    {
      "sentence": "Tom has been painting a poster since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "My brother has been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "The team has been announcing the software lately.",
      "verb": "announcing"
    },
    {
      "sentence": "We have been starting the report since Monday.",
      "verb": "starting"
    },
    {
      "sentence": "My brother has been speaking to a colleague lately.",
      "verb": "speaking"
    },
    {
      "sentence": "He has been baking dinner recently.",
      "verb": "baking"
    },
    {
      "sentence": "The manager has been visiting the team lately.",
      "verb": "visiting"
    },
    {
      "sentence": "The company has been developing the results recently.",
      "verb": "developing"
    },
    {
      "sentence": "The dog has been eating its food recently.",
      "verb": "eating"
    },
    {
      "sentence": "My friend has been listening to a podcast lately.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been fixing the sink lately.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister has been drinking milk lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma has been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been playing soccer lately.",
      "verb": "playing"
    },
    {
      "sentence": "John has been meeting the doctor for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "The children have been drinking some water recently.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been drinking some water all week.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been catching a bird recently.",
      "verb": "catching"
    },
    {
      "sentence": "The children have been coming to the hospital lately.",
      "verb": "coming"
    },
    {
      "sentence": "My friend has been meeting my family for a month.",
      "verb": "meeting"
    },
    {
      "sentence": "Emma has been learning the notes for a month.",
      "verb": "learning"
    },
    {
      "sentence": "Emma has been practicing grammar lately.",
      "verb": "practicing"
    },
    {
      "sentence": "I have been listening to jazz for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "They have been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "My friend has been washing the bathroom lately.",
      "verb": "washing"
    },
    {
      "sentence": "She has been having a snack recently.",
      "verb": "having"
    },
    {
      "sentence": "Emma has been speaking to the client recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog has been eating its dinner lately.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been playing in the park for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been chasing its tail since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "My parents have been finishing the contract since this morning.",
      "verb": "finishing"
    },
    {
      "sentence": "My parents have been cleaning the office recently.",
      "verb": "cleaning"
    },
    {
      "sentence": "The bird has been catching the toy lately.",
      "verb": "catching"
    },
    {
      "sentence": "She has been visiting my parents lately.",
      "verb": "visiting"
    },
    {
      "sentence": "The manager has been designing a project lately.",
      "verb": "designing"
    },
    {
      "sentence": "He has been painting a picture for a week.",
      "verb": "painting"
    },
    {
      "sentence": "I have been choosing flowers recently.",
      "verb": "choosing"
    },
    {
      "sentence": "I have been giving a new house for a month.",
      "verb": "giving"
    },
    {
      "sentence": "The students have been receiving the email lately.",
      "verb": "receiving"
    },
    {
      "sentence": "She has been having pasta since this morning.",
      "verb": "having"
    },
    {
      "sentence": "The students have been emailing the office for a month.",
      "verb": "emailing"
    },
    {
      "sentence": "My parents have been speaking to my family recently.",
      "verb": "speaking"
    },
    {
      "sentence": "I have been watching a series recently.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been arriving home recently.",
      "verb": "arriving"
    },
    {
      "sentence": "They have been playing guitar lately.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been creating a presentation lately.",
      "verb": "creating"
    },
    {
      "sentence": "The cat has been playing with its owner all day.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been learning the material lately.",
      "verb": "learning"
    },
    {
      "sentence": "Sarah has been painting a poster recently.",
      "verb": "painting"
    },
    {
      "sentence": "My friend has been returning to work lately.",
      "verb": "returning"
    },
    {
      "sentence": "The cat has been eating a treat for years.",
      "verb": "eating"
    },
    {
      "sentence": "He has been fixing the machine for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "They have been organizing the house recently.",
      "verb": "organizing"
    },
    {
      "sentence": "The students have been visiting an old friend recently.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister has been thinking about the future lately.",
      "verb": "thinking"
    },
    {
      "sentence": "I have been meeting the manager recently.",
      "verb": "meeting"
    },
    {
      "sentence": "My parents have been designing a plan all week.",
      "verb": "designing"
    },
    {
      "sentence": "The bird has been catching a treat recently.",
      "verb": "catching"
    },
    {
      "sentence": "Tom has been speaking to the client recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The cat has been playing with the toy lately.",
      "verb": "playing"
    },
    {
      "sentence": "You have been seeing the neighbors recently.",
      "verb": "seeing"
    },
    {
      "sentence": "I have been listening to a podcast since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The bird has been eating its breakfast recently.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been playing football lately.",
      "verb": "playing"
    },
    {
      "sentence": "They have been practicing the textbook recently.",
      "verb": "practicing"
    },
    {
      "sentence": "The manager has been playing video games recently.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been playing in the garden lately.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been eating a treat recently.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been sleeping on the bed since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "The dog has been running in the park for two hours.",
      "verb": "running"
    },
    {
      "sentence": "We have been drinking some water for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been baking a cake lately.",
      "verb": "baking"
    },
    {
      "sentence": "We have been creating a prototype lately.",
      "verb": "creating"
    },
    {
      "sentence": "We have been finding some clothes for years.",
      "verb": "finding"
    },
    {
      "sentence": "The manager has been designing a model lately.",
      "verb": "designing"
    },
    {
      "sentence": "Our neighbors have been remembering the trip recently.",
      "verb": "remembering"
    },
    {
      "sentence": "The cat has been running in the garden recently.",
      "verb": "running"
    },
    {
      "sentence": "I have been meeting the client recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat has been running in the yard all day.",
      "verb": "running"
    },
    {
      "sentence": "I have been playing soccer for a week.",
      "verb": "playing"
    },
    {
      "sentence": "I have been talking to my family recently.",
      "verb": "talking"
    },
    {
      "sentence": "You have been creating a project lately.",
      "verb": "creating"
    },
    {
      "sentence": "The students have been selling flowers all week.",
      "verb": "selling"
    },
    {
      "sentence": "The teacher has been speaking to the neighbors since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "The children have been creating a plan lately.",
      "verb": "creating"
    },
    {
      "sentence": "The bird has been running around the house recently.",
      "verb": "running"
    },
    {
      "sentence": "He has been considering the event recently.",
      "verb": "considering"
    },
    {
      "sentence": "She has been finishing the document all week.",
      "verb": "finishing"
    },
    {
      "sentence": "The bird has been eating a treat for a week.",
      "verb": "eating"
    },
    {
      "sentence": "My friend has been drinking a smoothie since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah has been forgetting the birthday party recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "Her sister has been cleaning the clothes lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "She has been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "Her sister has been getting the phone lately.",
      "verb": "getting"
    },
    {
      "sentence": "The company has been winning the project all week.",
      "verb": "winning"
    },
    {
      "sentence": "He has been seeing the neighbors recently.",
      "verb": "seeing"
    },
    {
      "sentence": "Sarah has been listening to jazz lately.",
      "verb": "listening"
    },
    {
      "sentence": "Tom has been playing volleyball lately.",
      "verb": "playing"
    },
    {
      "sentence": "He has been creating a project since yesterday.",
      "verb": "creating"
    },
    {
      "sentence": "Her sister has been playing basketball recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been playing with the toy lately.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been playing with the other pets all day.",
      "verb": "playing"
    },
    {
      "sentence": "I have been listening to a song recently.",
      "verb": "listening"
    },
    {
      "sentence": "I have been watching a show recently.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been selling a new car for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "She has been teaching mathematics lately.",
      "verb": "teaching"
    },
    {
      "sentence": "The dog has been chasing the ball for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been seeing my grandmother recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird has been sleeping on the bed since Monday.",
      "verb": "sleeping"
    },
    {
      "sentence": "My friend has been watching a documentary lately.",
      "verb": "watching"
    },
    {
      "sentence": "The team has been developing the project recently.",
      "verb": "developing"
    },
    {
      "sentence": "I have been cooking rice for a month.",
      "verb": "cooking"
    },
    {
      "sentence": "The cat has been catching a bird all week.",
      "verb": "catching"
    },
    {
      "sentence": "He has been practicing the material recently.",
      "verb": "practicing"
    },
    {
      "sentence": "My friend has been choosing a gift lately.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird has been chasing the mouse for three days.",
      "verb": "chasing"
    },
    {
      "sentence": "You have been watching the news lately.",
      "verb": "watching"
    },
    {
      "sentence": "They have been sketching a portrait lately.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister has been washing the kitchen recently.",
      "verb": "washing"
    },
    {
      "sentence": "The dog has been eating its breakfast for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister has been calling the doctor for three days.",
      "verb": "calling"
    },
    {
      "sentence": "John has been submitting the application all day.",
      "verb": "submitting"
    },
    {
      "sentence": "The dog has been running through the grass recently.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been running through the grass for years.",
      "verb": "running"
    },
    {
      "sentence": "My parents have been drinking milk for years.",
      "verb": "drinking"
    },
    {
      "sentence": "The students have been visiting the neighbors lately.",
      "verb": "visiting"
    },
    {
      "sentence": "We have been speaking with the client recently.",
      "verb": "speaking"
    },
    {
      "sentence": "She has been writing the assignment since yesterday.",
      "verb": "writing"
    },
    {
      "sentence": "We have been drawing a picture recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The company has been announcing the project lately.",
      "verb": "announcing"
    },
    {
      "sentence": "He has been making soup lately.",
      "verb": "making"
    },
    {
      "sentence": "Emma has been finishing the project lately.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager has been finishing the presentation lately.",
      "verb": "finishing"
    },
    {
      "sentence": "My friend has been listening to classical music since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been having some fruit recently.",
      "verb": "having"
    },
    {
      "sentence": "My friend has been calling customer service recently.",
      "verb": "calling"
    },
    {
      "sentence": "The dog has been catching a treat lately.",
      "verb": "catching"
    },
    {
      "sentence": "You have been repairing the fence lately.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher has been fixing the roof for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "I have been drawing a portrait recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The company has been launching the update for years.",
      "verb": "launching"
    },
    {
      "sentence": "John has been drinking some water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother has been watching the match since this morning.",
      "verb": "watching"
    },
    {
      "sentence": "They have been visiting the team for years.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors have been listening to an audiobook for a week.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been traveling home all week.",
      "verb": "traveling"
    },
    {
      "sentence": "Sarah has been cooking lunch recently.",
      "verb": "cooking"
    },
    {
      "sentence": "The teacher has been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "Emma has been receiving the project lately.",
      "verb": "receiving"
    },
    {
      "sentence": "The teacher has been drinking a smoothie since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been eating its dinner since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been chasing the ball recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog has been chasing the mouse for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog has been catching a treat all day.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been traveling to the office lately.",
      "verb": "traveling"
    },
    {
      "sentence": "She has been listening to a song lately.",
      "verb": "listening"
    },
    {
      "sentence": "You have been drawing a poster lately.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat has been eating the leftover food since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been repairing the door recently.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors have been playing video games lately.",
      "verb": "playing"
    },
    {
      "sentence": "They have been learning vocabulary recently.",
      "verb": "learning"
    },
    {
      "sentence": "Our neighbors have been getting a new house lately.",
      "verb": "getting"
    },
    {
      "sentence": "The children have been deciding on the vacation for three days.",
      "verb": "deciding"
    },
    {
      "sentence": "My parents have been traveling to the airport lately.",
      "verb": "traveling"
    },
    {
      "sentence": "She has been cleaning the room lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother has been creating an app lately.",
      "verb": "creating"
    },
    {
      "sentence": "The team has been developing the championship lately.",
      "verb": "developing"
    },
    {
      "sentence": "Our neighbors have been speaking with the boss recently.",
      "verb": "speaking"
    },
    {
      "sentence": "Her sister has been considering the trip recently.",
      "verb": "considering"
    },
    {
      "sentence": "Her sister has been traveling to work lately.",
      "verb": "traveling"
    },
    {
      "sentence": "My friend has been arriving to work lately.",
      "verb": "arriving"
    },
    {
      "sentence": "She has been creating a model lately.",
      "verb": "creating"
    },
    {
      "sentence": "We have been driving to the store lately.",
      "verb": "driving"
    },
    {
      "sentence": "The dog has been catching a butterfly lately.",
      "verb": "catching"
    },
    {
      "sentence": "You have been thinking about the problem lately.",
      "verb": "thinking"
    },
    {
      "sentence": "They have been playing volleyball lately.",
      "verb": "playing"
    },
    {
      "sentence": "John has been running to the market recently.",
      "verb": "running"
    },
    {
      "sentence": "Sarah has been watching TV since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been running in the garden all day.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been chasing the toy lately.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah has been listening to jazz recently.",
      "verb": "listening"
    },
    {
      "sentence": "Her sister has been drinking some water all day.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah has been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister has been speaking with the team lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird has been running in the park since this morning.",
      "verb": "running"
    },
    {
      "sentence": "My parents have been texting the client for years.",
      "verb": "texting"
    },
    {
      "sentence": "The cat has been sleeping on the bed lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma has been seeing the doctor for a month.",
      "verb": "seeing"
    },
    {
      "sentence": "The team has been releasing the project for two hours.",
      "verb": "releasing"
    },
    {
      "sentence": "The cat has been chasing birds in the garden since Monday.",
      "verb": "chasing"
    },
    {
      "sentence": "They have been baking lunch lately.",
      "verb": "baking"
    },
    {
      "sentence": "Emma has been calling my family lately.",
      "verb": "calling"
    },
    {
      "sentence": "The students have been drinking tea all day.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been forgetting the vacation for three days.",
      "verb": "forgetting"
    },
    {
      "sentence": "John has been listening to the lecture for a month.",
      "verb": "listening"
    },
    {
      "sentence": "The cat has been catching a treat since yesterday.",
      "verb": "catching"
    },
    {
      "sentence": "My brother has been remembering the future recently.",
      "verb": "remembering"
    },
    {
      "sentence": "Sarah has been listening to a song for years.",
      "verb": "listening"
    },
    {
      "sentence": "John has been designing an app lately.",
      "verb": "designing"
    },
    {
      "sentence": "We have been fixing the car for a month.",
      "verb": "fixing"
    },
    {
      "sentence": "The students have been organizing the house recently.",
      "verb": "organizing"
    },
    {
      "sentence": "Emma has been designing a project recently.",
      "verb": "designing"
    },
    {
      "sentence": "My brother has been deciding on the meeting for a week.",
      "verb": "deciding"
    },
    {
      "sentence": "The teacher has been playing the piano recently.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been fixing the machine for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "Her sister has been listening to an audiobook for a week.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been repairing the computer lately.",
      "verb": "repairing"
    },
    {
      "sentence": "They have been returning to the beach recently.",
      "verb": "returning"
    },
    {
      "sentence": "The children have been practicing for the exam lately.",
      "verb": "practicing"
    },
    {
      "sentence": "The cat has been playing with the ball since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been contacting my family for a month.",
      "verb": "contacting"
    },
    {
      "sentence": "The manager has been eating a sandwich recently.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been watching football lately.",
      "verb": "watching"
    },
    {
      "sentence": "The children have been watching a movie recently.",
      "verb": "watching"
    },
    {
      "sentence": "Her sister has been drinking some water recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager has been watching a movie for two hours.",
      "verb": "watching"
    },
    {
      "sentence": "The company has been launching a new product lately.",
      "verb": "launching"
    },
    {
      "sentence": "Sarah has been speaking to the manager since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "They have been drinking juice since yesterday.",
      "verb": "drinking"
    },
    {
      "sentence": "They have been tidying the dishes lately.",
      "verb": "tidying"
    },
    {
      "sentence": "My brother has been traveling to school recently.",
      "verb": "traveling"
    },
    {
      "sentence": "She has been driving to the market recently.",
      "verb": "driving"
    },
    {
      "sentence": "I have been cooking dinner since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "The team has been completing the championship all week.",
      "verb": "completing"
    },
    {
      "sentence": "The teacher has been seeing my family recently.",
      "verb": "seeing"
    },
    {
      "sentence": "John has been listening to a song for years.",
      "verb": "listening"
    },
    {
      "sentence": "The team has been launching the software for years.",
      "verb": "launching"
    },
    {
      "sentence": "Our neighbors have been building a plan recently.",
      "verb": "building"
    },
    {
      "sentence": "The manager has been playing tennis recently.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been eating soup lately.",
      "verb": "eating"
    },
    {
      "sentence": "He has been having soup lately.",
      "verb": "having"
    },
    {
      "sentence": "You have been repairing the car recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The students have been organizing the clothes recently.",
      "verb": "organizing"
    },
    {
      "sentence": "I have been understanding French lately.",
      "verb": "understanding"
    },
    {
      "sentence": "The teacher has been having a meal recently.",
      "verb": "having"
    },
    {
      "sentence": "The students have been forgetting the event recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "I have been traveling to the bank lately.",
      "verb": "traveling"
    },
    {
      "sentence": "You have been seeing the client recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The manager has been cleaning the room since this morning.",
      "verb": "cleaning"
    },
    {
      "sentence": "Sarah has been preparing soup for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "The children have been having some fruit recently.",
      "verb": "having"
    },
    {
      "sentence": "John has been drawing a portrait for three days.",
      "verb": "drawing"
    },
    {
      "sentence": "My friend has been drawing a picture since this morning.",
      "verb": "drawing"
    },
    {
      "sentence": "I have been having a sandwich since this morning.",
      "verb": "having"
    },
    {
      "sentence": "Sarah has been teaching science lately.",
      "verb": "teaching"
    },
    {
      "sentence": "The cat has been playing with the ball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "My friend has been teaching grammar lately.",
      "verb": "teaching"
    },
    {
      "sentence": "They have been designing a model recently.",
      "verb": "designing"
    },
    {
      "sentence": "We have been drinking coffee for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "I have been making pasta lately.",
      "verb": "making"
    },
    {
      "sentence": "She has been driving to the library lately.",
      "verb": "driving"
    },
    {
      "sentence": "The students have been fixing the door since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "She has been building a website all day.",
      "verb": "building"
    },
    {
      "sentence": "We have been getting a book lately.",
      "verb": "getting"
    },
    {
      "sentence": "Emma has been watching a series lately.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been understanding the material for three days.",
      "verb": "understanding"
    },
    {
      "sentence": "The children have been walking to school lately.",
      "verb": "walking"
    },
    {
      "sentence": "The cat has been eating some food recently.",
      "verb": "eating"
    },
    {
      "sentence": "Emma has been preparing a salad recently.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma has been practicing for the exam lately.",
      "verb": "practicing"
    },
    {
      "sentence": "The students have been preparing a salad since Monday.",
      "verb": "preparing"
    },
    {
      "sentence": "You have been watching the game recently.",
      "verb": "watching"
    },
    {
      "sentence": "John has been learning mathematics for three days.",
      "verb": "learning"
    },
    {
      "sentence": "The students have been going to the beach for years.",
      "verb": "going"
    },
    {
      "sentence": "The teacher has been submitting the contract recently.",
      "verb": "submitting"
    },
    {
      "sentence": "Sarah has been having pizza lately.",
      "verb": "having"
    },
    {
      "sentence": "My friend has been cleaning the room recently.",
      "verb": "cleaning"
    },
    {
      "sentence": "She has been designing an app for a month.",
      "verb": "designing"
    },
    {
      "sentence": "The company has been launching the software recently.",
      "verb": "launching"
    },
    {
      "sentence": "The dog has been sleeping by the window recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team has been announcing the contract for a month.",
      "verb": "announcing"
    },
    {
      "sentence": "Emma has been designing an app lately.",
      "verb": "designing"
    },
    {
      "sentence": "He has been selling the keys lately.",
      "verb": "selling"
    },
    {
      "sentence": "They have been listening to music lately.",
      "verb": "listening"
    },
    {
      "sentence": "John has been having a snack for a month.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been eating its food for years.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been preparing soup lately.",
      "verb": "preparing"
    },
    {
      "sentence": "My friend has been watching the game recently.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been playing in the garden since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been contacting my parents since this morning.",
      "verb": "contacting"
    },
    {
      "sentence": "We have been driving to the airport since this morning.",
      "verb": "driving"
    },
    {
      "sentence": "My brother has been playing video games recently.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been reading Spanish lately.",
      "verb": "reading"
    },
    {
      "sentence": "Her sister has been walking downtown since this morning.",
      "verb": "walking"
    },
    {
      "sentence": "My brother has been emailing my parents recently.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird has been catching the mouse for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah has been speaking with the professor recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird has been sleeping under the table since yesterday.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother has been repairing the door lately.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents have been meeting my family recently.",
      "verb": "meeting"
    },
    {
      "sentence": "Her sister has been watching a series since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "He has been meeting an old friend recently.",
      "verb": "meeting"
    },
    {
      "sentence": "We have been creating a website since this morning.",
      "verb": "creating"
    },
    {
      "sentence": "I have been playing soccer lately.",
      "verb": "playing"
    },
    {
      "sentence": "John has been tidying the garage for years.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat has been playing in the garden recently.",
      "verb": "playing"
    },
    {
      "sentence": "My friend has been cooking a meal since Monday.",
      "verb": "cooking"
    },
    {
      "sentence": "She has been organizing the dishes lately.",
      "verb": "organizing"
    },
    {
      "sentence": "The teacher has been studying the lesson recently.",
      "verb": "studying"
    },
    {
      "sentence": "Tom has been eating breakfast recently.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been catching the frisbee recently.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been calling the manager lately.",
      "verb": "calling"
    },
    {
      "sentence": "The manager has been eating a sandwich for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been meeting the neighbors lately.",
      "verb": "meeting"
    },
    {
      "sentence": "The bird has been chasing the other pets for a month.",
      "verb": "chasing"
    },
    {
      "sentence": "Sarah has been thinking about the vacation since this morning.",
      "verb": "thinking"
    },
    {
      "sentence": "My parents have been meeting my grandmother all day.",
      "verb": "meeting"
    },
    {
      "sentence": "The teacher has been creating a project all day.",
      "verb": "creating"
    },
    {
      "sentence": "The dog has been catching the ball lately.",
      "verb": "catching"
    },
    {
      "sentence": "The children have been fixing the door for two hours.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom has been playing basketball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been chasing its tail for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "The students have been baking pasta lately.",
      "verb": "baking"
    },
    {
      "sentence": "The manager has been visiting the doctor lately.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister has been selling a laptop lately.",
      "verb": "selling"
    },
    {
      "sentence": "The manager has been sketching a design recently.",
      "verb": "sketching"
    },
    {
      "sentence": "You have been painting an illustration for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "The manager has been cleaning the room for two hours.",
      "verb": "cleaning"
    },
    {
      "sentence": "The dog has been running in the garden recently.",
      "verb": "running"
    },
    {
      "sentence": "They have been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "You have been watching a series lately.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been watching a series lately.",
      "verb": "watching"
    },
    {
      "sentence": "My parents have been calling my friend lately.",
      "verb": "calling"
    },
    {
      "sentence": "The manager has been meeting an old friend lately.",
      "verb": "meeting"
    },
    {
      "sentence": "You have been reading the textbook lately.",
      "verb": "reading"
    },
    {
      "sentence": "The bird has been chasing its tail since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "John has been forgetting the problem lately.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors have been forgetting the event all week.",
      "verb": "forgetting"
    },
    {
      "sentence": "Our neighbors have been seeing my grandmother lately.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird has been sleeping in the corner for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "She has been studying the chapter recently.",
      "verb": "studying"
    },
    {
      "sentence": "She has been drinking juice for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "John has been listening to a podcast since Monday.",
      "verb": "listening"
    },
    {
      "sentence": "The bird has been running in the garden recently.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been playing with the other pets recently.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been eating its breakfast lately.",
      "verb": "eating"
    },
    {
      "sentence": "John has been choosing a new house lately.",
      "verb": "choosing"
    },
    {
      "sentence": "My brother has been listening to the lecture recently.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been buying a gift recently.",
      "verb": "buying"
    },
    {
      "sentence": "He has been fixing the car recently.",
      "verb": "fixing"
    },
    {
      "sentence": "She has been preparing the contract for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "The company has been developing the update lately.",
      "verb": "developing"
    },
    {
      "sentence": "The cat has been playing in the park lately.",
      "verb": "playing"
    },
    {
      "sentence": "We have been having a meal all day.",
      "verb": "having"
    },
    {
      "sentence": "My parents have been watching a series recently.",
      "verb": "watching"
    },
    {
      "sentence": "We have been emailing my friend lately.",
      "verb": "emailing"
    },
    {
      "sentence": "She has been calling the client recently.",
      "verb": "calling"
    },
    {
      "sentence": "The bird has been running across the field recently.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been eating a treat lately.",
      "verb": "eating"
    },
    {
      "sentence": "Tom has been selling flowers recently.",
      "verb": "selling"
    },
    {
      "sentence": "The cat has been sleeping by the window lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "The team has been releasing the update all day.",
      "verb": "releasing"
    },
    {
      "sentence": "Tom has been drinking tea recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been sleeping under the table lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah has been finding a laptop for a week.",
      "verb": "finding"
    },
    {
      "sentence": "The bird has been catching the frisbee lately.",
      "verb": "catching"
    },
    {
      "sentence": "She has been eating pasta lately.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been sleeping under the table all day.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma has been meeting my parents for years.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog has been playing with the ball all day.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been eating some food for years.",
      "verb": "eating"
    },
    {
      "sentence": "My parents have been playing chess for years.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been watching the game lately.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been eating a treat lately.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been chasing the mouse all day.",
      "verb": "chasing"
    },
    {
      "sentence": "The dog has been sleeping in the sun all week.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma has been preparing soup for years.",
      "verb": "preparing"
    },
    {
      "sentence": "He has been speaking to a colleague all week.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog has been running in the yard recently.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been running in circles lately.",
      "verb": "running"
    },
    {
      "sentence": "My brother has been painting a diagram lately.",
      "verb": "painting"
    },
    {
      "sentence": "The team has been launching the championship for three days.",
      "verb": "launching"
    },
    {
      "sentence": "Her sister has been thinking about the plan since yesterday.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat has been eating its dinner recently.",
      "verb": "eating"
    },
    {
      "sentence": "They have been talking to the doctor lately.",
      "verb": "talking"
    },
    {
      "sentence": "My brother has been drawing a poster recently.",
      "verb": "drawing"
    },
    {
      "sentence": "John has been starting the proposal lately.",
      "verb": "starting"
    },
    {
      "sentence": "Emma has been drawing an illustration all day.",
      "verb": "drawing"
    },
    {
      "sentence": "She has been painting a portrait lately.",
      "verb": "painting"
    },
    {
      "sentence": "The teacher has been studying English lately.",
      "verb": "studying"
    },
    {
      "sentence": "Emma has been repairing the bike lately.",
      "verb": "repairing"
    },
    {
      "sentence": "My friend has been submitting the letter recently.",
      "verb": "submitting"
    },
    {
      "sentence": "Emma has been visiting the team lately.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister has been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been eating a salad recently.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister has been calling the boss recently.",
      "verb": "calling"
    },
    {
      "sentence": "Her sister has been sketching a diagram lately.",
      "verb": "sketching"
    },
    {
      "sentence": "The dog has been sleeping by the window for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "Sarah has been emailing my parents recently.",
      "verb": "emailing"
    },
    {
      "sentence": "Emma has been arriving to work for two hours.",
      "verb": "arriving"
    },
    {
      "sentence": "Emma has been arriving to the hospital all day.",
      "verb": "arriving"
    },
    {
      "sentence": "We have been tidying the car lately.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat has been chasing the squirrel all week.",
      "verb": "chasing"
    },
    {
      "sentence": "Emma has been preparing the application lately.",
      "verb": "preparing"
    },
    {
      "sentence": "They have been listening to a podcast lately.",
      "verb": "listening"
    },
    {
      "sentence": "The cat has been eating some food since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been reviewing the textbook for years.",
      "verb": "reviewing"
    },
    {
      "sentence": "My brother has been eating soup for years.",
      "verb": "eating"
    },
    {
      "sentence": "My parents have been organizing the car recently.",
      "verb": "organizing"
    },
    {
      "sentence": "The teacher has been repairing the bike recently.",
      "verb": "repairing"
    },
    {
      "sentence": "My parents have been eating a meal since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been eating the leftover food recently.",
      "verb": "eating"
    },
    {
      "sentence": "He has been making cookies all day.",
      "verb": "making"
    },
    {
      "sentence": "She has been baking pasta lately.",
      "verb": "baking"
    },
    {
      "sentence": "The cat has been running in the park all week.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been seeing the manager lately.",
      "verb": "seeing"
    },
    {
      "sentence": "John has been organizing the garage for a month.",
      "verb": "organizing"
    },
    {
      "sentence": "The children have been emailing customer service for a month.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird has been playing in the garden for years.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been catching the toy lately.",
      "verb": "catching"
    },
    {
      "sentence": "My brother has been making cookies for two hours.",
      "verb": "making"
    },
    {
      "sentence": "My friend has been planning the birthday party lately.",
      "verb": "planning"
    },
    {
      "sentence": "She has been emailing the boss lately.",
      "verb": "emailing"
    },
    {
      "sentence": "The dog has been playing in the garden lately.",
      "verb": "playing"
    },
    {
      "sentence": "My brother has been arriving to the library recently.",
      "verb": "arriving"
    },
    {
      "sentence": "The dog has been sleeping all day lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been drinking tea since Monday.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been drinking water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "My friend has been visiting the doctor recently.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors have been playing football lately.",
      "verb": "playing"
    },
    {
      "sentence": "I have been repairing the computer recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The students have been reading grammar for two hours.",
      "verb": "reading"
    },
    {
      "sentence": "They have been meeting my friend for a week.",
      "verb": "meeting"
    },
    {
      "sentence": "The children have been contacting the team lately.",
      "verb": "contacting"
    },
    {
      "sentence": "Her sister has been repairing the bike recently.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors have been listening to a song lately.",
      "verb": "listening"
    },
    {
      "sentence": "He has been playing golf recently.",
      "verb": "playing"
    },
    {
      "sentence": "Tom has been visiting my family lately.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom has been listening to the lecture since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors have been emailing the boss recently.",
      "verb": "emailing"
    },
    {
      "sentence": "My parents have been watching the match lately.",
      "verb": "watching"
    },
    {
      "sentence": "John has been watching TV recently.",
      "verb": "watching"
    },
    {
      "sentence": "My brother has been starting the document lately.",
      "verb": "starting"
    },
    {
      "sentence": "The manager has been drawing a diagram lately.",
      "verb": "drawing"
    },
    {
      "sentence": "He has been building a house lately.",
      "verb": "building"
    },
    {
      "sentence": "The children have been tidying the house lately.",
      "verb": "tidying"
    },
    {
      "sentence": "The students have been driving to the hospital recently.",
      "verb": "driving"
    },
    {
      "sentence": "The children have been watching the game recently.",
      "verb": "watching"
    },
    {
      "sentence": "John has been finishing the assignment recently.",
      "verb": "finishing"
    },
    {
      "sentence": "My friend has been fixing the computer lately.",
      "verb": "fixing"
    },
    {
      "sentence": "Emma has been reviewing French recently.",
      "verb": "reviewing"
    },
    {
      "sentence": "Our neighbors have been thinking about the situation recently.",
      "verb": "thinking"
    },
    {
      "sentence": "My parents have been listening to music recently.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah has been listening to the lecture recently.",
      "verb": "listening"
    },
    {
      "sentence": "The cat has been catching the ball for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "The dog has been catching a treat recently.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah has been watching football all week.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been catching a treat for a week.",
      "verb": "catching"
    },
    {
      "sentence": "The company has been winning a new product lately.",
      "verb": "winning"
    },
    {
      "sentence": "The dog has been playing with its owner all week.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been returning to the store for three days.",
      "verb": "returning"
    },
    {
      "sentence": "The bird has been sleeping all day for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "The bird has been eating quickly since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "I have been fixing the door recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The students have been watching the match recently.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors have been playing basketball recently.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been running in the park since Monday.",
      "verb": "running"
    },
    {
      "sentence": "The students have been visiting my friend recently.",
      "verb": "visiting"
    },
    {
      "sentence": "The children have been emailing my parents recently.",
      "verb": "emailing"
    },
    {
      "sentence": "She has been having a snack lately.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been catching a butterfly since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been eating quickly all week.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been catching the frisbee for years.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher has been starting the letter all day.",
      "verb": "starting"
    },
    {
      "sentence": "John has been cleaning the bathroom lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "The company has been launching the championship recently.",
      "verb": "launching"
    },
    {
      "sentence": "You have been drinking juice for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "My brother has been preparing the project recently.",
      "verb": "preparing"
    },
    {
      "sentence": "Her sister has been writing the task all week.",
      "verb": "writing"
    },
    {
      "sentence": "The teacher has been listening to jazz lately.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah has been designing a presentation all day.",
      "verb": "designing"
    },
    {
      "sentence": "My friend has been watching a documentary recently.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been catching a bird for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been painting a landscape for three days.",
      "verb": "painting"
    },
    {
      "sentence": "We have been completing the presentation for years.",
      "verb": "completing"
    },
    {
      "sentence": "The manager has been drinking water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been listening to music for three days.",
      "verb": "listening"
    },
    {
      "sentence": "Emma has been fixing the bike recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat has been eating its breakfast lately.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been catching the toy recently.",
      "verb": "catching"
    },
    {
      "sentence": "John has been contacting my parents lately.",
      "verb": "contacting"
    },
    {
      "sentence": "He has been giving a new house lately.",
      "verb": "giving"
    },
    {
      "sentence": "The teacher has been listening to music recently.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been learning Spanish lately.",
      "verb": "learning"
    },
    {
      "sentence": "My brother has been talking to the teacher recently.",
      "verb": "talking"
    },
    {
      "sentence": "My friend has been finding a new house recently.",
      "verb": "finding"
    },
    {
      "sentence": "John has been building an app recently.",
      "verb": "building"
    },
    {
      "sentence": "The bird has been catching the mouse lately.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been catching a butterfly recently.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been catching the ball all day.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been sleeping all day for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "Emma has been drinking milk for years.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird has been playing in the garden for a month.",
      "verb": "playing"
    },
    {
      "sentence": "I have been visiting the teacher recently.",
      "verb": "visiting"
    },
    {
      "sentence": "Emma has been sending the letter recently.",
      "verb": "sending"
    },
    {
      "sentence": "The cat has been catching a bird since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher has been running to the beach all week.",
      "verb": "running"
    },
    {
      "sentence": "She has been traveling to school for a month.",
      "verb": "traveling"
    },
    {
      "sentence": "My friend has been planning the future recently.",
      "verb": "planning"
    },
    {
      "sentence": "Emma has been cooking pasta lately.",
      "verb": "cooking"
    },
    {
      "sentence": "They have been drawing a design recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The cat has been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "I have been teaching for the exam for three days.",
      "verb": "teaching"
    },
    {
      "sentence": "We have been drinking some water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents have been forgetting the birthday party for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "They have been returning to work for two hours.",
      "verb": "returning"
    },
    {
      "sentence": "The company has been completing the project since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "The children have been having a sandwich lately.",
      "verb": "having"
    },
    {
      "sentence": "You have been getting flowers lately.",
      "verb": "getting"
    },
    {
      "sentence": "My parents have been building a website lately.",
      "verb": "building"
    },
    {
      "sentence": "My parents have been walking to the bank lately.",
      "verb": "walking"
    },
    {
      "sentence": "The dog has been chasing the squirrel recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The students have been speaking with the neighbors all day.",
      "verb": "speaking"
    },
    {
      "sentence": "She has been watching a show since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "Tom has been eating pizza since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "He has been remembering the plan all day.",
      "verb": "remembering"
    },
    {
      "sentence": "The dog has been running across the field lately.",
      "verb": "running"
    },
    {
      "sentence": "The manager has been speaking with a colleague for years.",
      "verb": "speaking"
    },
    {
      "sentence": "John has been watching the news lately.",
      "verb": "watching"
    },
    {
      "sentence": "Tom has been finding a laptop recently.",
      "verb": "finding"
    },
    {
      "sentence": "You have been playing soccer recently.",
      "verb": "playing"
    },
    {
      "sentence": "I have been speaking with my friend recently.",
      "verb": "speaking"
    },
    {
      "sentence": "He has been having pasta for a month.",
      "verb": "having"
    },
    {
      "sentence": "She has been playing football for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been running in circles since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "The team has been developing the results lately.",
      "verb": "developing"
    },
    {
      "sentence": "Sarah has been submitting the contract recently.",
      "verb": "submitting"
    },
    {
      "sentence": "The bird has been playing in the park for years.",
      "verb": "playing"
    },
    {
      "sentence": "The children have been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "He has been finishing the task lately.",
      "verb": "finishing"
    },
    {
      "sentence": "John has been sketching a poster recently.",
      "verb": "sketching"
    },
    {
      "sentence": "The manager has been writing the contract recently.",
      "verb": "writing"
    },
    {
      "sentence": "Sarah has been repairing the car since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors have been playing the piano for a week.",
      "verb": "playing"
    },
    {
      "sentence": "She has been organizing the car recently.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird has been sleeping all day lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother has been drinking tea recently.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been texting my parents lately.",
      "verb": "texting"
    },
    {
      "sentence": "The children have been studying English since Monday.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister has been teaching grammar recently.",
      "verb": "teaching"
    },
    {
      "sentence": "John has been playing guitar lately.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been eating a treat recently.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been eating its dinner for years.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister has been choosing groceries lately.",
      "verb": "choosing"
    },
    {
      "sentence": "I have been drinking a smoothie for two hours.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah has been eating soup recently.",
      "verb": "eating"
    },
    {
      "sentence": "They have been playing video games lately.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been forgetting the future for years.",
      "verb": "forgetting"
    },
    {
      "sentence": "They have been fixing the roof for years.",
      "verb": "fixing"
    },
    {
      "sentence": "I have been creating a presentation for years.",
      "verb": "creating"
    },
    {
      "sentence": "My friend has been finding some clothes lately.",
      "verb": "finding"
    },
    {
      "sentence": "Tom has been seeing the neighbors since Monday.",
      "verb": "seeing"
    },
    {
      "sentence": "The manager has been completing the proposal recently.",
      "verb": "completing"
    },
    {
      "sentence": "The bird has been chasing the toy recently.",
      "verb": "chasing"
    },
    {
      "sentence": "You have been receiving the report all week.",
      "verb": "receiving"
    },
    {
      "sentence": "My brother has been listening to music recently.",
      "verb": "listening"
    },
    {
      "sentence": "The cat has been running in the park lately.",
      "verb": "running"
    },
    {
      "sentence": "Her sister has been drinking a smoothie lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been chasing its tail recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat has been eating the leftover food for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been completing the presentation lately.",
      "verb": "completing"
    },
    {
      "sentence": "Her sister has been forgetting the vacation recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "The cat has been eating its dinner all week.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been running around the house since Monday.",
      "verb": "running"
    },
    {
      "sentence": "I have been baking cookies for years.",
      "verb": "baking"
    },
    {
      "sentence": "I have been repairing the bike all day.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher has been watching a documentary all week.",
      "verb": "watching"
    },
    {
      "sentence": "My friend has been washing the clothes recently.",
      "verb": "washing"
    },
    {
      "sentence": "My friend has been emailing the manager since Monday.",
      "verb": "emailing"
    },
    {
      "sentence": "Our neighbors have been planning the situation lately.",
      "verb": "planning"
    },
    {
      "sentence": "The dog has been running across the field recently.",
      "verb": "running"
    },
    {
      "sentence": "I have been texting the doctor lately.",
      "verb": "texting"
    },
    {
      "sentence": "The cat has been catching a butterfly recently.",
      "verb": "catching"
    },
    {
      "sentence": "The company has been announcing the results recently.",
      "verb": "announcing"
    },
    {
      "sentence": "He has been studying science lately.",
      "verb": "studying"
    },
    {
      "sentence": "We have been painting a design lately.",
      "verb": "painting"
    },
    {
      "sentence": "Tom has been drawing an illustration for two hours.",
      "verb": "drawing"
    },
    {
      "sentence": "The manager has been thinking about the future recently.",
      "verb": "thinking"
    },
    {
      "sentence": "John has been building a project recently.",
      "verb": "building"
    },
    {
      "sentence": "You have been listening to the lecture lately.",
      "verb": "listening"
    },
    {
      "sentence": "My parents have been seeing the neighbors recently.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister has been returning to the office for three days.",
      "verb": "returning"
    },
    {
      "sentence": "Sarah has been preparing the assignment lately.",
      "verb": "preparing"
    },
    {
      "sentence": "The bird has been eating some food since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been sleeping in the corner lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "Tom has been fixing the door recently.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents have been drawing the wall lately.",
      "verb": "drawing"
    },
    {
      "sentence": "The team has been releasing the results for three days.",
      "verb": "releasing"
    },
    {
      "sentence": "Emma has been listening to the radio recently.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been planning the decision lately.",
      "verb": "planning"
    },
    {
      "sentence": "You have been repairing the bike for a month.",
      "verb": "repairing"
    },
    {
      "sentence": "Tom has been finding the ticket recently.",
      "verb": "finding"
    },
    {
      "sentence": "The teacher has been fixing the door recently.",
      "verb": "fixing"
    },
    {
      "sentence": "They have been completing the presentation since yesterday.",
      "verb": "completing"
    },
    {
      "sentence": "She has been making a salad lately.",
      "verb": "making"
    },
    {
      "sentence": "She has been listening to music lately.",
      "verb": "listening"
    },
    {
      "sentence": "Sarah has been playing guitar for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "We have been repairing the car since Monday.",
      "verb": "repairing"
    },
    {
      "sentence": "The manager has been painting an illustration for two hours.",
      "verb": "painting"
    },
    {
      "sentence": "The bird has been chasing its tail lately.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been fixing the sink recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The bird has been eating its breakfast all week.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been fixing the car lately.",
      "verb": "fixing"
    },
    {
      "sentence": "John has been submitting the contract for a week.",
      "verb": "submitting"
    },
    {
      "sentence": "The dog has been catching a butterfly recently.",
      "verb": "catching"
    },
    {
      "sentence": "The manager has been listening to a podcast for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been drinking juice for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been watching a series recently.",
      "verb": "watching"
    },
    {
      "sentence": "My parents have been seeing the client lately.",
      "verb": "seeing"
    },
    {
      "sentence": "My friend has been getting a book lately.",
      "verb": "getting"
    },
    {
      "sentence": "My parents have been starting the report recently.",
      "verb": "starting"
    },
    {
      "sentence": "He has been playing video games since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "We have been flying to the market for years.",
      "verb": "flying"
    },
    {
      "sentence": "Her sister has been visiting the client recently.",
      "verb": "visiting"
    },
    {
      "sentence": "Her sister has been planning the meeting for a week.",
      "verb": "planning"
    },
    {
      "sentence": "My friend has been texting the doctor for a week.",
      "verb": "texting"
    },
    {
      "sentence": "I have been creating a website recently.",
      "verb": "creating"
    },
    {
      "sentence": "The children have been eating lunch recently.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been finding a book for a week.",
      "verb": "finding"
    },
    {
      "sentence": "They have been giving groceries since Monday.",
      "verb": "giving"
    },
    {
      "sentence": "My parents have been traveling to the hospital lately.",
      "verb": "traveling"
    },
    {
      "sentence": "Sarah has been returning to school recently.",
      "verb": "returning"
    },
    {
      "sentence": "I have been coming to the hospital lately.",
      "verb": "coming"
    },
    {
      "sentence": "The teacher has been baking cookies for three days.",
      "verb": "baking"
    },
    {
      "sentence": "The students have been repairing the machine for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "The dog has been eating its breakfast all day.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been leaving to the market since Monday.",
      "verb": "leaving"
    },
    {
      "sentence": "The teacher has been listening to the radio for two hours.",
      "verb": "listening"
    },
    {
      "sentence": "We have been drinking tea lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The children have been painting a portrait for a month.",
      "verb": "painting"
    },
    {
      "sentence": "Tom has been cooking a meal lately.",
      "verb": "cooking"
    },
    {
      "sentence": "Tom has been speaking to the team recently.",
      "verb": "speaking"
    },
    {
      "sentence": "She has been having some fruit since this morning.",
      "verb": "having"
    },
    {
      "sentence": "They have been talking to the team for two hours.",
      "verb": "talking"
    },
    {
      "sentence": "My friend has been building a project for two hours.",
      "verb": "building"
    },
    {
      "sentence": "He has been listening to jazz since yesterday.",
      "verb": "listening"
    },
    {
      "sentence": "The children have been fixing the computer recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog has been chasing the mouse for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "The company has been completing the project lately.",
      "verb": "completing"
    },
    {
      "sentence": "Tom has been deciding on the trip lately.",
      "verb": "deciding"
    },
    {
      "sentence": "They have been considering the problem for two hours.",
      "verb": "considering"
    },
    {
      "sentence": "John has been preparing cookies all day.",
      "verb": "preparing"
    },
    {
      "sentence": "Emma has been speaking to my family recently.",
      "verb": "speaking"
    },
    {
      "sentence": "They have been watching a video since yesterday.",
      "verb": "watching"
    },
    {
      "sentence": "The manager has been designing a plan recently.",
      "verb": "designing"
    },
    {
      "sentence": "Tom has been emailing my family recently.",
      "verb": "emailing"
    },
    {
      "sentence": "My parents have been playing video games for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been sending the proposal recently.",
      "verb": "sending"
    },
    {
      "sentence": "The teacher has been contacting the boss lately.",
      "verb": "contacting"
    },
    {
      "sentence": "She has been meeting the neighbors all day.",
      "verb": "meeting"
    },
    {
      "sentence": "She has been having a salad all day.",
      "verb": "having"
    },
    {
      "sentence": "Emma has been having lunch since Monday.",
      "verb": "having"
    },
    {
      "sentence": "The bird has been running through the grass lately.",
      "verb": "running"
    },
    {
      "sentence": "They have been watching a series all day.",
      "verb": "watching"
    },
    {
      "sentence": "Our neighbors have been having soup lately.",
      "verb": "having"
    },
    {
      "sentence": "The bird has been playing with its owner recently.",
      "verb": "playing"
    },
    {
      "sentence": "John has been talking to my parents since this morning.",
      "verb": "talking"
    },
    {
      "sentence": "The cat has been chasing birds in the garden recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The students have been organizing the bathroom lately.",
      "verb": "organizing"
    },
    {
      "sentence": "The children have been coming home for a month.",
      "verb": "coming"
    },
    {
      "sentence": "She has been fixing the computer recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The cat has been catching the frisbee lately.",
      "verb": "catching"
    },
    {
      "sentence": "My brother has been watching a series for a week.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been catching the toy for two hours.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been playing soccer recently.",
      "verb": "playing"
    },
    {
      "sentence": "I have been washing the bathroom lately.",
      "verb": "washing"
    },
    {
      "sentence": "My brother has been finding a laptop recently.",
      "verb": "finding"
    },
    {
      "sentence": "She has been receiving the letter lately.",
      "verb": "receiving"
    },
    {
      "sentence": "Tom has been baking pasta for years.",
      "verb": "baking"
    },
    {
      "sentence": "The cat has been chasing the squirrel lately.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend has been creating an app recently.",
      "verb": "creating"
    },
    {
      "sentence": "My brother has been having dinner recently.",
      "verb": "having"
    },
    {
      "sentence": "He has been repairing the fence recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The students have been repairing the bike for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "You have been seeing the teacher recently.",
      "verb": "seeing"
    },
    {
      "sentence": "I have been studying science recently.",
      "verb": "studying"
    },
    {
      "sentence": "Her sister has been completing the report recently.",
      "verb": "completing"
    },
    {
      "sentence": "The team has been developing the update recently.",
      "verb": "developing"
    },
    {
      "sentence": "You have been playing tennis recently.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been drinking tea for years.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah has been eating lunch all day.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been designing a house lately.",
      "verb": "designing"
    },
    {
      "sentence": "He has been drinking a smoothie lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The manager has been selling the phone for two hours.",
      "verb": "selling"
    },
    {
      "sentence": "We have been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been giving the phone for a week.",
      "verb": "giving"
    },
    {
      "sentence": "The bird has been playing in the garden since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "We have been designing an app lately.",
      "verb": "designing"
    },
    {
      "sentence": "The children have been speaking to my family lately.",
      "verb": "speaking"
    },
    {
      "sentence": "We have been planning the decision recently.",
      "verb": "planning"
    },
    {
      "sentence": "John has been finding the phone recently.",
      "verb": "finding"
    },
    {
      "sentence": "The students have been deciding on the event recently.",
      "verb": "deciding"
    },
    {
      "sentence": "The bird has been playing in the park recently.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been tidying the house lately.",
      "verb": "tidying"
    },
    {
      "sentence": "He has been coming home lately.",
      "verb": "coming"
    },
    {
      "sentence": "My brother has been teaching the material lately.",
      "verb": "teaching"
    },
    {
      "sentence": "The cat has been eating its breakfast since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "They have been listening to jazz lately.",
      "verb": "listening"
    },
    {
      "sentence": "The company has been announcing the update for two hours.",
      "verb": "announcing"
    },
    {
      "sentence": "The children have been watching the game for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been playing with the other pets for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been playing football for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Tom has been texting my friend lately.",
      "verb": "texting"
    },
    {
      "sentence": "The children have been speaking to the professor lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been eating pizza all day.",
      "verb": "eating"
    },
    {
      "sentence": "She has been speaking to a colleague lately.",
      "verb": "speaking"
    },
    {
      "sentence": "My friend has been planning the options recently.",
      "verb": "planning"
    },
    {
      "sentence": "The manager has been sketching a poster lately.",
      "verb": "sketching"
    },
    {
      "sentence": "The teacher has been eating dinner all week.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been running to the store for two hours.",
      "verb": "running"
    },
    {
      "sentence": "Our neighbors have been tidying the house since this morning.",
      "verb": "tidying"
    },
    {
      "sentence": "Sarah has been visiting the neighbors recently.",
      "verb": "visiting"
    },
    {
      "sentence": "He has been calling my family lately.",
      "verb": "calling"
    },
    {
      "sentence": "The children have been considering the future recently.",
      "verb": "considering"
    },
    {
      "sentence": "My parents have been having breakfast recently.",
      "verb": "having"
    },
    {
      "sentence": "We have been watching the news recently.",
      "verb": "watching"
    },
    {
      "sentence": "The manager has been fixing the bike recently.",
      "verb": "fixing"
    },
    {
      "sentence": "The team has been developing the software since this morning.",
      "verb": "developing"
    },
    {
      "sentence": "The bird has been running in the yard for a week.",
      "verb": "running"
    },
    {
      "sentence": "The manager has been having a snack lately.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been running in the park recently.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been chasing the mouse for two hours.",
      "verb": "chasing"
    },
    {
      "sentence": "She has been finishing the presentation all week.",
      "verb": "finishing"
    },
    {
      "sentence": "The manager has been playing guitar recently.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been playing guitar for a week.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been catching the frisbee recently.",
      "verb": "catching"
    },
    {
      "sentence": "The teacher has been finishing the presentation recently.",
      "verb": "finishing"
    },
    {
      "sentence": "The children have been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "The team has been releasing the deal since Monday.",
      "verb": "releasing"
    },
    {
      "sentence": "My brother has been fixing the car recently.",
      "verb": "fixing"
    },
    {
      "sentence": "They have been playing soccer since Monday.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been organizing the garage recently.",
      "verb": "organizing"
    },
    {
      "sentence": "John has been teaching for the exam since this morning.",
      "verb": "teaching"
    },
    {
      "sentence": "The company has been releasing the software recently.",
      "verb": "releasing"
    },
    {
      "sentence": "Our neighbors have been eating pizza recently.",
      "verb": "eating"
    },
    {
      "sentence": "The dog has been chasing the other pets for a week.",
      "verb": "chasing"
    },
    {
      "sentence": "Her sister has been remembering the birthday party lately.",
      "verb": "remembering"
    },
    {
      "sentence": "John has been playing the piano lately.",
      "verb": "playing"
    },
    {
      "sentence": "The manager has been painting a picture all day.",
      "verb": "painting"
    },
    {
      "sentence": "My friend has been listening to the radio lately.",
      "verb": "listening"
    },
    {
      "sentence": "We have been drinking water since this morning.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been eating quickly recently.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been tidying the bathroom recently.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat has been running in the park for a week.",
      "verb": "running"
    },
    {
      "sentence": "John has been seeing the teacher recently.",
      "verb": "seeing"
    },
    {
      "sentence": "My friend has been repairing the computer recently.",
      "verb": "repairing"
    },
    {
      "sentence": "The team has been completing a new product recently.",
      "verb": "completing"
    },
    {
      "sentence": "John has been drinking milk all day.",
      "verb": "drinking"
    },
    {
      "sentence": "Emma has been meeting the manager recently.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog has been eating its breakfast since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "My friend has been getting a present since this morning.",
      "verb": "getting"
    },
    {
      "sentence": "They have been organizing the garage all day.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird has been sleeping under the table lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "You have been visiting the neighbors recently.",
      "verb": "visiting"
    },
    {
      "sentence": "The bird has been playing with the toy all day.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been learning the chapter lately.",
      "verb": "learning"
    },
    {
      "sentence": "He has been washing the kitchen lately.",
      "verb": "washing"
    },
    {
      "sentence": "You have been seeing the team recently.",
      "verb": "seeing"
    },
    {
      "sentence": "Our neighbors have been drinking tea lately.",
      "verb": "drinking"
    },
    {
      "sentence": "He has been seeing my friend recently.",
      "verb": "seeing"
    },
    {
      "sentence": "She has been speaking to the team recently.",
      "verb": "speaking"
    },
    {
      "sentence": "I have been going to the bank for years.",
      "verb": "going"
    },
    {
      "sentence": "My parents have been practicing English recently.",
      "verb": "practicing"
    },
    {
      "sentence": "My parents have been giving the keys recently.",
      "verb": "giving"
    },
    {
      "sentence": "She has been speaking with the teacher recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The company has been winning a new product all week.",
      "verb": "winning"
    },
    {
      "sentence": "The bird has been running in the yard all day.",
      "verb": "running"
    },
    {
      "sentence": "My brother has been coming to work recently.",
      "verb": "coming"
    },
    {
      "sentence": "You have been eating soup recently.",
      "verb": "eating"
    },
    {
      "sentence": "The team has been completing the championship lately.",
      "verb": "completing"
    },
    {
      "sentence": "The dog has been running through the grass lately.",
      "verb": "running"
    },
    {
      "sentence": "Emma has been washing the garage for a month.",
      "verb": "washing"
    },
    {
      "sentence": "John has been seeing the doctor lately.",
      "verb": "seeing"
    },
    {
      "sentence": "The children have been preparing the letter lately.",
      "verb": "preparing"
    },
    {
      "sentence": "They have been speaking to the teacher recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The students have been watching a series for a month.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been eating quickly since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been running through the grass lately.",
      "verb": "running"
    },
    {
      "sentence": "You have been fixing the bike lately.",
      "verb": "fixing"
    },
    {
      "sentence": "I have been building a house recently.",
      "verb": "building"
    },
    {
      "sentence": "He has been sending the project lately.",
      "verb": "sending"
    },
    {
      "sentence": "The bird has been eating a treat lately.",
      "verb": "eating"
    },
    {
      "sentence": "She has been texting the manager for a week.",
      "verb": "texting"
    },
    {
      "sentence": "The cat has been catching the ball recently.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister has been drawing an illustration lately.",
      "verb": "drawing"
    },
    {
      "sentence": "My parents have been drawing a landscape recently.",
      "verb": "drawing"
    },
    {
      "sentence": "The company has been winning the software for two hours.",
      "verb": "winning"
    },
    {
      "sentence": "Emma has been getting a new car for years.",
      "verb": "getting"
    },
    {
      "sentence": "They have been preparing soup for a week.",
      "verb": "preparing"
    },
    {
      "sentence": "The dog has been sleeping on the couch for two hours.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children have been creating a house lately.",
      "verb": "creating"
    },
    {
      "sentence": "The cat has been playing in the yard for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "You have been organizing the car recently.",
      "verb": "organizing"
    },
    {
      "sentence": "The cat has been sleeping in the corner lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "John has been drinking a smoothie for years.",
      "verb": "drinking"
    },
    {
      "sentence": "The teacher has been finding a laptop lately.",
      "verb": "finding"
    },
    {
      "sentence": "He has been creating a project since this morning.",
      "verb": "creating"
    },
    {
      "sentence": "My friend has been cooking a meal for three days.",
      "verb": "cooking"
    },
    {
      "sentence": "My brother has been finding a laptop lately.",
      "verb": "finding"
    },
    {
      "sentence": "My brother has been meeting my friend recently.",
      "verb": "meeting"
    },
    {
      "sentence": "Sarah has been repairing the roof recently.",
      "verb": "repairing"
    },
    {
      "sentence": "Our neighbors have been building a presentation lately.",
      "verb": "building"
    },
    {
      "sentence": "Her sister has been tidying the bathroom recently.",
      "verb": "tidying"
    },
    {
      "sentence": "My brother has been finding some clothes recently.",
      "verb": "finding"
    },
    {
      "sentence": "I have been sketching the wall all week.",
      "verb": "sketching"
    },
    {
      "sentence": "The teacher has been creating a presentation since Monday.",
      "verb": "creating"
    },
    {
      "sentence": "My brother has been thinking about the situation lately.",
      "verb": "thinking"
    },
    {
      "sentence": "They have been practicing for the exam recently.",
      "verb": "practicing"
    },
    {
      "sentence": "The children have been cleaning the dishes lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "You have been reviewing the lesson recently.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird has been playing with the toy for a week.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been deciding on the situation lately.",
      "verb": "deciding"
    },
    {
      "sentence": "Tom has been building a plan recently.",
      "verb": "building"
    },
    {
      "sentence": "Tom has been painting a design since yesterday.",
      "verb": "painting"
    },
    {
      "sentence": "The bird has been playing in the yard recently.",
      "verb": "playing"
    },
    {
      "sentence": "Emma has been forgetting the meeting recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "Sarah has been meeting the doctor recently.",
      "verb": "meeting"
    },
    {
      "sentence": "My friend has been painting a diagram recently.",
      "verb": "painting"
    },
    {
      "sentence": "Our neighbors have been understanding English recently.",
      "verb": "understanding"
    },
    {
      "sentence": "We have been starting the report lately.",
      "verb": "starting"
    },
    {
      "sentence": "She has been going to the office all week.",
      "verb": "going"
    },
    {
      "sentence": "He has been seeing my parents lately.",
      "verb": "seeing"
    },
    {
      "sentence": "My friend has been choosing some clothes recently.",
      "verb": "choosing"
    },
    {
      "sentence": "John has been deciding on the plan since yesterday.",
      "verb": "deciding"
    },
    {
      "sentence": "You have been fixing the computer since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "The children have been fixing the machine lately.",
      "verb": "fixing"
    },
    {
      "sentence": "Tom has been listening to the lecture recently.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been having a snack since this morning.",
      "verb": "having"
    },
    {
      "sentence": "The cat has been catching the frisbee since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "Her sister has been submitting the application lately.",
      "verb": "submitting"
    },
    {
      "sentence": "The team has been developing the deal since Monday.",
      "verb": "developing"
    },
    {
      "sentence": "You have been speaking to the doctor recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The manager has been teaching the notes since this morning.",
      "verb": "teaching"
    },
    {
      "sentence": "The bird has been running in the yard since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "You have been sketching a landscape recently.",
      "verb": "sketching"
    },
    {
      "sentence": "The dog has been catching the frisbee for three days.",
      "verb": "catching"
    },
    {
      "sentence": "The cat has been sleeping under the table for three days.",
      "verb": "sleeping"
    },
    {
      "sentence": "The manager has been running downtown lately.",
      "verb": "running"
    },
    {
      "sentence": "He has been listening to classical music lately.",
      "verb": "listening"
    },
    {
      "sentence": "The dog has been sleeping under the table lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "You have been listening to a podcast recently.",
      "verb": "listening"
    },
    {
      "sentence": "Tom has been completing the project for two hours.",
      "verb": "completing"
    },
    {
      "sentence": "Tom has been fixing the roof lately.",
      "verb": "fixing"
    },
    {
      "sentence": "The dog has been catching the mouse lately.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah has been seeing the client all day.",
      "verb": "seeing"
    },
    {
      "sentence": "She has been listening to a song recently.",
      "verb": "listening"
    },
    {
      "sentence": "I have been buying a present recently.",
      "verb": "buying"
    },
    {
      "sentence": "She has been designing a model lately.",
      "verb": "designing"
    },
    {
      "sentence": "The dog has been eating the leftover food for a week.",
      "verb": "eating"
    },
    {
      "sentence": "He has been washing the clothes lately.",
      "verb": "washing"
    },
    {
      "sentence": "He has been eating soup all day.",
      "verb": "eating"
    },
    {
      "sentence": "My brother has been meeting the team lately.",
      "verb": "meeting"
    },
    {
      "sentence": "The cat has been chasing the mouse recently.",
      "verb": "chasing"
    },
    {
      "sentence": "He has been calling the client lately.",
      "verb": "calling"
    },
    {
      "sentence": "My friend has been drinking coffee for a month.",
      "verb": "drinking"
    },
    {
      "sentence": "Sarah has been watching the news lately.",
      "verb": "watching"
    },
    {
      "sentence": "The children have been preparing dinner since yesterday.",
      "verb": "preparing"
    },
    {
      "sentence": "The company has been releasing the results recently.",
      "verb": "releasing"
    },
    {
      "sentence": "She has been cleaning the car lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "Our neighbors have been designing a presentation for a week.",
      "verb": "designing"
    },
    {
      "sentence": "Tom has been creating a website lately.",
      "verb": "creating"
    },
    {
      "sentence": "My brother has been building a house lately.",
      "verb": "building"
    },
    {
      "sentence": "You have been teaching Spanish lately.",
      "verb": "teaching"
    },
    {
      "sentence": "Tom has been deciding on the meeting all day.",
      "verb": "deciding"
    },
    {
      "sentence": "Emma has been tidying the garage lately.",
      "verb": "tidying"
    },
    {
      "sentence": "The teacher has been drinking coffee for a week.",
      "verb": "drinking"
    },
    {
      "sentence": "The students have been designing a model lately.",
      "verb": "designing"
    },
    {
      "sentence": "The cat has been sleeping under the table for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "John has been seeing my family for a month.",
      "verb": "seeing"
    },
    {
      "sentence": "I have been visiting my grandmother lately.",
      "verb": "visiting"
    },
    {
      "sentence": "The team has been launching the contract for a week.",
      "verb": "launching"
    },
    {
      "sentence": "The bird has been running in the garden since yesterday.",
      "verb": "running"
    },
    {
      "sentence": "He has been eating a salad lately.",
      "verb": "eating"
    },
    {
      "sentence": "The students have been preparing breakfast recently.",
      "verb": "preparing"
    },
    {
      "sentence": "They have been washing the car recently.",
      "verb": "washing"
    },
    {
      "sentence": "The manager has been preparing soup recently.",
      "verb": "preparing"
    },
    {
      "sentence": "The teacher has been eating dinner all day.",
      "verb": "eating"
    },
    {
      "sentence": "They have been drinking juice lately.",
      "verb": "drinking"
    },
    {
      "sentence": "The cat has been catching a treat for three days.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been cooking lunch all week.",
      "verb": "cooking"
    },
    {
      "sentence": "John has been making cookies lately.",
      "verb": "making"
    },
    {
      "sentence": "He has been drinking some water recently.",
      "verb": "drinking"
    },
    {
      "sentence": "I have been understanding mathematics recently.",
      "verb": "understanding"
    },
    {
      "sentence": "We have been watching TV lately.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah has been seeing my grandmother lately.",
      "verb": "seeing"
    },
    {
      "sentence": "My parents have been finding the ticket since Monday.",
      "verb": "finding"
    },
    {
      "sentence": "I have been tidying the bathroom since yesterday.",
      "verb": "tidying"
    },
    {
      "sentence": "The cat has been catching a butterfly all week.",
      "verb": "catching"
    },
    {
      "sentence": "I have been listening to the lecture lately.",
      "verb": "listening"
    },
    {
      "sentence": "Our neighbors have been walking to the office recently.",
      "verb": "walking"
    },
    {
      "sentence": "The manager has been listening to a song lately.",
      "verb": "listening"
    },
    {
      "sentence": "The dog has been chasing its tail since yesterday.",
      "verb": "chasing"
    },
    {
      "sentence": "They have been emailing my friend recently.",
      "verb": "emailing"
    },
    {
      "sentence": "The bird has been sleeping in the sun recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "We have been baking cookies recently.",
      "verb": "baking"
    },
    {
      "sentence": "My friend has been fixing the roof recently.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents have been running to the airport lately.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been sleeping on the bed recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "Our neighbors have been designing a project for two hours.",
      "verb": "designing"
    },
    {
      "sentence": "The cat has been chasing the ball recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The children have been calling my parents since this morning.",
      "verb": "calling"
    },
    {
      "sentence": "The cat has been eating its food for two hours.",
      "verb": "eating"
    },
    {
      "sentence": "The bird has been running in the yard recently.",
      "verb": "running"
    },
    {
      "sentence": "You have been building an app all week.",
      "verb": "building"
    },
    {
      "sentence": "The children have been speaking to the team lately.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents have been watching TV lately.",
      "verb": "watching"
    },
    {
      "sentence": "John has been texting the manager recently.",
      "verb": "texting"
    },
    {
      "sentence": "He has been playing tennis lately.",
      "verb": "playing"
    },
    {
      "sentence": "They have been watching a documentary lately.",
      "verb": "watching"
    },
    {
      "sentence": "The bird has been catching a butterfly lately.",
      "verb": "catching"
    },
    {
      "sentence": "She has been cooking a meal recently.",
      "verb": "cooking"
    },
    {
      "sentence": "He has been traveling to the store lately.",
      "verb": "traveling"
    },
    {
      "sentence": "She has been repairing the door for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "John has been listening to a podcast since this morning.",
      "verb": "listening"
    },
    {
      "sentence": "She has been eating a sandwich lately.",
      "verb": "eating"
    },
    {
      "sentence": "Her sister has been planning the problem lately.",
      "verb": "planning"
    },
    {
      "sentence": "Emma has been flying downtown lately.",
      "verb": "flying"
    },
    {
      "sentence": "The dog has been playing with the ball for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been playing with the toy all week.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been running in the garden lately.",
      "verb": "running"
    },
    {
      "sentence": "Her sister has been coming to the hospital lately.",
      "verb": "coming"
    },
    {
      "sentence": "John has been cleaning the office recently.",
      "verb": "cleaning"
    },
    {
      "sentence": "He has been preparing breakfast recently.",
      "verb": "preparing"
    },
    {
      "sentence": "The manager has been drinking coffee lately.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been sketching a design recently.",
      "verb": "sketching"
    },
    {
      "sentence": "The children have been thinking about the future lately.",
      "verb": "thinking"
    },
    {
      "sentence": "I have been repairing the machine since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "The bird has been playing in the garden all week.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been reviewing the material lately.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird has been eating its dinner lately.",
      "verb": "eating"
    },
    {
      "sentence": "The team has been developing the software for a month.",
      "verb": "developing"
    },
    {
      "sentence": "She has been calling the office recently.",
      "verb": "calling"
    },
    {
      "sentence": "The cat has been eating its food since Monday.",
      "verb": "eating"
    },
    {
      "sentence": "John has been cooking pasta recently.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend has been returning to the beach recently.",
      "verb": "returning"
    },
    {
      "sentence": "Tom has been fixing the bike since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "My parents have been contacting customer service since Monday.",
      "verb": "contacting"
    },
    {
      "sentence": "The cat has been playing with the toy for a week.",
      "verb": "playing"
    },
    {
      "sentence": "They have been listening to the radio lately.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been watching TV lately.",
      "verb": "watching"
    },
    {
      "sentence": "The teacher has been remembering the birthday party lately.",
      "verb": "remembering"
    },
    {
      "sentence": "My brother has been reading science lately.",
      "verb": "reading"
    },
    {
      "sentence": "Emma has been having a sandwich recently.",
      "verb": "having"
    },
    {
      "sentence": "She has been leaving to the bank all week.",
      "verb": "leaving"
    },
    {
      "sentence": "John has been having some fruit lately.",
      "verb": "having"
    },
    {
      "sentence": "Emma has been building an app since this morning.",
      "verb": "building"
    },
    {
      "sentence": "My brother has been speaking to the neighbors since Monday.",
      "verb": "speaking"
    },
    {
      "sentence": "My parents have been designing a plan recently.",
      "verb": "designing"
    },
    {
      "sentence": "My parents have been practicing grammar recently.",
      "verb": "practicing"
    },
    {
      "sentence": "My friend has been watching a movie all day.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been chasing the squirrel recently.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been listening to the news lately.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been speaking with the neighbors all week.",
      "verb": "speaking"
    },
    {
      "sentence": "He has been choosing groceries lately.",
      "verb": "choosing"
    },
    {
      "sentence": "The team has been announcing the update for a month.",
      "verb": "announcing"
    },
    {
      "sentence": "We have been contacting the team lately.",
      "verb": "contacting"
    },
    {
      "sentence": "The cat has been sleeping by the window recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "She has been practicing vocabulary lately.",
      "verb": "practicing"
    },
    {
      "sentence": "My parents have been making a meal recently.",
      "verb": "making"
    },
    {
      "sentence": "My parents have been watching a movie lately.",
      "verb": "watching"
    },
    {
      "sentence": "John has been eating some fruit recently.",
      "verb": "eating"
    },
    {
      "sentence": "Tom has been playing football lately.",
      "verb": "playing"
    },
    {
      "sentence": "My parents have been watching TV recently.",
      "verb": "watching"
    },
    {
      "sentence": "I have been playing golf since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "I have been making soup lately.",
      "verb": "making"
    },
    {
      "sentence": "They have been drinking tea recently.",
      "verb": "drinking"
    },
    {
      "sentence": "My parents have been choosing a new car lately.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird has been running in the yard lately.",
      "verb": "running"
    },
    {
      "sentence": "My friend has been writing the report all week.",
      "verb": "writing"
    },
    {
      "sentence": "Her sister has been forgetting the meeting all day.",
      "verb": "forgetting"
    },
    {
      "sentence": "The company has been completing the software recently.",
      "verb": "completing"
    },
    {
      "sentence": "Our neighbors have been cooking rice lately.",
      "verb": "cooking"
    },
    {
      "sentence": "My friend has been cleaning the dishes lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "My brother has been having breakfast lately.",
      "verb": "having"
    },
    {
      "sentence": "Tom has been fixing the roof for years.",
      "verb": "fixing"
    },
    {
      "sentence": "My friend has been reading vocabulary since this morning.",
      "verb": "reading"
    },
    {
      "sentence": "The manager has been painting a landscape all week.",
      "verb": "painting"
    },
    {
      "sentence": "Emma has been cleaning the garage lately.",
      "verb": "cleaning"
    },
    {
      "sentence": "The cat has been catching the mouse recently.",
      "verb": "catching"
    },
    {
      "sentence": "The dog has been catching the ball recently.",
      "verb": "catching"
    },
    {
      "sentence": "Tom has been playing golf since yesterday.",
      "verb": "playing"
    },
    {
      "sentence": "She has been sketching a portrait for a week.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma has been sketching a diagram lately.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister has been repairing the fence lately.",
      "verb": "repairing"
    },
    {
      "sentence": "Emma has been texting the office recently.",
      "verb": "texting"
    },
    {
      "sentence": "My friend has been buying some clothes lately.",
      "verb": "buying"
    },
    {
      "sentence": "The dog has been eating its dinner recently.",
      "verb": "eating"
    },
    {
      "sentence": "She has been calling the doctor lately.",
      "verb": "calling"
    },
    {
      "sentence": "The dog has been chasing its tail since this morning.",
      "verb": "chasing"
    },
    {
      "sentence": "The cat has been playing with its owner for a month.",
      "verb": "playing"
    },
    {
      "sentence": "The company has been winning the deal lately.",
      "verb": "winning"
    },
    {
      "sentence": "The bird has been sleeping on the couch lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "She has been drinking coffee for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird has been playing with the other pets for a month.",
      "verb": "playing"
    },
    {
      "sentence": "Our neighbors have been finding a book lately.",
      "verb": "finding"
    },
    {
      "sentence": "My parents have been sketching a diagram recently.",
      "verb": "sketching"
    },
    {
      "sentence": "Sarah has been returning to the park since yesterday.",
      "verb": "returning"
    },
    {
      "sentence": "They have been organizing the kitchen for a month.",
      "verb": "organizing"
    },
    {
      "sentence": "The teacher has been understanding the notes since Monday.",
      "verb": "understanding"
    },
    {
      "sentence": "Emma has been forgetting the trip recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "Tom has been remembering the vacation for a week.",
      "verb": "remembering"
    },
    {
      "sentence": "My friend has been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "The cat has been catching the ball lately.",
      "verb": "catching"
    },
    {
      "sentence": "Emma has been forgetting the trip since yesterday.",
      "verb": "forgetting"
    },
    {
      "sentence": "The teacher has been listening to music all week.",
      "verb": "listening"
    },
    {
      "sentence": "The cat has been playing in the park for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been eating the leftover food lately.",
      "verb": "eating"
    },
    {
      "sentence": "She has been seeing my family lately.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister has been selling a new car lately.",
      "verb": "selling"
    },
    {
      "sentence": "I have been having pizza for years.",
      "verb": "having"
    },
    {
      "sentence": "Our neighbors have been watching a series since Monday.",
      "verb": "watching"
    },
    {
      "sentence": "John has been drinking tea lately.",
      "verb": "drinking"
    },
    {
      "sentence": "Her sister has been having breakfast lately.",
      "verb": "having"
    },
    {
      "sentence": "We have been drawing a portrait lately.",
      "verb": "drawing"
    },
    {
      "sentence": "John has been tidying the car all day.",
      "verb": "tidying"
    },
    {
      "sentence": "The team has been launching the update lately.",
      "verb": "launching"
    },
    {
      "sentence": "You have been drinking juice for three days.",
      "verb": "drinking"
    },
    {
      "sentence": "The students have been playing soccer recently.",
      "verb": "playing"
    },
    {
      "sentence": "He has been remembering the future for a month.",
      "verb": "remembering"
    },
    {
      "sentence": "Emma has been sketching a landscape recently.",
      "verb": "sketching"
    },
    {
      "sentence": "Emma has been sketching a poster since Monday.",
      "verb": "sketching"
    },
    {
      "sentence": "The cat has been chasing birds in the garden lately.",
      "verb": "chasing"
    },
    {
      "sentence": "The manager has been baking a cake recently.",
      "verb": "baking"
    },
    {
      "sentence": "The team has been winning the update since this morning.",
      "verb": "winning"
    },
    {
      "sentence": "My friend has been playing tennis recently.",
      "verb": "playing"
    },
    {
      "sentence": "She has been buying a new house for a week.",
      "verb": "buying"
    },
    {
      "sentence": "Tom has been visiting the manager all day.",
      "verb": "visiting"
    },
    {
      "sentence": "Tom has been fixing the door lately.",
      "verb": "fixing"
    },
    {
      "sentence": "John has been remembering the vacation recently.",
      "verb": "remembering"
    },
    {
      "sentence": "Tom has been reading vocabulary recently.",
      "verb": "reading"
    },
    {
      "sentence": "My parents have been sending the application lately.",
      "verb": "sending"
    },
    {
      "sentence": "I have been designing a website since yesterday.",
      "verb": "designing"
    },
    {
      "sentence": "They have been watching a video recently.",
      "verb": "watching"
    },
    {
      "sentence": "The dog has been running in the yard all week.",
      "verb": "running"
    },
    {
      "sentence": "The manager has been drinking some water lately.",
      "verb": "drinking"
    },
    {
      "sentence": "We have been watching the game lately.",
      "verb": "watching"
    },
    {
      "sentence": "My parents have been organizing the house lately.",
      "verb": "organizing"
    },
    {
      "sentence": "Tom has been listening to a podcast lately.",
      "verb": "listening"
    },
    {
      "sentence": "He has been talking to my friend lately.",
      "verb": "talking"
    },
    {
      "sentence": "She has been completing the contract lately.",
      "verb": "completing"
    },
    {
      "sentence": "John has been having soup all day.",
      "verb": "having"
    },
    {
      "sentence": "The bird has been playing with the ball since this morning.",
      "verb": "playing"
    },
    {
      "sentence": "John has been building a model since yesterday.",
      "verb": "building"
    },
    {
      "sentence": "I have been visiting the team recently.",
      "verb": "visiting"
    },
    {
      "sentence": "The teacher has been building a plan recently.",
      "verb": "building"
    },
    {
      "sentence": "The teacher has been emailing my parents lately.",
      "verb": "emailing"
    },
    {
      "sentence": "Our neighbors have been getting the phone all week.",
      "verb": "getting"
    },
    {
      "sentence": "You have been listening to classical music lately.",
      "verb": "listening"
    },
    {
      "sentence": "The teacher has been learning the textbook since yesterday.",
      "verb": "learning"
    },
    {
      "sentence": "The manager has been talking to the client since yesterday.",
      "verb": "talking"
    },
    {
      "sentence": "The dog has been chasing the squirrel lately.",
      "verb": "chasing"
    },
    {
      "sentence": "The bird has been eating its food since this morning.",
      "verb": "eating"
    },
    {
      "sentence": "The manager has been reading French lately.",
      "verb": "reading"
    },
    {
      "sentence": "Our neighbors have been having a salad recently.",
      "verb": "having"
    },
    {
      "sentence": "You have been thinking about the trip lately.",
      "verb": "thinking"
    },
    {
      "sentence": "We have been painting a diagram recently.",
      "verb": "painting"
    },
    {
      "sentence": "The dog has been catching the toy since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "We have been washing the clothes lately.",
      "verb": "washing"
    },
    {
      "sentence": "Sarah has been calling the doctor for a month.",
      "verb": "calling"
    },
    {
      "sentence": "John has been remembering the options lately.",
      "verb": "remembering"
    },
    {
      "sentence": "Emma has been having pizza recently.",
      "verb": "having"
    },
    {
      "sentence": "They have been washing the dishes for two hours.",
      "verb": "washing"
    },
    {
      "sentence": "The cat has been eating its food lately.",
      "verb": "eating"
    },
    {
      "sentence": "Sarah has been playing golf recently.",
      "verb": "playing"
    },
    {
      "sentence": "You have been listening to the lecture recently.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been watching a show for a week.",
      "verb": "watching"
    },
    {
      "sentence": "She has been finding the keys since this morning.",
      "verb": "finding"
    },
    {
      "sentence": "My brother has been texting the boss since Monday.",
      "verb": "texting"
    },
    {
      "sentence": "He has been speaking with the doctor lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The dog has been running around the house recently.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been sleeping by the window for a month.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been seeing my family for three days.",
      "verb": "seeing"
    },
    {
      "sentence": "Emma has been seeing an old friend lately.",
      "verb": "seeing"
    },
    {
      "sentence": "They have been eating soup all week.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors have been watching the game recently.",
      "verb": "watching"
    },
    {
      "sentence": "We have been building a presentation all week.",
      "verb": "building"
    },
    {
      "sentence": "You have been painting a landscape recently.",
      "verb": "painting"
    },
    {
      "sentence": "Her sister has been texting my family lately.",
      "verb": "texting"
    },
    {
      "sentence": "I have been drinking water recently.",
      "verb": "drinking"
    },
    {
      "sentence": "The bird has been running across the field since this morning.",
      "verb": "running"
    },
    {
      "sentence": "You have been reviewing Spanish for a month.",
      "verb": "reviewing"
    },
    {
      "sentence": "The bird has been catching the ball lately.",
      "verb": "catching"
    },
    {
      "sentence": "My brother has been painting a design for three days.",
      "verb": "painting"
    },
    {
      "sentence": "John has been playing golf lately.",
      "verb": "playing"
    },
    {
      "sentence": "Sarah has been studying the material lately.",
      "verb": "studying"
    },
    {
      "sentence": "Tom has been calling the boss lately.",
      "verb": "calling"
    },
    {
      "sentence": "You have been choosing a laptop recently.",
      "verb": "choosing"
    },
    {
      "sentence": "You have been watching the news for three days.",
      "verb": "watching"
    },
    {
      "sentence": "You have been getting a gift lately.",
      "verb": "getting"
    },
    {
      "sentence": "The children have been watching a video all day.",
      "verb": "watching"
    },
    {
      "sentence": "Tom has been reading science lately.",
      "verb": "reading"
    },
    {
      "sentence": "The company has been developing the deal for two hours.",
      "verb": "developing"
    },
    {
      "sentence": "My friend has been drawing a design recently.",
      "verb": "drawing"
    },
    {
      "sentence": "My brother has been listening to music for a month.",
      "verb": "listening"
    },
    {
      "sentence": "The bird has been catching the frisbee since this morning.",
      "verb": "catching"
    },
    {
      "sentence": "We have been watching a movie for a week.",
      "verb": "watching"
    },
    {
      "sentence": "The students have been emailing the doctor recently.",
      "verb": "emailing"
    },
    {
      "sentence": "The students have been playing guitar all day.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been playing with the other pets for three days.",
      "verb": "playing"
    },
    {
      "sentence": "She has been creating a presentation lately.",
      "verb": "creating"
    },
    {
      "sentence": "My parents have been visiting the teacher recently.",
      "verb": "visiting"
    },
    {
      "sentence": "Our neighbors have been drinking milk recently.",
      "verb": "drinking"
    },
    {
      "sentence": "She has been contacting the boss for two hours.",
      "verb": "contacting"
    },
    {
      "sentence": "My brother has been forgetting the situation recently.",
      "verb": "forgetting"
    },
    {
      "sentence": "The teacher has been planning the situation lately.",
      "verb": "planning"
    },
    {
      "sentence": "I have been repairing the fence since yesterday.",
      "verb": "repairing"
    },
    {
      "sentence": "Sarah has been deciding on the situation lately.",
      "verb": "deciding"
    },
    {
      "sentence": "The children have been coming to the library since this morning.",
      "verb": "coming"
    },
    {
      "sentence": "The teacher has been designing a prototype recently.",
      "verb": "designing"
    },
    {
      "sentence": "Tom has been driving home lately.",
      "verb": "driving"
    },
    {
      "sentence": "My parents have been having pizza all week.",
      "verb": "having"
    },
    {
      "sentence": "You have been finishing the document all week.",
      "verb": "finishing"
    },
    {
      "sentence": "Her sister has been speaking to the boss lately.",
      "verb": "speaking"
    },
    {
      "sentence": "Emma has been speaking with the teacher recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The teacher has been repairing the roof for three days.",
      "verb": "repairing"
    },
    {
      "sentence": "The teacher has been repairing the machine lately.",
      "verb": "repairing"
    },
    {
      "sentence": "My brother has been giving a present lately.",
      "verb": "giving"
    },
    {
      "sentence": "The cat has been sleeping on the bed for a week.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children have been fixing the computer for a week.",
      "verb": "fixing"
    },
    {
      "sentence": "You have been eating pasta for years.",
      "verb": "eating"
    },
    {
      "sentence": "We have been watching a video lately.",
      "verb": "watching"
    },
    {
      "sentence": "Sarah has been listening to the radio lately.",
      "verb": "listening"
    },
    {
      "sentence": "Tom has been returning to the office lately.",
      "verb": "returning"
    },
    {
      "sentence": "They have been arriving to the park lately.",
      "verb": "arriving"
    },
    {
      "sentence": "Emma has been selling the keys recently.",
      "verb": "selling"
    },
    {
      "sentence": "You have been getting groceries lately.",
      "verb": "getting"
    },
    {
      "sentence": "Tom has been playing soccer for two hours.",
      "verb": "playing"
    },
    {
      "sentence": "The children have been selling a new car since Monday.",
      "verb": "selling"
    },
    {
      "sentence": "John has been flying to the library for a month.",
      "verb": "flying"
    },
    {
      "sentence": "He has been playing the piano lately.",
      "verb": "playing"
    },
    {
      "sentence": "The teacher has been listening to the lecture lately.",
      "verb": "listening"
    },
    {
      "sentence": "My brother has been baking a cake for years.",
      "verb": "baking"
    },
    {
      "sentence": "Her sister has been contacting the manager lately.",
      "verb": "contacting"
    },
    {
      "sentence": "Emma has been remembering the vacation lately.",
      "verb": "remembering"
    },
    {
      "sentence": "The manager has been choosing the keys for years.",
      "verb": "choosing"
    },
    {
      "sentence": "The bird has been running across the field lately.",
      "verb": "running"
    },
    {
      "sentence": "The dog has been playing with the ball recently.",
      "verb": "playing"
    },
    {
      "sentence": "I have been repairing the fence lately.",
      "verb": "repairing"
    },
    {
      "sentence": "John has been seeing the neighbors for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "Her sister has been fixing the car recently.",
      "verb": "fixing"
    },
    {
      "sentence": "Emma has been reading science recently.",
      "verb": "reading"
    },
    {
      "sentence": "My friend has been painting a portrait lately.",
      "verb": "painting"
    },
    {
      "sentence": "My brother has been playing guitar all week.",
      "verb": "playing"
    },
    {
      "sentence": "She has been seeing an old friend recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird has been sleeping in the corner recently.",
      "verb": "sleeping"
    },
    {
      "sentence": "My brother has been practicing French recently.",
      "verb": "practicing"
    },
    {
      "sentence": "The students have been sketching the wall lately.",
      "verb": "sketching"
    },
    {
      "sentence": "Sarah has been fixing the car since this morning.",
      "verb": "fixing"
    },
    {
      "sentence": "We have been preparing the task for three days.",
      "verb": "preparing"
    },
    {
      "sentence": "The children have been listening to a podcast for years.",
      "verb": "listening"
    },
    {
      "sentence": "My friend has been watching a series lately.",
      "verb": "watching"
    },
    {
      "sentence": "She has been having a meal lately.",
      "verb": "having"
    },
    {
      "sentence": "The dog has been catching the mouse recently.",
      "verb": "catching"
    },
    {
      "sentence": "The bird has been eating its dinner all week.",
      "verb": "eating"
    },
    {
      "sentence": "You have been finding a new house recently.",
      "verb": "finding"
    },
    {
      "sentence": "My parents have been emailing the manager recently.",
      "verb": "emailing"
    },
    {
      "sentence": "You have been making rice recently.",
      "verb": "making"
    },
    {
      "sentence": "My friend has been tidying the garage all day.",
      "verb": "tidying"
    },
    {
      "sentence": "The company has been releasing the championship lately.",
      "verb": "releasing"
    },
    {
      "sentence": "She has been eating lunch recently.",
      "verb": "eating"
    },
    {
      "sentence": "Our neighbors have been eating some fruit for a month.",
      "verb": "eating"
    },
    {
      "sentence": "The teacher has been baking a cake lately.",
      "verb": "baking"
    },
    {
      "sentence": "Sarah has been returning to work all week.",
      "verb": "returning"
    },
    {
      "sentence": "Her sister has been designing a house lately.",
      "verb": "designing"
    },
    {
      "sentence": "The students have been listening to jazz for years.",
      "verb": "listening"
    },
    {
      "sentence": "He has been meeting the manager for three days.",
      "verb": "meeting"
    },
    {
      "sentence": "The dog has been sleeping on the bed lately.",
      "verb": "sleeping"
    },
    {
      "sentence": "The children have been studying Spanish recently.",
      "verb": "studying"
    },
    {
      "sentence": "The cat has been playing in the yard all week.",
      "verb": "playing"
    },
    {
      "sentence": "The cat has been catching a treat lately.",
      "verb": "catching"
    },
    {
      "sentence": "I have been making a cake recently.",
      "verb": "making"
    },
    {
      "sentence": "Sarah has been playing football recently.",
      "verb": "playing"
    },
    {
      "sentence": "My brother has been thinking about the problem lately.",
      "verb": "thinking"
    },
    {
      "sentence": "The cat has been playing with the toy for years.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been catching a treat lately.",
      "verb": "catching"
    },
    {
      "sentence": "The students have been seeing the doctor for two hours.",
      "verb": "seeing"
    },
    {
      "sentence": "I have been speaking to the neighbors recently.",
      "verb": "speaking"
    },
    {
      "sentence": "The bird has been eating quickly since yesterday.",
      "verb": "eating"
    },
    {
      "sentence": "We have been getting the keys since yesterday.",
      "verb": "getting"
    },
    {
      "sentence": "My friend has been seeing the team recently.",
      "verb": "seeing"
    },
    {
      "sentence": "The bird has been catching a bird recently.",
      "verb": "catching"
    },
    {
      "sentence": "John has been teaching the lesson recently.",
      "verb": "teaching"
    },
    {
      "sentence": "The students have been studying the lesson recently.",
      "verb": "studying"
    },
    {
      "sentence": "The bird has been playing with the ball lately.",
      "verb": "playing"
    },
    {
      "sentence": "The bird has been catching the toy since Monday.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah has been coming to the library lately.",
      "verb": "coming"
    },
    {
      "sentence": "Her sister has been creating a model lately.",
      "verb": "creating"
    },
    {
      "sentence": "Our neighbors have been sketching a design lately.",
      "verb": "sketching"
    },
    {
      "sentence": "Her sister has been teaching vocabulary lately.",
      "verb": "teaching"
    },
    {
      "sentence": "The teacher has been playing chess recently.",
      "verb": "playing"
    },
    {
      "sentence": "The dog has been chasing the mouse lately.",
      "verb": "chasing"
    },
    {
      "sentence": "My friend has been creating a model since yesterday.",
      "verb": "creating"
    },
    {
      "sentence": "The cat has been sleeping by the window for years.",
      "verb": "sleeping"
    },
    {
      "sentence": "My parents have been speaking to the client lately.",
      "verb": "speaking"
    },
    {
      "sentence": "The children have been listening to a song recently.",
      "verb": "listening"
    },
    {
      "sentence": "The manager has been organizing the garage lately.",
      "verb": "organizing"
    },
    {
      "sentence": "The bird has been running through the grass recently.",
      "verb": "running"
    },
    {
      "sentence": "The bird has been eating the leftover food recently.",
      "verb": "eating"
    },
    {
      "sentence": "The cat has been catching the mouse lately.",
      "verb": "catching"
    },
    {
      "sentence": "Sarah has been tidying the office all day.",
      "verb": "tidying"
    },
    {
      "sentence": "The bird has been chasing the squirrel since Monday.",
      "verb": "chasing"
    }
  ]
}