{
  "tense": "Future Perfect Continuous",
  "description": "Used for actions that will have been ongoing until a future point",
  "examples": [
    {
      "sentence": "Tom will have been speaking the newspaper in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the newspaper tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the office soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the class tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking English later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the interview next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking pizza in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking lunch in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the homework in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the message later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking water next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking breakfast next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the book soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the exam this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the contract in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a sandwich in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the project next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the lesson this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the garden in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the car this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the floor tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking French this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the phone someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the ticket soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the piano this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the door this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking dinner in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a letter next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a song tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a cake in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the window someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the presentation next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the computer next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the report in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the dishes in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking music next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the game this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking a movie next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the email this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the test tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the document in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house soon.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house someday.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house in two days.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house next year.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house in the future.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the house this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package later today.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package next week.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package in an hour.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package tonight.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package this weekend.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package next month.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package tomorrow.",
      "verb": "speaking"
    },
    {
      "sentence": "Tom will have been speaking the package in the future.",
      "verb": "speaking"
    }
  ]
}